{"content":"1.\tCreating Master Data Directly in the System0.\tLoad the data. Creating Master Data Directly in the System1.\tLoading Master Data for Characteristic \"Product\"2.\tLoading Transaction Data3.\tDene a query that is used as the basis for a Web application and allows for an ad-hoc analysis of the data in the Web.4.\tYou create the query in the following step:5.\tDening Queries6.\tCreate a Web application with navigation options and functions, such as printing based on the query.7.\tYou create the Web application in the following step:8.\tCreating Web Applications9.\tAnalyze the data in the Web application, add comments to it, and broadcast it by E-mail to other employees.10.\tYou analyze and broadcast the data in the following steps:11.\tAnalyzing Data in the Web Application12.\tBroadcasting Web Applications by E-Mail","plantuml":"start\n\n:Load Master Data;\n:Load Transaction Data;\n\n:Dene a query;\n\nnote right\n  Basis for a Web application\n  Allow ad-hoc analysis of Web data\nend note\n\n:Create Web Applications;\n:Analyze data;\n:Add comments to data;\n:Broadcast the data by E-mail to other employees;\n\nstop"}
{"content":"2.\tLog onto the BI system1.\tLog onto the BI system with a user that has sufficient authorizations for executing the scenario.2.\tStart the Data Warehousing Workbench in the SAP menu by choosing Modeling Data Warehousing Workbench: Modeling.3.\tUnder Modeling, choose Info  Objects. The Info  Object tree is displayed.4.\tFrom the context menu at the root node Info Objects of the Info Object tree, choose Create Info Area.5.\tOn the next screen, enter a technical name and a description for the Info Area. The Info Area is displayed in the Info Object tree.6.\tIt is used to group your Info Objects.7.\tIn the context menu of the Info Area, choose Create Info Object Catalog.8.\tOn the next screen, enter a technical name and description, and select Key Figure as the Info Object Type.9.\tChoose Create9. Activate the Info Object catalog.10.\tThe Info Object catalog is displayed in your Info Area.11.\tIt is used to group your key gures.12.\tPerform the following procedures to create each of the key gures Revenue ,Quantity and Price","plantuml":"start\nif (User authorizations are sufficient?) then (no)\n  stop\nelse (yes)\n:Log in;\n:Choose Modeling Data Warehousing Workbench: Modeling;\n:Data Warehousing Workbench is started;\n:Choose \"Info Objects\";\n:Info Object tree is displayed;\n:Open root node context menu;\n:Choose \"Create Info Area\";\n\nfork\n  :Enter a technical name;\nfork again\n  :Enter a description;\nend fork\n\n:Info Area is displayed;\n\nnote right\nGroup Info Objects\nend note\n\n:Open Info Area context menu;\n:Choose \"Create Info Object Catalog\";\n\nfork\n  :Enter a technical name;\nfork again\n  :Enter a description;\nend fork\n\n:Select \"Key Figure\";\n:Choose \"Create\";\n:Activate Info Object Catalog;\n:Info Object catalog is displayed;\n\nnote right\nGroup key figures\nend note\n\nfork\n  :Create Revenue;\nfork again\n  :Create Quantity;\nfork again\n  :Create Price;\nend fork\n\nstop"}
{"content":"3.\tCreating Data sources for Master Data of Characteristic \"Product\"1. You are in the Modeling functional area of the Data Warehousing Workbench2. Choose Info Provider. The Info Provider tree is displayed. The Info Area created previously in the Info Object tree is also displayed in the Info Provider tree. It contains the characteristics that were dened as Info Provider and is used to group further objects.3. In the context menu of the Info Area, choose Create Info Cube.4. In the next screen, enter ZD_SALES as the technical name under Info Cube and Sales Overview as the description.5. Select Standard Info Cube as Info Provider Type and choose Create. You go to the screen for Info Cube editing.6. Choose Create New Dimensions in the context menu of the folder Dimensions. 7. Enter Product as the description for the new dimension and choose Create Another Dimension.8. Enter Sales Organization as the description for the new dimension and choose Continue. The dimensions are inserted.9. In the toolbar in the left area, choose Info Object Catalog.10. On the next screen, select your Info Object catalog for characteristics as the template and choose Continue. The Info Object catalog is displayed in the left area with the characteristics you created.11. Assign the characteristics to the dimensions as follows with drag and drop:12. Choose Info Object Direct Input in the context menu of the dimension Sales Organization.13. On the next screen, enter the characteristic 0DOC_NUMBER ( Sales Document ) and choose Continue. The characteristic Sales Document is a shipped Info Object of BI Content.14. Expand the folder Navigation Attributes. Activate the navigation attribute Product Group (ZD_PROD__ZDPGROUP) by setting the indicator in column On/Off。","plantuml":"start:\n\nChoose \"Info Provider\";\n:Info Provider tree is displayed;\n:The Info Area is displayed;\n\nnote right \nIt contains Info Provider characteristics and is used to group further objects\nend note\n\n:Open context menu;\n:Choose \"Create Info Cube\";\n\nfork \n:Enter \"ZD_SALES\" as the technical name;\nfork again \n:Enter \"Sales Overview\" as the description;\nend fork\n\n:Select \"Standard Info Cube\" as Info Provider Type;\n:Choose \"Create\";\n:Screen for Info Cube editing is shown;\n\n:Open context menu;\n:Choose \"Create New Dimensions\";\n:Enter \"Product\" as the new dimension description;\n:Choose \"Create Another Dimension\";\n\n:Enter \"Sales Organization\" as the next dimension description;\n:Choose \"Continue\";\n:Dimensions are inserted;\n\n:Open the toolbar on the left;\n:Choose \"Info Object Catalog\";\n:Select your Info Object catalog for characteristics;\n:Choose \"Continue\";\n:Info Object catalog is displayed;\n\n:Open context menu;\n:Choose \"Info Object Direct Input\";\n:Enter characteristic 0DOC_NUMBER;\n\nnote right \nSales Document:a shipped Info Object of BI Content\nend note\n\n:Choose \"Continue\";\n\n:Expand \"Navigation Attributes\" folder;\n:Set the indicator ON/OFF;\n:Activate navigation attribute;\nnote right:ZD_PROD__ZDPGROUP\n\nStop"}
{"content":"4.\tCreating Transformations0 Creating Transformations for Master Data of Characteristic \"Product\"1. You are in the Modeling functional area of the Data Warehousing Workbench.2. Choose Data sources.3. From the toolbar in the right screen area, choose Choose Source System.4. In the menu option File, select the source system with the technical name PC_FILE. A hierarchical tree of the Data sources for this source system is displayed. The Data sources are structured semantically by application component. 5. Select Create application component... from the context menu at the root node of the Data source tree.6. On the next screen, enter a technical name and a description for the application component. The application component is used to group your Data sources for this scenario.7. In the context menu of your application component, choose Create Data source. 8. Enter the required data on the next screen.9. Choose Transfer. The Data source maintenance screen appears. 10. Enter the required data on the tab page General Info .","plantuml":"start\n\n:Choose \"Data sources\";\n:Open the toolbar on the right;\n:Choose \"Choose Source System\";\n\n:Choose the menu option File;\n:Select source system with technical name PC_FILE;\n:The hierarchical tree is displayed;\n\nnote right\n  Data sources are structured semantically\n  by application component\nend note\n\n:Open context menu;\n:Select \"Create application component...\";\n\n:Enter technical name and description;\nnote right:Group Data sources\n\n:Open context menu;\n:Choose \"Create Data source\";\n\n:Click \"Transfer\";\n:The Data source maintenance screen appears;\n:Find the tab page General Info;\n:Enter the required data;\n\nstop"}
{"content":"5.\tCreating Master Data Directly in the System1. In the Modeling area of the Data Warehousing Workbench, choose Info Objects. 2. In the Info Object catalog for characteristics, choose Maintain master data from the context menu of your Info Object Product Group (ZD_PGROUP).3. Choose Execute.4. Choose Create.5. Enter DS10 as Product Group and Computer as the Short description and choose Continue.6. Repeat steps 4 and 5 with the following values:7. Save your entries and return to the Info Object tree.8. Repeat steps 2-7 for the characteristic Channel (ZD_CHAN) with the following values:","plantuml":"start\n\n:Choose \"Info Objects\";\nrepeat\n:Open characteristics Info Object catalog;\n:Open \"ZD_PGROUP\" context menu;\n:Select \"Maintain master data\";\n:Choose \"Execute\";\n\nrepeat\n    :Choose \"Create\";\n    fork\n    :Enter Product Group;\n    note right:eg.DS10\n    fork again\n    :Enter Short description;\n    note right:eg.Computer\n    end fork\n    :Choose \"Continue\";\nrepeat while (More values?) is (yes) not(no)\n\n:Save entries;\n:Return to Info Object tree;\n\nrepeat while (More values for ZD_CHAN?) is (yes)\n\nstop"}
{"content":"6.\tLoading Master Data forCharacteristic \"Product\"Go to the Data Warehousing Workbench;in the Modeling area choose Info Provider. The attributes and texts are displayed with transformation and Data source in your Info Area below the characteristic Product.3. Perform the following steps, rst for the attributes of the characteristic and then for the texts of the characteristic.4. From the context menu of the Data source, choose Create Info Package...5. On the next screen, enter a description for the Info Package and choose Save. The Info Package maintenance screen for the scheduler appears.6. Go to the tab page Schedule and choose Start.7. To check the load process, choose Monitor in the toolbar of the Info Package maintenance screen.8 On the next screen, select the date and choose Execute. The monitor for the load process is displayed.9 Select the load process for your Data source from the tree at the left of the screen.","plantuml":"start\n\n:Go to Data Warehousing Workbench;\n:Go to Modeling area;\n:Choose \"Info Provider\";\n\n:Info Area displays information;\nfork\n  :Transformation;\nfork again\n  :Data source;\nfork again\n  :Attributes;\nfork again\n  :Texts;\nend fork\n\nrepeat\n    :Open Data source context menu;\n    :Choose \"Create InfoPackage...\";\n    \n    :Enter description;\n    :Choose \"Save\";\n    :The Info Package maintenance screen appears;\n\n    :Go to tab page Schedule;\n    :Choose \"Start\";\n\n    :Open the toolbar;\n    :Choose \"Monitor\";\n    :Check the load process;\n\n    :Select date;\n    :Choose \"Execute\";\n\n    :The monitor is displayed;\n    :Select load process from left tree;\nrepeat while (The texts are completed?) is (no)\n\nstop"}
{"content":"7.\tLoading Transaction Data1. Go to the Data Warehousing Workbench; in the Modeling area choose Info Provider. The transformation and the Data source are displayed in the Info Area below the Info Cube Sales Overview.2. In the context menu of the Data source, choose Create Info Package...3. On the next screen, enter a description for the Info Package and choose Save. The Info Package maintenance screen for the scheduler appears.4. Go to the tab page Schedule and choose Start.5. To check the load process, choose Monitor in the toolbar of Info Package maintenance.6. On the next screen, select the date and choose Execute. The monitor for the load process is displayed.7. Select the load process for your Data source from the tree at the left of the screen.8. Exit the Info Package maintenance screen.9. From the context menu of the Data source, choose Create Data Transfer Process.... The system displays a generated description, the type, source and target of the data transfer process.10. Choose Continue.11. The data transfer process maintenance screen appears.12. Go to tab page Extraction and select extraction mode Full.13. Activate the data transfer process.14. Go to tab page Execute and choose Execute.","plantuml":"start\n\n:Go to Data Warehousing Workbench;\n:Go to Modeling area;\n:Choose \"Info Provider\";\n\n:Info Area displays information;\nfork\n  :Transformation;\nfork again\n  :Data source;\nend fork\n\n:Open Data source context menu;\n:Choose \"Create Info Package...\";\n\n:Enter description;\n:Choose \"Save\";\n:The Info Package maintenance screen appears;\n\n:Go to tab page Schedule;\n:Choose \"Start\";\n\n:Open the toolbar;\n:Choose \"Monitor\";\n:Check the load process;\n\n:Select date;\n:Choose \"Execute\";\n\n:The monitor is displayed;\n:Select load process from left tree;\n\n:Exit Info Package maintenance;\n\n:Open Data Source context menu;\n:Choose \"Create Data Transfer Process...\";\n:Information is displayed;\n\nfork\n:Description;\nfork again\n:Type;\nfork again\n:Source;\nfork again\n:Target;\nend fork\n\n:Choose \"Continue\";\n\n:Data Transfer Process maintenance screen appears;\n:Go to tab page Extraction;\n:Select extraction mode \"Full\";\n\n:Activate data transfer process;\n\n:Go to tab page Execute;\n:Choose \"Execute\";\n\nstop"}
{"content":"8.\tDening Queries1. Start the BEx Query Designer by choosing Start Programs Business Explorer Query Designer.2. Log on to the BI system.3. In the toolbar, choose New Query...4. Choose Find.5. Enter ZD_SALES as the search string in the upper empty eld, select Search in Technical Name and deselect Search in Description.6. Choose Find. Info Cube ZD_SALES is displayed in the lower empty eld7. Select the Info Cube ZD_SALES and choose Open. The data of Info Cube Sales Overview (ZD_SALES) is displayed in the left part of the Info Provider screen of the Query Designer.","plantuml":"start\n\n:Choose \"Start Programs Business Explorer Query Designer\";\n:BEx Query Designer is started;\n:Log in;\n\n:Open toolbar;\n:Choose \"New Query\";\n:Choose \"Find\";\n\nfork\n:Enter \"ZD_SALES\" as search string;\nfork again\n:Select \"Search\" in Technical Name;\nfork again\n:Deselect \"Search\" in Description;\nend fork\n\n:Choose \"Find\";\n:Info Cube ZD_SALES is displayed;\n\n:Select InfoCube ZD_SALES;\n:Choose \"Open\";\n:ZD_SALES data is displayed;\n\nstop"}
{"content":"9.\tCreating Web Applications1. Start the BEx Web application by choosing Start Programs Business Explorer Web Application Designer.2. Log onto the BI system.3. In the initial screen of the Web Application Designer, click on the link Create New Blank Web Template.4. In the lower part of the layout view choose New Data Provider.5. In the dialog box for the data provider type select Query and enter the name of the query ZD_SALES_2007 in the eld following Query.6. Choose OK.7. The data provider is displayed in the lower part of the layout view in the Web Application Designer","plantuml":"start\n\n:Choose \"Start Programs Business Explorer Web Application Designer\";\n:BEx Web is started;\n\n:Log in;\n:Initial screen is shown;\n:Click \"Create New Blank Web Template\";\n\n:Choose \"New Data Provider\";\n\n:Open data provider type dialog box;\n:Select \"Query\";\n:Enter \"ZD_SALES_2007\" as query name;\n\n:Choose \"OK\";\n:Data provider is displayed;\n\nstop"}
{"content":"10.\tAnalyzing Data in the Web Application1. Since you are interested in the revenue, you want to sort the revenue data.2. Click on the arrows in the Revenue eld to sort the revenue data in increasing or decreasing order.3. You can also sort the revenue by clicking the alternative mouse button on Revenue and choosing Sort Sort Increasing or Sort Decreasing in the context menu. You see that the greatest revenue is obtained with the distribution channel Internet.4. To see the differences in the revenue data for the months July, August and September, select rst 08.2007 and then 07.2007 in the dropdown box Calendar Year/Month. You see that the revenue data for the distribution channel Internet increased greatly. The marketing campaign for the Internet shop was apparently successful.5. Filter the data back to September by selecting 09.2007 in the dropdown box.6. To add a comment to the Web application about the successful increase in revenue using the Internet, create an appropriate document. At the subtotal of the distribution channel Internet (567.308,05) choose Documents Create New Comment in the context menu.7. Enter a name and description for the document.8. Enter a text and choose Save","plantuml":"start\n\n:Sort revenue data;\nif (Click arrows in Revenue eld?) then (yes)\n  :Sort increasing or decreasing;\nelse (no)\n  :Click alternative mouse button;\n  :Open context menu;\n  :Choose \"Sort Increasing\" or \"Sort Decreasing\";\nendif\n\n:Internet channel is the greatest;\n\nif(Analyze differences for months?) then(yes)\n:Open dropdown box Calendar Year/Month;\n:Select 08.2007;\n:Select 07.2007;\n:See increased data;\n:Internet shop marketing campaign was successful;\n\n:Open dropdown box Calendar Year/Month;\n:Select 09.2007;\n:Filter the data back to September;\n\nelse(no)\nendif\n\nif(Add a comment?) then(yes)\n:Go to subtotal of the distribution channel Internet;\n:Open context menu;\n:Choose \"Documents Create New Comment\";\n\n:Enter name and description;\n:Enter a text;\n:Choose \"Save\";\nelse(no)\nendif\n\nstop"}
{"content":"11.\tBroadcasting Web Applications by E-Mail1. In the Web application, click on Send. The Broadcasting Wizard appears; it guides you step-by-step through the required settings.2. Select output format MHTML. The system creates an MHTML le. All components (HTML, style sheet, pictures, and so on) of the entire HTML page are in one le. This output format is suitable if you want to generate one single document and broadcast it by e-mail or to the portal.3. Choose Continue.4. Enter the e-mail addresses of the recipients, separated with semicolons.5. Enter a subject line and text, and dene the importance of the e-mail6. Choose Execute.","plantuml":"start\n\n:Open Web application;\n:Click on \"Send\";\n:Broadcasting Wizard appears;\n\n:Select output format MHTML;\n:System creates MHTML le;\n:All components in one le;\n\nif(Generate one document and broadcast it?) then(yes)\n\n:Output format is suitable;\n:Choose \"Continue\";\n\n:Enter recipient email addresses;\nnote right:Separate with semicolons\n\nfork\n:Enter subject line;\nfork again\n:Enter text;\nfork again\n:Dene the importance of email;\nend fork\n\n:Choose \"Execute\";\n\nelse(no)\n:Modification;\nendif\n\nstop"}
{"content":"12.\tSet granular application rights to various functions within LifeCycleManager.1. Log into CMC and select Applications.2. Double-click LifeCycle Manager.3. Click User Security, and select Administrators.The View Security tab is enabled.4. Select the rights you want to set.You can set the following rights:• Create a job• Edit a job• Promote a job• Export a BIAR file• Edit a BIAR file• Delete a job• Rollback a job• Use Administration options• Edit Connections properties• Use Version Management System5. Click OK.","plantuml":"start\n\n:Log in to CMC;\n:Select \"Applications\";\n\n:Double-click \"LifeCycle Manager\";\n\n:Click \"User Security\";\n:Select \"Administrators\";\n:View Security tab is enabled;\n\n:Select rights;\n\nfork\nif (Create a job?) then (yes)\n  :Set;\nelse (no)\nendif\n\nfork again\nif (Edit a job?) then (yes)\n  :Set;\nelse (no)\nendif\n\nfork again\nif (Promote a job?) then (yes)\n  :Set;\nelse (no)\nendif\n\nfork again\nif (Export a BIAR file?) then (yes)\n  :Set;\nelse (no)\nendif\n\nfork again\nif (Edit a BIAR file?) then (yes)\n  :Set;\nelse (no)\nendif\n\nfork again\nif (Delete a job?) then (yes)\n  :Set;\nelse (no)\nendif\n\nfork again\nif (Rollback a job?) then (yes)\n  :Set;\nelse (no)\nendif\n\nfork again\nif (Use Administration options?) then (yes)\n  :Set;\nelse (no)\nendif\n\nfork again\nif (Edit Connections properties?) then (yes)\n  :Set;\nelse (no)\nendif\n\nfork again\nif (Use Version Management System?) then (yes)\n  :Set;\nelse (no)\nendif\nendfork\n\n:Click \"OK\";\n\nstop"}
{"content":"13.\tpromote a job when the source and the destination systems are connected, complete the following steps:1. Connect to the source system.2. Create a new job. You can also copy an existing job.3. Add infoobjects to the job you want to promote. If you do not want to promote all the dependents of the infoobjects, you can use the Manage Dependencies option to select the dependents you want to promote.Note:You can select the type of dependents you want to promote from the Type drop-down list.4. Promote the job.Promoting a job when the source system and the destination system are not connected18 To promote a job when the source and the destination systems are not connected, complete the following steps:1. Connect to the source system, and create a job. You can also copy an existing job.2. Add infoobjects to the job you want to promote. You can use the Manage Dependencies option to select the required dependents.Note:You can select the type of dependents you want to promote from theType drop-down list.3. Export infoobjects with Output to BIAR file as the destination system.4. Import infoobjects from the BIAR file by clicking the Import BIAR tab.5. Promote the job.","plantuml":"start\n\n:Connect to source system;\n\nif(Have existing job?) then(no)\n:Create a new job; \nelse(yes)\n:copy existing job;\nendif\n\n:Add infoobjects;\n\nif (Promote all Dependencies?) then (yes)\n  :Use \"Manage Dependencies\";\n  :Open Type drop-down list;\n  :Select dependent want to promote;\nelse(no)\nendif\n\nif (Source and the destination systems connected?) then (no)\n  :Export infoobjects with Output to BIAR file;\n  :Click Import BIAR tab;\n  :Infoobjects from the BIAR file are imported;\nelse (yes)\nendif\n\n:Promote the job;\n\nstop"}
{"content":"14.\tlog into the LifeCycle Manager tool.To log into the LifeCycle Manager tool, complete the following steps:1. Select Start > Programs > BusinessObjects XI 3.1 > BusinessObjects Enterprise > BusinessObjects LifeCycle Manager. The LifeCycle Manager login screen appears.2. In the System field, enter the name of the Central Management Server (CMS) on which the LifeCycle Manager tool is installed.3. Enter the user name and password.4. Select the appropriate authentication method from the Authentication drop-down list.The LifeCycle Manager tool supports the following authentication types:• Enterprise authentication - This authentication type requires a user name and a password that are recognized by the BusinessObjects Enterprise system. This is the default authentication method.• LDAP authentication - This authentication type requires a user name and a password that are recognized by the BusinessObjects Enterprise system.• Windows AD - This authentication type requires a user name and a password that are recognized by the BusinessObjects Enterprise system.The LDAP, Windows AD, and other third-party authentication types require a special setup. For information on setting up these authentication types, see the BusinessObjects Enterprise Administrator's Guide.5. Click Log on.","plantuml":"start\n\n:Select \"Start\";\n:Select \"Programs\";\n:Select \"BusinessObjects XI 3.1\";\n:Select \"BusinessObjects Enterprise\";\n:Select \"BusinessObjects LifeCycle Manager\";\n:LifeCycle Manager login screen appears;\n\n:Go to System field;\n:Enter CMS name;\n:Enter username and password;\n\n:Open Authentication drop-down list;\n:Select authentication method;\n\nif(Default method?) then(yes)\n  :Enterprise authentication;\n  :Recognize user name and password;\nelse(no)\nswitch (Other Methods)\ncase(LDAP)\n  :Recognize user name and password;\n  :Special setup;\ncase(Windows AD)\n  :Recognize user name and password;\n  :Special setup;\ncase(other third-party types)\n  :Special setup;\nendswitch\nendif\n\n:Click \"Log on\";\n\nstop"}
{"content":"15.\tuse the Manage Systems optionTo add a host system, complete the following steps:1. In the \"Administration Options\" window, click Manage Systems.The list of host names, port numbers, display names, and descriptions isdisplayed.2. Click Add.The \"Add System\" dialog box appears.3. Add the host name, port number, display name, and the description inthe appropriate fields.4. Click Add to add the system.The host system is added to the list.","plantuml":"start\n\n:Go to \"Administration Options\" window;\n:Click \"Manage Syetems\";\n\n:List is displayed;\nfork\n:Host names;\nfork again\n:Port numbers;\nfork again\n:Display names;\nfork again\n:Descriptions;\nend fork\n\n:Click \"Add\";\n:\"Add System\" dialog box appears;\n\n:Add information;\nfork\n:Host name;\nfork again\n:Port number;\nfork again\n:Display name;\nfork again\n:Description;\nend fork\n\n:Click \"Add\";\n:Host system is added;\n\nstop"}
{"content":"16.\tSet the ClearCase version management system in Windows1. In the \"Administration Options\" window, click VMS Settings.2. From the Version Management Systems drop-down list, selectClearCase.3. Enter the following details:• ClearCase Map Drive - Enter the drive name. By default, it is the Mdrive. For example: M:• VOB Tag Name - Enter the Versioned Object Base (VOB) name. Forexample: FridayVB• View Storage Directory - Enter the path to the shared folder. Forexample: \\\\HostName\\FolderNameNote:The host name must not be written as localhost.1.\tClick Save.","plantuml":"start\n\n:Go to Administration Options window;\n:Click \"VMS Settings\";\n\n:Open Version Management Systems drop-down list;\n:Select \"ClearCase\";\n\n:Enter details;\nfork\n:ClearCase Map Drive;\n:Enter drive name;\nnote right:\"Mdrive\" by default;\nfork again\n:VOB Tag Name;\n:Enter VOB name;\n:Enter VOB's folder name;\nfork again\n:View Storage Directory;\n:Enter path to the shared folder;\nnote right:Host name must not be written as localhost\nend fork\n\n:Click \"Save\";\n\nstop"}
{"content":"17.\tset the ClearCase version management system in Unix1. In the Administration Options window, click VMS Settings.2. From the Version Management Systems drop-down list, select ClearCase.3. Enter the following details:• ClearCase Map Drive - Enter the name of the folder where the MVFSis located. By default, it is /view• VOB Tag Name - Enter the VOB name and the folder where the VOBis located. For example: VobFolder/VobName• View Storage Directory: Enter the path of the directory where the viewsare created.","plantuml":"start\n\n:Go to Administration Options window;\n:Click \"VMS Settings\";\n\n:Open Version Management Systems drop-down list;\n:Select \"ClearCase\";\n\n:Enter details;\nfork\n:ClearCase Map Drive;\n:Enter MVFS's folder name;\nfork again\n:VOB Tag Name;\n:Enter VOB name;\n:Enter VOB's folder name;\nfork again\n:View Storage Directory;\n:Enter creating path;\nend fork\n\nstop"}
{"content":"18.\tspecify the number of jobs that must be displayed in the \"PromotionJobs\" screen. You can also view jobs that were created during a particulartime interval.To set preferences, complete the following steps:1. In the \"Promotion Jobs\" screen, click the Preferences link.The \"Preferences\" window appears.2. In the \"Enter the Maximum Page Size\" dialog box, specify the number ofobjects that must be displayed per page in the \"Promotion Jobs\" screen.3. From the Show Jobs Created drop-down list, select the time interval toview the jobs created during the specified period.4. Click OK.","plantuml":"start\n\n:Go to \"PromotionJobs\" screen;\n:Click the Preferences link;\n:\"Preferences\" window appears;\n\n:Open \"Enter the Maximum Page Size\" dialog box;\n:Go to \"Promotion Jobs\" screen;\n:specify the number;\n\n:Open Show Jobs Created drop-down list;\n:Select time interval;\n:View the jobs created during the specified period;\n\n:Click \"OK\";\n\nstop"}
{"content":"19.\tcreate a new job by using the LifeCycle Manager tool1. Log into the LifeCycle Manager tool.2. In the \"Promotion Jobs\" home page, click New Job. The \"New Job\"window appears .3. Enter the name, description, and keywords for the job in the appropriatefields.4. In the Save Job in field, browse and select the folder in which you wantto save the job.5. Select the source system and the destination system from the drop-downlists.If the name of the system is not displayed in the drop-down list, click theLogin to a new CMS option. A new window is launched. Enter the nameof the system along with the user name and password.6. Click Create.","plantuml":"start\n\n:Log in LifeCycle Manager tool;\n:Go to \"Promotion Jobs\" home page;\n:Click \"New Job\";\n:\"New Job\"window appears;\n\n:Enter information;\nfork \n:Enter name;\nfork again\n:Enter description;\nfork again\n:Enter keywords;\nend fork\n\n:Go to \"Save Job\" field;\n:Browse and select folder;\n\n:Open drop-downlists;\nif (System name is diaplayed?) then (no)\n:Click \"theLogin\";\n:A new CMS option;\n:A new window is launched;\n\n:Enter information;\nfork \n:Enter system name;\nfork again\n:Enter user name;\nfork again\n:Enter password;\nend fork\n\nelse(yes)\n:Select source system;\n:Select destination system;\nendif\n\n:Click \"Create\";\n\nstop"}
{"content":"20.\tlog into a new CMS1. Log into the LifeCycle Manager tool.2. Create a new job.For more information on creating a new job, see Creating a New Job onpage 37.3. From the Source System drop-down list, select Login to a New CMS.The \"Login to System\" dialog box appears.4. Enter the user credentials, select the appropriate authentication type, andclick Login.5. From the Destination System drop-down list, select Login to a NewCMS.6. Enter the user credentials, select the appropriate authentication type, andclick Login.","plantuml":"start\n\n:Log in LifeCycle Manager tool;\n:Create a new job;\nif (More information?) then(yes)\n:See Creating a New Job on page 37;\nelse(no)\nendif\n\n:Open Source System drop-down list;\n:Select \"Login\";\n:To a New CMS;\n\n:\"Login to System\" dialog box appears;\n:Enter user credentials;\n:Select appropriate authentication type;\n:Click \"Login\";\n\n:Open Destination System drop-down list;\n:Select \"Login\";\n:To a New CMS;\n\n:Enter user credentials;\n:Select appropriate authentication type;\n:Click \"Login\";\n\n:Click \"Create\";\n\nstop"}
{"content":"21.\tcreate a new job by copying an existing job.To create a new job by copying an existing job, complete the following steps:1. Log into the LifeCycle Manager tool.2. In the \"Promotion Jobs\" home page, click New Job.3. Click the Copy an Existing Job option. The list of jobs in the PromotionJob folder is displayed4. Select a job from the job list, and click Create. The name, keywords, and description of the job are displayed. You can modify these fields, if required. However, you cannot change the source system.5. In the Save Job in field, browse and select the folder in which you want to save the job, and click Create.A new job is created.","plantuml":"start\n\n:Log in LifeCycle Manager tool;\n:Go to \"Promotion Jobs\" home page;\n:Click \"New Job\";\n\n:Click \"the Copy an Existing Job\" option;\n:The list of jobs is displayed;\n\n:Select a job from list;\n:Cick \"Create\";\n\n:Information is displayed;\nfork\n:Name;\nfork again\n:Keywords;\nfork again\n:Description;\nend fork\n\nif(Modification?) then(yes)\n:Modify these fields;\nnote right\nCannot change source system\nend note\nelse(no)\nendif\n\n:Go to \"Save Job\" field;\n:Browse and select folder;\n:Click \"Create\";\n:A new job is created;\n\nstop"}
{"content":"22.\tmanage dependencies of an infoobject1. Log into the LifeCycle Manager tool.2. Create a new job. For information on creating a new job, see Creating aNew Job on page 37.3. Add the required infoobjects to the new job.4. In the \"Promotion Jobs\" home page, click Manage Dependencies. The \"Manage Dependencies\" window appears. This window displays the list of infoobjects and their dependents, as shown in the following figure:5. From the Select Dependents drop-down list, select any of the options available to add the dependents to the job. The dependents are displayed on the right side. The dependents are not selected by default; you must explicitly select the dependents you want to promote. For example, if you select All Universes from the Select Dependents drop-down list, then all the universes included in the list of dependentsare automatically selected.6. Click to view the supported filtering options of infoobjects in the drop-down list. Select an option, and click OK. The filtered infoobjects are displayed.7. Click Apply Changes to update the list of dependents.8. Click Apply Changes and Close to save the changes","plantuml":"start\n\n:Log in LifeCycle Manager tool;\n:Create a new job;\nif (More information?) then(yes)\n:See Creating a New Job on page 37;\nelse(no)\nendif\n\n:Add required infoobjects to new job;\n:Go to \"Promotion Jobs\" home page;\n:Click \"Manage Dependencies\";\n:\"Manage Dependencies\" window appears;\n:List of infoobjects and their dependents is displayed;\n\n:Open Select Dependents drop-down list;\n:Dependents are displayed on the right;\n\nswitch(Selection)\ncase(no)\n :Dependents are not selected;\ncase(All Universes)\n :All universes are automatically selected;\ncase(Other available options)\n :Dependents are added to job;\nendswitch\n\n:Click;\n:View supported filtering options of infoobjects;\n:Select an option;\n:Click \"OK\";\n:Filtered infoobjects are displayed;\n\n:Click \"Apply Changes\";\n:List of dependents is updated;\n\n:Click \"Apply Changes\";\n:Close to save the changes;\n\nstop"}
{"content":"23.\tpromote a jobLog into the LifeCycle Manager tool.2. In the \"Promotion Jobs\" home page, select the job that you want to promote. You can also right-click the home page screen, and click Promote.3. From the source and the destination systems drop-down lists, select the source and destination systems.Note:Ensure that you have logged into both the source and destination systems before you proceed with the promotion process.4. In the External Change Management ID field, enter the appropriate value, and click Save.5. Click Mappings. Click Edit Mappings if you want to create and validate mappings.6. Click Security Settings, if required. The following options are displayed:• Do not Promote Security - This is the default option.• Promote Security - Use this option to promote jobs along with theassociated security rights.• Include application rights - This option is enabled only if you select Promote Security. If the objects in the job inherit any application rights, the job is promoted along with these rights. You can also click View Security to view the security dependencies of the infoobjects in the job.7. Click Test Promote to ensure that there is no conflict between CUIDs in the source and destination systems. The promotion details are displayed. The first column displays the objects to be promoted, and the second column displays the promotion status. The LifeCycle Manager tool classifies the selected objects into users, groups, universes, and so on.Note:Running the Test Promote feature does not commit any infoobjects for promotion. The result of a test promote can be any of the following:• Overwritten - The infoobject in the destination is overwritten by the infoobject in the source system.• Mapped - The following infoobject types are mapped to the destination system: folders, users, user groups, and custom roles. An infoobject is mapped to the destination system and promoted only if the Security option is enabled. Otherwise, the infoobject is not promoted.• Copied - The infoobject in the source system is copied to the destination system.• Dropped - The infoobject is not promoted from the source system to the destination system.• Warning - The infoobject in the destination system is the newer version and you can remove the infoobject from the Job. However, if you want to promote, the infoobject gets promoted.8. Click Schedule Job if you want to schedule the job promotion.9. Click Promote.","plantuml":"start\n\n:Log in LifeCycle Manager tool;\nswitch(Selection method)\ncase(1)\n:Go to \"Promotion Jobs\" home page;\n:Select the job want to promote;\ncase(2)\n:Right-click;\n:Click \"Promote\";\nendswitch\n\n:Open source and destination systems drop-down lists;\n:Select source and destination systems;\n\nif(Have logged into both source and destination systems) then(no)\nstop\nelse(yes)\nendif\n\n:Go to External Change Management ID field;\n:Enter appropriate value;\n:Click \"Save\";\n\n:Click \"Mappings\";\nif(Create and validate mappings) then(yes)\n:Click \"Edit Mappings\";\nelse(no)\nendif\n\nif(See Security Settings?) then(yes)\n:Click \"Security Settings\";\n:Options are displayed;\nfork\n:\"Do not Promote Security\";\nnote right:Default option\nfork again\n:\"Promote Security\";\n:Promote jobs along with associated security rights;\nfork again\n:\"Include application rights\";\n\nif (Select \"Promote Security\"?) then(yes)\n:The option is enabled;\n  if(Objects inherit any application rights?) then(yes)\n  :Job is promoted along with these rights;\n  else(no)\n  endif\nelse(no)\nendif\nend fork\n\nif(Click \"View Security\"?) then(yes)\n:View infoobjects security dependencies;\nelse(no)\nendif\nendif\n\n:Click \"Test Promote\";\n:Ensure no conflict between CUIDs in the source and destination systems;\n:Promotion details are displayed;\n\nfork\n:First column;\n:Objects to be promoted;\nfork again\n:Second column;\n:Promotion status;\nend fork\n\n:LifeCycle Manager tool classifies selected objects;\n\n:Run Test Promote feature;\n:Commit no infoobjects for promotion;\n\nswitch(Results)\ncase(Overwritten)\n :Infoobject in destination is overwritten by infoobject in source system;\ncase(Mapped)\n :Infoobject types;\n fork\n :Folders,\n fork again\n :Users;\n fork again\n :User groups;\n fork again\n :Custom roles;\n end fork\n\n if(Security option is enabled?) then(yes)\n :Infoobject is mapped to destination system and promoted;\n else(no)\n :Infoobject is not promoted;\n endif\ncase(Copied)\n :Infoobject in source system is copied to destination system;\ncase(Dropped)\n :Infoobject is not promoted from source system to destination system;\ncase(Warning)\n :Infoobject in destination system is the newer version;\n :Remove infoobject from Job;\nif(Promote?) then(yes)\n :Infoobject gets promoted;\nelse(no)\nendif\nendswitch\n\nif(Schedule job promotion?) then(yes)\n:Click \"Schedule Job\";\nelse(no)\nendif\n\n:Click \"Promote\";\n\nstop"}
{"content":"24.\tMapping a connection.To map a connection, complete the following steps:1. In the \"Promote\" window, click Mappings.2. Click Edit Mappings.The following tabs are displayed:• Connection Mappings• QaaWS Mappings• Crystal Report Mappings• Federation Mappings3. Click the Connection Mappings tab. The source connections and the database types are displayed. If you want to edit the properties of a source connection, select the source connection, and click Edit Connection Properties. The \"Edit Connection Properties\" tab appears. This tab displays the list of properties and their values. Modify the values per your requirements, and click Apply. The \"Connection Mappings\" tab appears.4. From the Destination Connection drop-down list, select a destination connection for the selected source connection.5. Click Apply.","plantuml":"start\n\n:Go to \"Promote\" window;\n:Click \"Mappings\";\n\n:Click \"Edit Mappings\";\n:Tabs are displayed;\nfork\n:Connection Mappings;\nfork again\n:QaaWS Mappings;\nfork again\n:Crystal Report Mappings;\nfork again\n:Federation Mappings;\nend fork\n\n:Click the Connection Mappings tab;\n:Source connections and database types are displayed;\n\nif(Edit properties of a source connection) then(yes)\n:Select the source connection;\n:Click \"Edit Connection Properties\";\n:\"Edit Connection Properties\" tab appears;\n:List of properties and their values are displayed;\n:Modify the values per your requirements;\n:Click \"Apply\";\n:\"Connection Mappings\" tab appears;\nelse(no)\nendif\n\n:Open Destination Connection drop-down list;\n:Select a destination connection;\n\n:Click \"Apply\";\n\nstop"}
{"content":"25.\tmap a QaaWS1. In the \"Promote\" window, click Mappings.2. Click Edit Mappings.The following tabs are displayed:• Connection Mappings• QaaWS Mappings• Crystal Report Mappings• Federation Mappings3. Click QaaWS Mappings.The source URL and the Query as a Web Service types are displayed. If you want to edit the properties of the source URL, select the source URL, and click Edit QaaWs Properties. The Edit QaaWS Propertiestab appears. This tab displays the list of properties and their values. Modify the values per your requirements, and click Apply. The QaaWS Mappings tab appears.Note:If you edit the source URL, the destination field displays the following message: Edited Source URL4. From the Destination URL drop-down list, select a destination URL for the selected source URL.If you want to reset the modifications made to the destination URL, click the icon.5. Click Apply.","plantuml":"start\n\n:Go to \"Promote\" window;\n:Click \"Mappings\";\n\n:Click \"Edit Mappings\";\n:Tabs are displayed;\nfork\n:Connection Mappings;\nfork again\n:QaaWS Mappings;\nfork again\n:Crystal Report Mappings;\nfork again\n:Federation Mappings;\nend fork\n\n:Click \"QaaWS Mappings\";\n:Source URL and Query as a Web Service types are displayed;\n\nif(Edit properties of source URL?) then(yes)\n:Select source URL;\n:Click \"Edit QaaWs Properties\";\n:Edit QaaWS Propertiestab appears;\n:List of properties and their values are displayed;\n:Modify the values per your requirements;\n:Click \"Apply\";\n:QaaWS Mappings tab appears;\n:Destination field displays: Edited Source URL;\nelse(no)\nendif\n\n:Open Destination URL drop-down list;\n:Select a destination URL;\n\nif(Reset modifications made to destination URL) then(yes)\n:Click the icon;\nelse(no)\nendif\n\n:Click \"Apply\";\n\nstop"}
{"content":"26.\tmodify the properties of a Crystal report1. In the \"Promote\" window, click Mappings.2. Click Crystal Report Mappings.The list of Crystal reports in the source system is displayed.3. Select the required Crystal report, and click Edit Crystal Report Properties. The \"Edit Crystal Report Properties\" tab appears, as shown in the following figure: This tab displays the list of properties and their values.4. Modify the appropriate fields, and click Apply. The Crystal Report Mappings tab appears.Note:• If you edit a Crystal report in the source system, the following message is displayed beside the Crystal report: edited• A Crystal Report created using Universes cannot be mapped in the Crystal Report Mappings. However, it can be mapped in the Connections Mappings.• Crystal Reports are grouped based on the same servers. You can either map a single Crystal Report or the group,. However, you cannot map multiple Crystal reports at the same time.5. Click Save or Promote per your requirements。","plantuml":"start\n\n:Open the \"Promote\" window;\n:Click \"Mappings\";\n:Click \"Crystal Report Mappings\";\n\n:List of Crystal reports is displayed;\n:Select required Crystal Report;\n:Click \"Edit Crystal Report Properties\";\n\n:\"Edit Crystal Report Properties\" tab appears;\nnote right\nDisplays list of properties \nand their values\nend note\n\n:Modify appropriate fields;\n:Click \"Apply\";\n\nif (Edited in source system?) then (yes)\n  :\"edited\" is displayed;\nendif\n\nif (Created using Universes?) then (yes)\n  :Cannot be mapped;\n  :Use \"Connections Mappings\";\n  stop\nelse\n  :Proceed with mapping;\nendif\n\nswitch (Mapping scope)\ncase (Single)\n  :Map single report;\ncase (Group)\n  :Map the group;\ncase (Multiple)\n  :Not allowed;\n  stop\nendswitch\n\n:Click \"Save\" or \"Promote\";\n\nstop"}
{"content":"27.\tmap a Federation connection1. In the \"Promote\" window, click Mappings.2. Click Federation Mappings.The list of Federation connections is displayed.3. Select a Federation connection, and click Edit Federation Connection Properties. The \"Edit Federation Connection Properties\" tab appears. This tab displays the list of properties and their values.4. Modify the appropriate fields, and click Apply. The \"Federation Mappings\" tab appears.Note:If you edit a Federation connection in the source system, the followingmessage is displayed beside the federation connection: edited5. Click Save or Promote as per your requirement. Important: Mapping must be performed by an expert user who has adequate knowledge of the artefacts in both source and destination systems.","plantuml":"start\n\nif(Experienced expert user?) then (yes)\n\n:Open the \"Promote\" window;\n:Click \"Mappings\";\n:Click \"Federation Mappings\";\n:The connection list is displayed;\n:Select a connection;\n:Click \"Edit Federation Connection Properties\";\n:\"Edit Federation Connection Properties\" Tab appears;\n\nnote right:Display the list of properties and their values\n\n:Modify the appropriate fields;\n:Click \"Apply\";\n:\"Federation Mappings\" Tab appears;\n\nif (Edit in the source system?) then (yes)\n  :\"edited5\" is displayed;\nelse (no)\nendif\n\n:Click \"Save\" or \"Promote\";\n\nelse (no)\nendif\nstop"}
{"content":"28.\tExporting a Job to a BIAR File1. Log into the LifeCycle Manager tool, and create a new job. For more information on creating a new job, see Creating a New Job on page 372. In the Destination System drop-down list, select Output to a BIAR file option and click Create.3. Click Add objects to add infoobjects to the job. You can use the Manage Dependencies option to manage the dependencies of the selected job.4. Click Promote.The \"Promote - Job Name\" screen appears.5. Click Export.The BIAR file is created. You can save a BIAR file to a File System or an FTP location.6. In the \"Promote - Job Name\"screen, click Biar File Destination. Biar File Destination pane appears.7. Select either File System or FTP.8. To export the BIAR file to a file system, select File System and click Export. The BIAR file is exported to a file system.9. To export the BIAR file to an FTP location, select FTP. Enter appropriate details in the host, port, username, password, directory, and filename fields.10. Click Export.The BIAR file is exported to an FTP location.","plantuml":"start\n\n:Log in;\n:Create a new job;\nif(More information?) then (yes)\n  :See \"Creating a New Job\";\n  note right: Page 372\nelse (no)\nendif\n\n:Open drop-lists;\n:Select \"Output to a BIAR file\";\n:Click \"Create\";\n\n:Click \"Add objects\";\n:Infoobjects are added;\n\nif(Other operations?) then(yes)\n\nswitch(Option)\n  case(\"Manage Dependencies\" option)\n    :Manage dependencies;\n  case(Click \"Promote\")\n    :\"Promote - Job Name\" screen appears;\nendswitch\n\nelse (no)\nendif\n\n:Click \"Export\";\n:BIAR file is created;\n\nif(Save?) then(yes)\n\n:Open \"Promote - Job Name\"screen;\n:Click \"Biar File Destination\";\n:\"Biar File Destination\" pane appears;\n\nswitch(Location)\n  case(File System)\n    :Select \"File System\";\n    :Click \"Export\";\n    :BIAR file is exported to a file system;\n  case(FTP)\n    :Select \"FTP\";\n    :Enter Host, Port, Username, \\nPassword, Directory, Filename;\n    :Click \"Export\";\n    :BIAR file is exported to an FTP location;\nendswitch\n\nelse (no)\nendif\n\nstop"}
{"content":"29.\tImporting a Job from a BIAR File1. From the storage device, copy the BIAR file to the destination system.2. Log into the LifeCycle Manager tool.3. In the \"Promotion Jobs\" home page, click Import BIAR. The \"Import BIAR file\" window appears.4. Click Browse to select a BIAR file from the file system.5. Select the BIAR file from the file system, and click Copy. The details of the selected file appear in the \"New Job\" screen.6. Click Create.The job is created. You can also manage the dependencies of the job in the \"Managing Dependencies\" window.7. Click Promote.The \"Promote - Job Name\" window appears.8. Confirm the login credentials of the destination system.9. Click Promote to promote the contents to the destination system You can also click the Test Promote option to view the objects to be promoted and the promotion status.","plantuml":"start\n:Copy the BIAR file;\n:Log in;\n:Open \"Promotion Jobs\";\n:Click \"Import BIAR\";\n:\"Import BIAR file\" window appears;\n:Click \"Browse\";\n:Select the BIAR file;\n:Click \"Copy\";\n:Details appears in the \"New Job\";\n\nif(Other operations?) then (yes)\n\nswitch (Promotion Option)\ncase (Click \"Creat\")\n  :Job is created;\ncase (\"Managing Dependencies\" window)\n  :manage dependencies;\ncase (Click \"Promote\")\n  :\"Promote - Job Name\" window appears;\n  :Confirm login credentials;\n switch(Option)\n   case (Click \"Promote\")\n    :The contents are promoted;\n   case (Click \"Test Promote\")\n    fork\n      :View objects to be promoted;\n    fork again\n      :View status;\n    end fork\n   endswitch\nendswitch\nelse (no)\nendif\n\nstop"}
{"content":"30.\tCreating a New Job1. Log into the LifeCycle Manager tool.2. In the \"Promotion Jobs\" home page, click New Job. The \"New Job\"window appears .3. Enter the name, description, and keywords for the job in the appropriate fields.4. In the Save Job in field, browse and select the folder in which you want to save the job.5. Select the source system and the destination system from the drop-down lists. If the name of the system is not displayed in the drop-down list, click the Login to a new CMS option. A new window is launched. Enter the name of the system along with the user name and password.6. Click Create.","plantuml":"start\n:Log in;\n:Go to \"Promotion Jobs\";\n:Click \"New Job\";\n:\"New Job\" window appears;\n\nfork\n  :Enter name;\nfork again\n  :Enter description;\nfork again\n  :Enter keywords;\nend fork\n\n:Go to \"Save Job \" field;\n:Browse and select the folder;\n:Drop-lists appears;\n\nif (System name is displayed?) then (yes)\n  :Select the source system;\n  :Select the destination system;\nelse (no)\n  :Click \"Login\";\n  :Launch a new window;\n  fork\n    :Enter system name;\n  fork again\n    :Enter user name;\n  fork again\n    :Enter password;\nend fork\n\nendif\n\n:Click \"Create\";\nstop"}
