{"content":"[Grid Planning Steps] Step 1: The CAISO determines the amount and location of Black Start Generation through contingency studies. Step 2: The CAISO annually verifies the number, size, availability, and location of Black Start units.Step 3: The CAISO documents Cranking Paths and provides them to WECC upon request.Step 4: The CAISO evaluates diverse fuel resources, cranking paths, communication, unit capabilities, and coordination with neighboring plans.Step 5: The planning process is coordinated with transmission owners and neighboring Balancing Authorities.Step 6: The CAISO annually enters into RMR and Interim Black Start Contracts with qualified generators.","plantuml":"start\n\n:Conduct contingency studies;\n:Determine amount and location of Black Start Generation;\n:Verify Black Start units annually;\n\nfork\n:Number;\nfork again\n:Size;\nfork again\n:Availability;\nfork again\n:Location;\nend fork\n\n:Document Cranking Paths;\n:Provide to WECC upon request;\n:Evaluate;\n\nfork\n:Diverse fuel resources;\nfork again\n:Cranking paths;\nfork again\n:Communication;\nfork again\n:Unit capabilities;\nfork again\n:Coordination with neighboring plans;\nend fork\n\n:Coordinate planning process;\nfork\n:With transmission owners;\nfork again\n:With neighboring Balancing Authorities;\nend fork\n\n:Enter into Contracts with qualified generators annually;\nfork\n:RMR;\nfork again\n:Interim Black Start;\nend fork\n\nstop"}
{"content":"Generator Unit Testing Steps (Minimal Requirements)Step 1: Owners of Voluntary Black Start units must demonstrate capability every five years, submit documentation, and notify the CAISO of test results.Step 2: Testing records must include dates, duration, and compliance with requirements.Step 3: Units must maintain voltage within emergency limits.Step 4: Units must have governors capable of isochronous mode.Step 5: Adequate transmission capacity must be available.Step 6: Units must start and energize transmission paths without external assistance.Step 7: Tests should include key operating aids like telephone communications and SCADA.Step 8: Start-up/synchronizing time limits apply based on unit type (e.g., hydro within 30 minutes).Step 9: Minimum run time duration is 10 minutes.Step 10: Submit a CAISO market schedule for test energy.","plantuml":"start\n\n:Demonstrate capability every five years;\n:Submit documentation;;\n:Notify CAISO of test results;\n\n:Testing records;\nfork\n:Include dates;\nfork again\n:Include duration;\nfork again\n:Compliance with requirements;\nend fork\n\n:Units requirments;\nfork\n:Maintain voltage within emergency limits;\nfork again\n:Have isochronous mode governors;\nfork again\n:Adequate transmission capacity;\nfork again\n:Without external assistance;\n:Start and energize transmission paths;\nend fork\n\n:Tests requirments;\nfork\n:Include key operating aids;\nfork again\n:Start-up/synchronizing time limits apply based on unit type;\nfork again\n:Minimum run time duration 10 minutes;\nend fork\n\n:Submit CAISO test energy market schedule;\n\nstop"}
{"content":"[RMR & Interim Black Start Testing Steps]Step 1: Units must satisfy CAISO technical requirements.Step 2: The CAISO may conduct performance tests with or without notice.Step 3: The CAISO determines when Black Start operation is required.Step 4: The CAISO annually tests at least one-third of RMR and Interim Black Start units.Step 5: Units may be tested for self-providing start-up power.Step 6: Units may be tested for successive starts and reactive power production.","plantuml":"start\n\n:Units must satisfy CAISO technical requirements;\n\n:CAISO requirements;\nfork\n:Conduct tests with or without notice;\nfork again\n:Determine when Black Start operation;\nfork again\n:Test >= 1/3 RMR and Interim Black Start units annually;\nend fork\n\n:Possible test contents;\nfork\n:Self-providing start-up power;\nfork again\n:Successive starts;\nfork again\n:Reactive power production;\nend fork\n\nstop"}
{"content":"[RMR & Interim BS Unit Owner Actions]Step 1: Request an Availability Test at any time.Step 2: Submit a request using G-213H Black Start Test Report Form.Step 3: If testing above contract MNDC, request this in the form.Step 4: If a unit retests and passes, correct its Availability in SLIC.Alhambra Generation Dispatcher ActionsStep 5: Notify the BS Unit SC via telephone before the test starts.Step 6: Transmit an Availability Test Dispatch Notice before the test.[BS Generating Unit Operator Actions]Step 7: Ramp to the requested MW before the test starts.Step 8: Maintain the requested MW for four full hours.Step 9: Ramp down or continue in Market Transaction after the test.[RMR Generating Unit Operator Actions (Optional for Interim BS Units)]Step 10: Submit Ambient Temperature information after the test.Step 11: Submit four Ambient Temperature Points to the CAISO.[CAISO Operations Support Test Administrator Actions]Step 12: Determine the BS Unit’s Availability by averaging MWh output.Step 13: Declare the unit available if output meets 99% threshold; otherwise, adjust the Availability Limit.","plantuml":"start\n\npartition \"RMR & Interim BS Unit Owner\"{\n :Request Availability Test;\n :Submit request using G-213H Black Start Test Report Form;\n\n if(Testing above contract MNDC?) then(yes)\n :Request in the form;\n else(no)\n endif\n\n if(Unit retests and passes?) then(yes)\n :Correct Availability in SLIC;\n else(no)\n endif\n}\n\npartition \"Alhambra Generation Dispatcher\"{\n :Notify BS Unit SC via telephone;\n :Transmit Availability Test Dispatch Notice;\n}\n\npartition \"BS Generating Unit Operator\"{\n :Ramp to requested MW;\n :Maintain requested MW for 4 hours;\n :Test;\n :Ramp down/continue Market Transaction;\n}\n\npartition \"RMR Generating Unit Operator\"{\n :Submit Ambient Temperature;\n :Submit 4 Ambient Temperature Points;\n}\n\npartition \"CAISO Operations Support Test Administrator\" {\n :Average MWh output;\n :Determine BS Unit's Availability;\n   if(Output >= 99%?) then (yes)\n   :Declare unit available;\n   else (no)\n   :Adjust Availability Limit;\n   endif\n}\n\nstop"}
{"content":"[Recordkeeping Steps]Step 1: The CAISO maintains a Black Start database reviewed annually.Step 2: If a unit fails testing, provide an explanation and correction plan to the CAISO.","plantuml":"start\n\n:CAISO maintains Black Start database;\n:Review annually;\n\nif(A unit fails testing?) then(yes)\n:Provide to CAISO;\nfork\n:Explanation;\nfork again\n:Correction plan;\nend fork\nelse(no)\nendif\n\nstop"}
{"content":"[Training Steps]Step 1: Train Real-time Grid Operators annually on system restoration and Black Start use.Step 2: Conduct simulations of system shutdowns and restoration when a simulator becomes available.","plantuml":"start\n\n:Train Real-time Grid Operators annually;\nfork\n:System restoration;\nfork again\n:Black Start use;\nend fork\n\nif(Simulator available?) then(yes)\n:Conduct simulations;\nfork\n:System shutdowns;\nfork again\n:System restoration;\nend fork\nelse(no)\nendif\n\nstop"}
{"content":"1. transaction user interface: give the buy instruction 2. central trading system: save the buy instruction 3. central trading system: match the instructions with the same stock id 4. central trading system: make a trade by matching 5. central trading system: modify the information of matched instructions","plantuml":"start\n\npartition \"Transaction user interface\"{\n  :Give buy instruction;\n}\n\npartition \"Central trading system\"{\n  :Save buy instruction;\n  :Match instructions with same stock id;\n  :Make a trade by matching;\n  :Modify information of matched instructions;\n}\n\nstop"}
{"content":"1. transaction user interface: give the sell instruction 2. central trading system: save the sell instruction 3. central trading system: match the instructions with the same stock id 4. central trading system: make a trade by matching 5. central trading system: modify the information of matched instructions","plantuml":"start\n\npartition \"Transaction user interface\"{\n  :Give sell instruction;\n}\n\npartition \"Central trading system\"{\n  :Save sell instruction;\n  :Match instructions with same stock id;\n  :Make a trade by matching;\n  :Modify information of matched instructions;\n}\n\nstop"}
{"content":"1. transaction user interface: give the cancel instruction 2. central trading system: save the cancel instruction 3. central trading system: cancel the correlative instruction","plantuml":"start\n\npartition \"Transaction user interface\"{\n  :Give cancel instruction;\n}\n\npartition \"Central trading system\"{\n  :Save cancel instruction;\n  :Cancel correlative instruction;\n}\n\nstop"}
{"content":"1. central trading system: give out the successful trade information 2. security account management: save the trade information","plantuml":"start\n\npartition \"Central trading system\"{\n  :Give out successful trade information;\n}\n\npartition \"Security account management\"{\n  :Save trade instruction;\n}\n\nstop"}
{"content":"1. trading information release system: send a query 2. central trading system: implement the query 3. central trading system: structuralize the queried data 4. central trading system: send the data to release","plantuml":"start\n\npartition \"Trading information release system\"{\n  :Send a query;\n}\n\npartition \"Central trading system\"{\n  :Implement the query;\n  :Structuralize queried data;\n  :Send data to release;\n}\n\nstop"}
{"content":"5.2.2.1 It shall be possible for the driver to initiate a call to any of the following types of controller with a minimum of driver action being required (eg a single keystroke): (M) primary controller; secondary controller; power supply controller. 5.2.2.2 If the radio system cannot give a unique identity for a given type of controller, the identity could be obtained using external systems as defined in 11.4.7. (I) 5.2.2.3 Once an appropriate destination has been obtained, the radio shall attempt to establish a call to this destination. The functional identity shall be displayed to the controller. (M) 5.2.2.3i The functional identity includes the following: − the train number, if available; (M) − the engine number, if no train number is available; (M) − the coach number of the leading cab, if neither a train number nor an engine number is available. (O) 5.2.2.4 An audible and visual indication shall be provided to the driver that the call is proceeding. (M) 5.2.2.5 When the call is connected to the controller, an audible and visual indication is to be provided to the driver. The call shall be connected to the loudspeaker at the pre-set value. (M) 5.2.2.6 The functional identity of the connected party, if available, shall be displayed to the driver. (M) 5.2.2.7 If the functional identity of the connected party contains an alphanumeric description, this shall also be displayed. (M) 5.2.2.8 If the system is not able to connect the call, an audible and visual indication shall be provided to the driver that the call was not received by the controller. This shall also indicate if the called party was busy or if the network could not connect the call. (M)","plantuml":"start\n\n:Initiate call to controller;\nfork\n:Primary controller;\nfork again\n:Secondary controller;\nfork again\n:Power supply controller;\nend fork\n\nif(Unique identity?) then(no)\n:Use external systems to obtain;\nelse(yes)\nendif\n\n:Obtain appropriate destination;\n:Attempt to establish call to destination;\n:Functional identity be displayed;\n\nif(Train number available?) then(yes)\n:Train number;\nelse(no)\n  if(Engine number available?) then(yes)\n  :Engine number;\n  else(no)\n  :Coach number of leading cab;\n  endif\nendif\n\n:Call is proceeding;\nif(Audible and visual indication?) then(yes)\n:Provide to driver;\nelse(no)\nendif\n\n:Call is connected;\n:Provide driver audible and visual indication;\n:Connect call to loudspeaker at pre-set value;\n\nif(Connected party functional identity available?) then(yes)\n:Display to driver;\n  if(An alphanumeric description?) then(yes)\n  :Display;\n  else(no)\n  endif\nelse(no)\nendif\n\nif(System connect call?) then(no)\n:Provide driver audible and visual indication;\n:Show call was not received;\n:Indicate busy/network could not connect;\nelse(yes)\nendif\n\nstop"}
{"content":"5.2.2.18 It shall be possible for a driver to initiate Railway emergency calls (see section 13). (M) 5.2.2.19 If a train-borne recorder is connected to the Cab radio, details of the activation, termination and any failures of the emergency function shall be sent to the train-borne recorder as each event occurs. (M) 5.2.2.20 A continuous visual and short audible indication (from 0 to 20 seconds, for trials: 5 seconds) that the emergency function has been activated shall be provided in the cab. (Note that when the handset is off-hook, the audible indication shall be sounded from the loudspeaker at a low volume, but shall not be sounded from the handset.) (M) 5.2.2.21 Once the Railway emergency call is connected and the audible indication is finished, an indication shall be provided to the driver as a reminder of the need to use the PushTo-Talk button on the handset if he wants to speak. (M) 5.2.2.22 The call shall be connected to the loudspeaker until the driver picks up the handset. (M) 5.2.2.23 If the train moves out of the call area whilst the call is in progress, it will leave the call and an audible and visual indication of the loss of call shall be provided to the driver. (M) 5.2.2.24 Once the call is terminated, the continuous visual alarm indication in the cab shall cease. (M) 5.2.2.25 If the system is not able to connect the call, an audible and visual indication shall be provided to the driver. (M)","plantuml":"start\n\n:Initiate Railway emergency calls;\n\nif(Train-borne recorder connects Cab radio?) then(yes)\n:Event occurs;\n\n:Send details to train-borne recorder;\nfork\n:Activation;\nfork again\n:Termination;\nfork again\n:Emergency function failure;\nend fork\nelse(no)\nendif\n\n:Emergency function be activated;\n:Provide continuous visual and audible indication;\n\nif(Handset is off-hook?) then(yes)\n:Audible indication at low volume;\n:Not from handset;\nelse(no)\nendif\n\nif(Emergency call is connected?) then(yes)\n:Audible indication is finished;\n\n:Provide indication;\nif(Want to speak?) then(yes)\n:Use PushTo-Talk button;\nelse(no)\nendif\n\nif(Pick up handset?) then(no)\n:Call be connected to loudspeaker;\nelse(yes)\nendif\n\nif(Train moves out of call area whilst?) then(yes)\n:Leave call;\n:Provide loss audible and visual indication;\nelse(no)\nendif\n\n:Call is terminated;\n:Visual alarm indication ceases;\n\nelse(no)\n:Provide audible and visual indication;\nendif\n\nstop"}
{"content":"5.2.2.26 Many trains employ multiple active traction vehicles. Where these vehicles are not connected by on-train wire connections, it shall be possible for the lead driver to establish a permanent radio connection between each of the active cabs. (M) 5.2.2.27 The call will be established from the active cab of the lead traction vehicle. (I) 5.2.2.28 Whilst on-going, a ‘multi-drivers’ indication shall be displayed permanently at all Cab radios. (M) 5.2.2.29 The lead driver shall be notified if a member of the group has placed the call on hold, although this shall not affect communications between the remaining members of the group. (M) 5.2.2.30 At any time during the call, the lead driver shall be able to remove a member of the group. (M) 5.2.2.31 The lead driver shall be able to terminate the entire call. (M) 5.2.2.32 If a driver is disconnected from the multi-driver call, a clear indication shall be given. (M) 5.2.2.33 The setting up and closing down of a multi-driver call shall be simplified using automation or guidance through the steps required. (M) 5.2.2.34 In each cab, the call shall be connected to the loudspeaker whilst the handset is onhook. (M) 5.2.2.35 If any part of the call fails, an audible and visual indication shall be provided in the appropriate cab. (M) 5.2.2.36 If the call fails in the lead traction vehicle, the lead driver will be responsible for reestablishing the call. If the call fails to any other cab, the driver in that cab will call the lead cab and request re-establishment of the call. (I)","plantuml":"start\n\n:Employ multiple active traction vehicles;\n\nif(Connect to on-train wire?) then(no)\n:Establish permanent radio connection between active cabs;\nelse(yes)\nendif\n\n:Establish call from lead traction vehicle active cab;\n:Whilst on-going;\n:Display ‘multi-drivers’ indication permanently;\n\nif(Group member places call on hold?) then(yes)\n:Not affect other communications;\n:Notify lead driver;\nelse(no)\nendif\n\nif(Lead driver wants to remove member?) then(yes)\n:Remove group member;\nelse(no)\nendif\n\nif(Lead driver wants to terminate entire call?) then(yes)\n:Terminate entire call;\nelse(no)\nendif\n\nif(Disconnected from multi-driver call?) then(yes)\n:Give claer indication;\nelse(no)\nendif\n\n:Use automation or guidance;\n:Simplify setting up and closing down;\n\n:Connect caall to loudspeaker whilst;\n:Handset is onhook;\n\nif(Any part fails?) then(yes)\n:Provide audible and visual indication;\n if(Fail in lead traction vehicle?) then(yes)\n  :Lead driver reestablish call;\n else(no)\n endif\n\n if(Fail to any other cab?) then(yes)\n  :Driver call lead cab;\n  :Request re-establishment;\n else(no)\n endif\nelse(no)\nendif\n\nstop"}
{"content":"5.2.3.1 Powering up the Cab radio will initiate the following: − automatic self-testing; (M) − automatic selection of the pre-set loudspeaker volume; (M) − registration with other on-train systems, such as ERTMS/ETCS; (M) − all failures of self-tests should be recorded in the train-borne recorder; (O) − connection of the Cab radio to an authorised mobile network. This shall be the network to which the mobile was last registered (where available); (M) − if connection is successful, the name of the network shall be displayed on the MMI and an audible indication of successful connection shall be given; (M) − if connection is not successful, an audible and visual indication shall be provided. (M) − if connection is not successful, the manual network selection procedure may be initiated by the driver (see 5.2.3.23). (I) 5.2.3.2 At the point of successful connection, the Cab radio will be able to receive all calls made using the Cab radio’s telephone number, engine number or appropriate group call numbers (including Railway emergency calls). (I) 5.2.3.3 Powering down the Cab radio shall cause the disconnection of the Cab radio from the mobile network. (M) 5.2.3.4 When switched off, the radio shall retain any numbers which are stored at the time the radio is switched off. (M)","plantuml":"start\n\n:Power up Cab radio;\n:Initiate operations;\n\nfork\n:Automatic self-testing;\nfork again\n:Automatic pre-set loudspeaker volume selection;\nfork again\n:Other on-train system registration;\nfork again\n:Record all self_tests failures;\nfork again\n\nif(Connect to last registered mobile network?) then(yes)\n if(Succeed?) then(yes)\n :Display network name;\n :Give audible indication;\n :Can receive calls by;\n  fork\n  :Cab radio telephone number;\n  fork again\n  :Engine number;\n  fork again\n  :Appropriate group numbers;\n  end fork\n else(no)\n :Provide audible and visual indication;\n :Initiate manual network selection procedure;\n endif\nelse(no)\nendif\n\nend fork\n\n:Power down Cab radio;\n:Disconnection from mobile network;\n:Retain any  stored numbers;\n\nstop"}
{"content":"5.2.3.5 The MMI on/off control shall be designed to prevent accidental activation/ deactivation. (M) 5.2.3.6 Switching the MMI on shall cause the following: (M) − self test of MMI (eg transitory lighting of the display and of all the controls and indicator lights of the MMI); − determination of the status of the Cab radio, providing a display of radio status on the MMI. 5.2.3.7 When the MMI is switched on, the configuration shall be determined by the time elapsed since the MMI was last switched off: (M) − less than t minutes – the MMI shall power up with the same configuration as when it was last powered down; − greater than t minutes – the MMI shall power up with default settings. 5.2.3.8 The time t should be able to be varied between 0 and 240 minutes, as a maintenance function, allowing the radio to power up in a consistent state following minor operational procedures or power interruptions. (O) 5.2.3.9 Switch off shall be “soft” so that the Cab radio completes the following housekeeping functions before actually switching off: (M) − controlled termination of a current call; − deregister train number (where applicable); − store required data; − confirmation of Railway emergency calls (see section 13). 5.2.3.10 As far as possible, the above procedure should also apply on power failure. (O) 5.2.3.11 When switched off, the following functions (if available) shall still be provided: (M) − public address; − call Chief Conductor; − intercom.","plantuml":"start\n\n:Designed to prevent accidental ON/OFF;\n\n:Switch MMI on;\nfork\n:MMI self test;\nfork again\n:Determine Cab radio status;\n:Display radio status;\nend fork\n\n:Determine configuration;\nswitch(Time elapsed since MMI last OFF)\ncase(<t<240 mins)\n:Same as last OFF;\ncase(>t>0 mins)\n:Default settings;\ncase(Other)\n:Not allowed;\nendswitch\n\nif(\"Soft\" switch off?) then(yes)\n:Cab radio completes before OFF;\n\nfork\n:Control current call termination;\nfork again\n:Deregister train number;\nfork again\n:Store required data;\nfork again\n:Confirm Railway emergency calls;\nend fork\nendif\n\n:Apply procedure on power failure;\n\n:Switch MMI off;\nif(Functions available?) then(yes)\n:Provide functions;\nfork\n:Public address;\nfork again\n:Call Chief Conductor;\nfork again\n:Intercom;\nend fork\nendif\n\nstop"}
{"content":"5.2.3.26 It shall be possible for the driver to register and deregister a train number in the following ways: 1) enter train number; (M) 2) initiate automated request (applicable only for leading driver). (O) 5.2.3.27 Where the driver is required to enter the train number information, the information entered shall be shown on the display and require confirmation by the driver before further actions are possible. (M) 5.2.3.28 If an automated request is initiated (option 2), the driver shall be able to accept or reject the train number returned by the network. (M) 5.2.3.28i Where ERTMS/ETCS and radio systems are available and the driver is required to enter the train number as part of the initialisation procedure, this task shall be carried out only once on the ERTMS/ETCS system and the entered number transmitted to the radio system. (M) 5.2.3.28ii Data entry may be from either system depending on the operating procedures agreed between the train operator and the railway infrastructure operator. (I) 5.2.3.29 The driver shall be warned (by audible and visual indications) if a train with the same train number is already registered on the same network. (M) 5.2.3.30 A means to override the currently registered train number shall be provided to the “newly registering” driver. (M) 5.2.3.31 The driver of the previously registered train shall be informed (by audible and visual indications) that his train number has been overridden by another driver. (M) 5.2.3.32 Where a change of train number is required during the course of a train’s journey, it shall be possible for the driver to initiate the change or override the automatic change. This shall be carried out by entering the train number (option 1 in 5.2.3.26). (M)","plantuml":"start\n\n:Enter train number;\n:Leading driver initiate automated request;\n:Register and deregister train number;\n\nif(Require driver enter train number information?) then(yes)\n:Display information entered;\n if(Confirmation?) then(yes)\n :Further actions;\n else(no)\n endif\nelse(no)\nendif\n\nif(Automated request is initiated?) then(yes)\n:Accept/reject train number returned;\nelse(no)\nendif\n\nif(ERTMS/ETCS and radio systems available?) then(yes)\n if(Driver is required to enter train number?) then(yes)\n :Task be carried out once;\n :Entered number transmit to radio system;\n else(no)\n endif\nelse(no)\nendif\n\n:Agree on operating procedures;\n:Data entry can from either system;\n\nif(Train number already register on?) then(yes)\n:Warn driver;\n:Provide override means;\n:Inform previously registered driver;\nelse(no)\nendif\n\nif(Change train number?) then(yes)\n:Enter train number;\n:Initiate change/Override automatic change;\nelse(no)\nendif\n\nstop"}
{"content":"13.2.2 Stage 1: Warning 13.2.2.1 A Railway emergency call shall be able to be initiated by using a simple MMI action (eg a single MMI action for the Cab and Operational radios). (M) 13.2.2.2 A connection of Railway emergency priority (see section 10.2) shall be established to a pre-determined set of receiving mobiles and controller(s). (M) 13.2.2.3 If the system is not able to connect the call, the system shall automatically keep trying to connect the call for 30 seconds. (M) 13.2.2.3i During this period the user shall be provided with an audible and visual indication that the system is trying to connect the call. (M) 13.2.2.3ii After the 30 second period, if the connection was unsuccessful, the system shall provide another audible and visual indication that it was unable to connect the call. (M) 13.2.2.4 An audible indication of 5 seconds (to be confirmed by trials) shall be provided to originating and receiving users that the emergency function has been activated. (M) 13.2.2.5 Different indications at the originating and receiving terminal may be provided. (O) 13.2.2.6 A continuous visual indication that the emergency function has been activated shall be provided at the originating and all receiving terminals. (M) 13.2.2.7 In the event that a train enters the affected area after the warning stage is complete, the same audible and visual indications shall be provided. (M)","plantuml":"start\n\n:Use simple MMI action;\n:Railway emergency be initiated;\n\n:Establish priority connection to pre-determined set;\nfork\n:Receiving mobiles;\nfork again\n:Controllers;\nend fork\n\nif(System connects call?) then(no)\nfork\n:Automatically keep trying 30s;\nfork again\n:Provide trying indication;\nend fork\n if(Successful connection?) then(no)\n :Provide unable indication;\n else(yes)\n endif\nelse(yes)\nendif\n\n:At originating and receiving terminal;\nfork\n:Provide different indications for 5s;\nfork again\n:Provide continuous visual indication;\nend fork\n:Show that emergency function is activated;\n\n:Warning stage is complete;\nif(Rrain enters affected area?) then(yes)\n:Provide same audible and visual indications;\nelse(no)\nendif\n\nstop"}
{"content":"Shunting group members (except the driver) can activate the Link Assurance Signal (LAS). Only one member may transmit LAS at a time. Maintenance modes for LAS activation: Mode 1: Continuous button press required. Mode 2: Periodic button press required (timeout deactivates LAS). LAS is an intermittent tone (800–850 Hz, 1 sec on / 2 sec off). LAS is interrupted upon receiving a Shunting Emergency Call.","plantuml":"start\n\n:Group members (not driver) initiate LAS;\n\nif(One member transmits?) then(no)\n:Not allowed;\nelse(yes)\n switch(Maintenance mode)\n case(Mode 1)\n :Continuous button press;\n case(Mode 2)\n :Periodic button press;\n if(Timeout?) then(yes)\n :Deactivate LAS;\n else(no)\n endif\nendswitch\n\n:Intermittent tone;\nfork\n:800–850 Hz;\nfork again\n:1s on / 2s off;\nend fork\n\nif(Receive Shunting Emergency Call?) then(yes)\n:LAS is interrupted;\nelse(no)\nendif\nendif\n\nstop"}
{"content":"User switches to Direct Mode only when normal services are unavailable. Manual channel selection (if multiple channels exist). Push-To-Talk (PTT) is used for voice transmission. Battery warnings are provided for portables. Audible/visual indication is given when normal services resume.","plantuml":"start\n\n:Normal services unavailable;\n:Switch to Direct Mode;\n\nif(Exist multiple channels?) then(yes)\n:Manual channel selection;\nelse(no)\nendif\n\n:Use PPT for voice transmission;\n:Provide portables battery warnings;\n\nif(Normal services resume?) then(yes)\n:Give audible/visual indication;\nelse(no)\nendif\n\nstop"}
{"content":"Transfer to Shunting on driver's selection shall only be possible when stationary. It shall be possible to manually select Shunting from Stand By operation, Full Supervision operation, or Partial Supervision operation. Automatic transfer to Shunting may be from Full Supervision operation and Partial Supervision operation status at any speed lower than or equal to the supervised shunting speed based on trackside information. Before automatic transition to Shunting, ETCS shall request confirmation from the driver. Exit from Shunting shall only be possible when the train is stationary. Exit from Shunting shall take place when the driver selects exit from shunting.","plantuml":"start\n\nif(Transfer to Shunting on driver's selection?) then(yes)\n if(Stationary?) then(yes)\n :From Stand By/Full Supervision/Partial Supervision operation;\n :Manually select Shunting;\n else(no)\n :Not allowed;\n endif\nelse(no)\nendif\n\nif(Automatic transfer?) then(yes)\n if(Speed <= Supervised speed?) then(yes)\n :From Full Supervision/Partial Supervision operation;\n :ETCS requests driver confirmation;\n :Automatic transfer;\n else(no)\n :Not allowed;\n endif\nelse(no)\nendif\n\nif(Exit from Shunting?) then(yes)\n if(Stationary?) then(yes)\n :Driver selects exit from shunting;\n :Exit;\n else(no)\n :Not allowed;\n endif\nelse(no)\nendif\n\nstop"}
{"content":"Partial Supervision shall be selected either by the Driver or by information received from track-to-train transmission. If acknowledgement is specified, the driver shall acknowledge transfer from Full Supervision to Partial Supervision within 5 seconds. The train shall leave Partial Supervision when the trainborne equipment is not operative any longer, when Shunting is selected, or when Full Supervision is available.","plantuml":"start\n\n:Select Partial Supervision;\nif(By driver?) then(yes)\n:Driver selects;\nelse(no)\n:By Track-to-train transmission information;\nendif\n\nif(Specified acknowledgement?) then(yes)\n:Acknowledge transfer in 5s;\nelse(no)\nendif\n\nif(Trainborne equipment is not operative?) then(yes)\n:Leave Partial Supervision;\nelse(no)\nendif\n\nif(Shunting is selected?) then(yes)\n:Leave Partial Supervision;\nelse(no)\nendif\n\nif(Full Supervision available?) then(yes)\n:Leave Partial Supervision;\nelse(no)\nendif\n\nstop"}
{"content":"Transferring to Full Supervision shall occur automatically when a movement authority and all other necessary information is received through track-to-train transmission. The trainborne equipment shall remain in Full Supervision until the trainborne equipment is not active any longer, when Shunting is selected, or when Partial Supervision information is received.","plantuml":"start\n:Receive through track-to-train transmission;\n\nfork\n:Movement authority;\nfork again\n:All other necessary information;\nend fork\n\n:Transfer to Full Supervision automatically;\n\nif(Trainborne equipment active?) then(yes)\n:Remain in Full Supervision;\nelse(no)\n:Exit Full Supervision;\nstop\nendif\n\nif(Shunting is selected?) then(no)\n:Remain in Full Supervision;\nelse(yes)\n:Exit Full Supervision;\nstop\nendif\n\nif(Partial Supervision information?) then(no)\n:Remain in Full Supervision;\nelse(yes)\n:Exit Full Supervision;\nstop\nendif\n\nstop"}
{"content":"When a traction unit passes a stop-signal, the emergency brake shall be triggered. The emergency brake shall be applied until the traction unit is stationary. When the traction unit is stationary, the driver shall be required to acknowledge the train trip condition. This acknowledgement will release the emergency brake. After the acknowledgement, the driver shall be able to continue the movement. After the acknowledgement, the train shall be able to be driven backwards for a certain distance defined by national value.","plantuml":"start\n\n:Traction unit passes a stop-signal;\n:Trigger emergency brake;\n\nrepeat\n:Apply emergency brake;\nrepeat while(Not Stationary?)\n\n:Acknowledge train trip condition;\n:Release emergency brake;\n\n:Continue movement;\n\nif(Backwards?) then(yes)\n:Drive for national value distance;\nelse(no)\nendif\n\nstop"}
{"content":"The trainborne equipment shall monitor the direction of movement in relation to the permitted direction. The trainborne equipment shall apply the emergency brake after a distance, defined by a national value, is travelled by the train. When the traction unit has come to a standstill, the driver shall be able to release the emergency brake. After releasing the emergency brake, ETCS will provide the supervision appertaining when roll away protection was initiated.","plantuml":"start\n\n:Monitor direction of permitted movement;\n:Drive for national value distance;\n:Apply emergency brake;\n\nif(Traction unit comes to standstill?) then(yes)\n:Driver can release emergency brake;\n:Roll away protection is initiated;\n:ETCS provides supervision appertaining;\nelse(no)\nendif\n\nstop"}
{"content":"When the event of a Transmission Failure, the following reactions shall be capable of being applied in accordance with a National Value: Option 1: The ETCS trainborne equipment shall immediately command the emergency brake. The failure shall be shown on the DMI. Option 2: The ETCS trainborne equipment shall immediately command the full service brake. The failure shall be shown on the DMI. Option 3: The train may proceed unrestricted to the end of its movement authority. The indication on the DMI shall remain, and the driver shall be informed about the loss of transmission.","plantuml":"start\n\n:Transmission Failure;\n\nswitch(National Value reactions)\ncase(Option 1)\n:ETCS trainborne equipment command emergency brake;\n:Failure be shown on DMI;\ncase(Option 2)\n:ETCS trainborne equipment command full service brake;\n:Failure be shown on DMI;\ncase(Option 3)\n:Train proceed to authority end;\n:Remain indication on DM;\n:Inform driver about transmission loss;\nendswitch\n\nstop"}
{"content":"Data Receive – The BE shall receive incoming data packets from the Correlator to Backend network interface. This network is a part of the BE System.","plantuml":"start\n\n:Get Correlator-Backend network interface;\n:Receive incoming data packets;\n\nstop"}
{"content":"Verify Receive – The BE shall verify the successful receipt of incoming data from the Correlator. This includes checking for receive errors and determining that all expected data was received, accumulation of error statistics and comparison against tolerances, and reporting of all out of tolerance conditions.","plantuml":":Verify successful receipt;\n\nfork\n:Check for receive errors;\nfork again\n:Determine all expected data was received;\nfork again\n:Accumulation of error statistics;\nfork again\n:Comparison against tolerances;\nfork again\n:Report out of tolerance conditions;\nend fork\n\nstop"}
{"content":"Input Data Management - The BE shall store input data records in a memory buffer and track buffer locations of all input data until data processing is complete. Report any buffer overflow conditions.","plantuml":"start\n\nrepeat\n:Store input data records in memory buffer;\n:Track buffer locations;\nrepeat while(Data processing is incomplete)\n\n:Report any buffer overflow conditions;\n\nstop"}
{"content":"Processing Management – The BE shall respond to incoming correlator mode changes, user optional processing sequence and/or parameter changes, and other external inputs that affect the data processing pipeline. Update internal parameter tables and synchronize data processing pipeline with new operational conditions.","plantuml":":Respond to;\n\nfork\n:Incoming correlator mode changes,;\nfork again\n:User optional processing sequence;\nfork again\n:Parameter changes;\nfork again\n:Other affective external inputs;\nend fork\n\n:Update internal parameter tables;\n:Synchronize data processing pipeline;\n\nstop"}
{"content":"Time Domain Processing – The BE shall be able to apply user selected time domain processes. These processes should be constructed to be chainable (output of any time domain process can be piped to input of any other, including replica of self and Fourier Transform) and repeatable in the chain. No Optional time domain processes have as yet been proposed.","plantuml":"start\n\n:Apply user selected time domain processes;\n\n:Process construction requirments;\nfork\n:Chainable;\n\n:Any output can be piped to any input;\nif(Replica?) then(yes)\n:Replica of self;\nelse(no)\n:Fourier Transform;\nendif\n\nfork again\n:Repeatable in chain;\nend fork\n\n:No proposed Optional time domain processes;\n\nstop"}
{"content":"Fourier Transform Processing – The BE shall be able to perform Fourier Transform the lag set time series. A power-of-two complex-to-complex Fast Fourier Transform with retention of all output positive and negative frequencies will be used. This process must be able to accept as input the output of any of the time domain processes.","plantuml":"start\n\n:Perform Fourier Transform lag set time series;\n:Use Fast Fourier Transform;\nfork\n:Power-of-two complex-to-complex;\nfork again\n:Retention of all output positive/negative frequencies;\nend fork\n\n:Accept any output as input;\n\nstop"}
{"content":"Frequency Domain Processing – The BE shall be able to apply user selected frequency domain processes. These processes should be constructed to be chainable (output of Fourier Transform and any frequency domain process can be piped to input of any frequency domain process including replica of self) and repeatable in the chain. No frequency domain processes have as yet been proposed.","plantuml":"start\n\n:Apply user selected frequency domain processes;\n\n:Process construction requirments;\nfork\n:Chainable;\n\nfork\n:Output of Fourier Transform;\nfork again\n:Any frequency domain process;\nend fork\n:Can be piped to any input;\n\nfork again\n:Repeatable in chain;\nend fork\n\n:No frequency domain processes;\n\nstop"}
{"content":"Integration – The BE shall be able to sum the frequency domain, spectral results. The amount (time duration) of summation will be controlled by an observational mode parameter obtained via M&C. The BE shall keep track of the number of samples/dumps integrated in each spectral channel. The summation will occur after all optional frequency domain processing, or if none, after the Fourier Transform. Integration for long periods of time is what will throttle the output of the Correlator to a rate manageable by the E2E.","plantuml":"start\n\n:Sum;\nfork\n:Frequency domain;\nfork again\n:Spectral results;\nend fork\n\n:Observational mode parameter obtained via M&C;\n:Control summation amount;\n\n:Keep track of samples/dumps number;\n\nif(All optional frequency domain processing?) then(no)\n:Fourier Transform;\nelse(yes)\nendif\n\n:Summation occurs;\n\n:Integration for long time;\n:Throttle output to E2E manageable rate;\n\nstop"}
{"content":"1. User accesses the main inventory screen 2. The screen displays all inventory departments 3. User clicks a department cell 4. The screen displays all inventory categories for the selected department 5. User clicks a category cell that contains sub-categories 6. The screen displays all inventory sub-categories for the selected category 7. User clicks a sub-category cell (leaf category) 7.1. For a Unique Item category: 7.1.1. The screen displays a list of all inventory items for that selected category 7.1.2. User clicks an item in the items list 7.1.3. The screen displays the details for the item 7.2. For a Stock Item category: 7.2.1. The screen displays the details for that Stock Item category 7.3. For a Under $5 category: 7.3.1. Nothing happens – The category cell is not clickable","plantuml":"start\n\n:Access main inventory screen;\n:Display inventory departments;\n:Click department cell;\n:Display inventory categories;\n\n:Click category cell;\n:Display inventory sub-categories;\n:Click sub-category cell;\n\nswitch(Category)\ncase(Unique Item)\n:Display list of inventory items;\n:Click item;\n:Display item details;\ncase(Stock Item)\n:Display Stock Item category detail;\ncase(Under $5)\n:Not clickable;\nendswitch\n\nstop"}
{"content":"1. Add Department 1.1. User accesses the main inventory screen 1.2. System displays the Add Department button 1.3. User clicks the Add Department button 1.4. User enters the Department data 1.5. System validates the Department data 1.6. System adds the new Department to the inventory 1.7. User is taken back to the main inventory screen","plantuml":"start\n\n:Access main inventory screen;\n:Display Add Department button;\n\n:Click Add Department button;\n:Enter Department data;\n\n:System validates data;\n:New Department is added;\n:Back to main inventory screen;\n\nstop"}
{"content":"2. Edit Department 2.1. User navigates to a Department (see View Inventory) 2.2. System displays the Edit Department button 2.3. User clicks the Edit Department button 2.4. System displays the Department data 2.5. User edits Department data 2.6. System validates the Department data 2.7. System updates the Department information 2.8. User is taken back to the Department screen","plantuml":"start\n\n:See View Inventory;\n:Navigate to Department;\n\n:Display Edit Department button;\n:Click Edit Department button;\n:Display Department data;\n\n:Edit Department data;\n:System validates data;\n\n:System updates information;\n:Back to Department screen;\n\nstop"}
{"content":"3. Delete Department 3.1. User navigates to a Department (see View Inventory) 3.2. System displays the Edit Department button 3.3. User clicks the Edit Department button 3.4. System displays the Department data 3.5. User clicks the Delete Department button 3.6. System validates the Department deletion 3.7. System removes the Department from the inventory 3.8. User is taken back to the main inventory screen","plantuml":"start\n\n:See View Inventory;\n:Navigate to Department;\n\n:Display Edit Department button;\n:Click Edit Department button;\n:Display Department data;\n\n:Click Delete Department button;\n:System validates deletion;\n\n:System removes Department;\n:Back to main inventory screen;\n\nstop"}
{"content":"1. Add Category 1.1. User navigates to a Department or Category (see View Inventory) 1.2. System displays the Add Category buttons 1.2.1. Unique Item 1.2.2. Stock Item 1.3. User clicks the desired Add Category button 1.4. System displays the appropriate screen for the Category type 1.4.1. Unique Item 1.4.2. Stock Item 1.5. User enters Category data 1.6. System validates the Category data 1.7. System adds the new Category to the inventory 1.8. User is taken back to the parent Department or Category of the added Category","plantuml":"start\n\n:See View Inventory;\n:Navigate to Department/Category;\n\n:Display Add Category buttons;\nfork\n:Unique Item;\nfork again\n:Stock Item;\nend fork\n\n:Click desired Add Category button;\n\nif(Unique Item?) then(yes)\n:Display Unique Item screen;\nelse(no)\n:Display Stock Item screen;\nendif\n\n:Enter Category data;\n:System validates Category data;\n:New Category is added;\n\n:Back to parent Department/Category;\n\nstop"}
{"content":"2. Edit Category 2.1. User navigates to a Category (see View Inventory) 2.2. System displays the Edit Category button 2.3. User clicks the Edit Category button 2.4. System displays the appropriate screen for the Category type 2.4.1. Unique Item 2.4.2. Stock Item 2.5. User edits Category data 2.6. System validates the Category data 2.7. System updates the Category information 2.8. User is taken back to the Category screen","plantuml":"start\n\n:See View Inventory;\n:Navigate to Category;\n\n:Display Edit Category button;\n:Click Edit Category button;\n:Display Category type screen;\n\nif(Unique Item?) then(yes)\n:Display Unique Item screen;\nelse(no)\n:Display Stock Item screen;\nendif\n\n:Edit Category data;\n:System validates data;\n\n:System updates information;\n:Back to Category screen;\n\nstop"}
{"content":"3. Delete Category 3.1. User navigates to a Category (see View Inventory) 3.2. System displays the Edit Category button 3.3. User clicks the Edit Category button 3.4. System displays the appropriate screen for the Category type 3.4.1. Unique Item 3.4.2. Stock Item 3.5. User clicks the Delete Category button 3.6. System validates the Category deletion 3.7. System removes the Category from the inventory 3.8. User is taken back to the parent Department or Category of the deleted Category","plantuml":"start\n\n:See View Inventory;\n:Navigate to Category;\n\n:Display Edit Category button;\n:Click Edit Category button;\n:Display Category type screen;\n\nif(Unique Item?) then(yes)\n:Display Unique Item screen;\nelse(no)\n:Display Stock Item screen;\nendif\n\n:Click Delete Category button;\n:System validates deletion;\n\n:System removes Category;\n:Back to parent Department/Category;\n\nstop"}
{"content":". Move Categories 4.1. User navigates to a Department or Category (see View Inventory) 4.2. System displays the Move Categories button 4.3. User clicks the Move Categories button 4.4. System displays the Move Categories screen 4.5. User selects Categories to move 4.6. User selects target location on categorized inventory for the moved Categories 4.6.1. User may select an existing Department or Category 4.6.2. User may choose to create a new Category to hold the moved Categories 4.6.2.1. Version 2.00 In this case, user selects the parent Department or Category of the new Category to be created 4.6.2.2. User enters the new Category data 4.7. User selects the type of move to be performed 4.7.1. Move selected categories as-is and make them children of the target Department or Category 4.7.2. Merge the contents (items) of the selected categories and add them to the target Department or Category 4.8. System validates the entered data 4.9. System moves the selected Categories 4.10. User is taken back to the parent Department or Category of the moved Categories","plantuml":"start\n\n:See View Inventory;\n:Navigate to Department/Category;\n\n:Display Move Categories button;\n:Click Move Categories button;\n:Display Move Categories screen;\n\n:Selects target location for moved Categories;\n\nif(Select existing Department/Category?) then(yes)\n:Use existing Department/Category;\nelse(no)\n:Create new Category;\n:Select parent Department/Category;\n:Enter new Category data;\nendif\n\nswitch(Select move type)\ncase(Move)\n:Move selected categories as-is;\n:Make them children of target Department/Category;\ncase(Merge)\n:Merge contents;\n:Add to target Department/Category;\nendswitch\n\n:System validates deletion;\n\n:System moves selected Category;\n:Back to parent Department/Category;\n\nstop"}
{"content":"1. View Item Attributes 1.1. User accesses the main inventory screen 1.2. System displays the Edit Attributes button 1.3. User clicks the Edit Attributes button 1.4. System displays the Edit Attributes screen which displays all existing item attributes and their attribute x department assignments 1.5. Optionally, user filters view by attribute status (active, inactive, all) 1.6. User clicks the Done button 1.7. User is taken back to the main inventory screen","plantuml":"start\n\n:Access main inventory screen;\n:Display Edit Attributes button;\n\n:Click Edit Attributes button;\n:Display Edit Attributes screen;\n\nfork\n:All existing item attributes;\nfork again\n:Attribute x department assignments;\nend fork\n\nif(Filter view?) then(yes)\n\nswitch(Attribute status)\ncase(Active)\n:Active status;\ncase(Inactive)\n:Inactive status;\ncase(All)\n:All status;\nendswitch\n\nelse(no)\nendif\n\n:Click Done button;\n:Back to main inventory screen;\n\nstop"}
{"content":"2. View Item Details 2.1. User accesses the main inventory screen 2.2. System displays the Edit Details button 2.3. User clicks the Edit Details button 2.4. System displays the Edit Details screen which displays all existing item details and their detail x department and category assignments 2.5. Optionally, user filters view by detail status (active, inactive, all) 2.6. User clicks the Done button 2.7. User is taken back to the main inventory screen","plantuml":"start\n\n:Access main inventory screen;\n:Display Edit Details button;\n\n:Click Edit Details button;\n\n:Display Edit Details screen;\nfork\n:All existing item details;\nfork again\n:Detail x department assignments;\nfork again\n:Detail x category assignments;\nend fork\n\nif(Filter view?) then(yes)\n\nswitch(Detail status)\ncase(Active)\n:Active status;\ncase(Inactive)\n:Inactive status;\ncase(All)\n:All status;\nendswitch\n\nelse(no)\nendif\n\n:Click Done button;\n:Back to main inventory screen;\n\nstop"}
{"content":"3. Edit Item Attributes 3.1. User accesses the main inventory screen 3.2. System displays the Edit Attributes button 3.3. User clicks the Edit Attributes button 3.4. System displays the Edit Attributes screen which displays all existing item attributes and their attribute x department assignments 3.5. Optionally, user filters view by attribute status (active, inactive, all) 3.6. User edits attributes 3.6.1. User changes attribute x department assignments 3.6.2. User changes attribute data 3.6.3. User changes attribute active x inactive status 3.6.4. User creates new attribute 3.6.5. System validates the attribute data 3.6.6. System updates the Item Attribute information 3.7. User clicks the Done button 3.8. User is taken back to the main inventory screen","plantuml":"start\n\n:Access main inventory screen;\n:Display Edit Attributes button;\n\n:Click Edit Attributes button;\n:Display Edit Attributes screen;\n\nfork\n:All existing item attributes;\nfork again\n:Attribute x department assignments;\nend fork\n\nif(Filter view?) then(yes)\n\nswitch(Attribute status)\ncase(Active)\n:Active status;\ncase(Inactive)\n:Inactive status;\ncase(All)\n:All status;\nendswitch\n\nelse(no)\nendif\n\n:Edit attributes;\n\nfork\n:Attribute x department assignments;\nfork again\n:Attribute data;\nfork again\n:Attribute active x inactive status;\nfork again\n:Create new attribute;\nend fork\n\n:System validates attribute data;\n:System updates information;\n\n:Click Done button;\n:Back to main inventory screen;\n\nstop"}
{"content":"4. Edit Item Details 4.1. User accesses the main inventory screen 4.2. System displays the Edit Details button 4.3. User clicks the Edit Details button 4.4. System displays the Edit Details screen which displays all existing item details and their detail x department and category assignments 4.5. Optionally, user filters view by detail status (active, inactive, all) 4.6. User edits details 4.6.1. User changes detail x department or category assignments 4.6.2. User changes detail data 4.6.3. User changes detail active x inactive status 4.6.4. User creates new detail 4.6.5. System validates the detail data 4.6.6. System updates the Item detail information 4.7. User clicks the Done button 4.8. User is taken back to the main inventory screen","plantuml":"start\n\n:Access main inventory screen;\n:Display Edit Details button;\n\n:Click Edit Details button;\n\n:Display Edit Details screen;\nfork\n:All existing item details;\nfork again\n:Detail x department assignments;\nfork again\n:Detail x category assignments;\nend fork\n\nif(Filter view?) then(yes)\n\nswitch(Detail status)\ncase(Active)\n:Active status;\ncase(Inactive)\n:Inactive status;\ncase(All)\n:All status;\nendswitch\n\nelse(no)\nendif\n\n:Edit details;\n\nfork\n:Detail x department/category assignments;\nfork again\n:Detail data;\nfork again\n:Detail active x inactive status;\nfork again\n:Create new detail;\nend fork\n\n:System validates detail data;\n:System updates information;\n\n:Click Done button;\n:Back to main inventory screen;\n\nstop"}
{"content":"1. User accesses the main inventory screen 5. The screen displays all inventory departments in matrix format (see View Inventory) 2. User drills down to the appropriate category for the item 2.1. If in donation processing mode, the item entry screen is presented automatically 2.2. If in inventory management mode, the list of existing inventory items in that category is displayed 2.2.1. User clicks the Add Item button 3. The appropriate item entry screen is presented 4. User fills in item information 5. User confirms the addition of the new item 6. Inventory is updated 7. System gives the option of printing an item tag 8. User prints item tag(s)s for unique or stock item(s) 9. User attaches tag(s) to the item(s)","plantuml":"start\n\n:Access main inventory screen;\n:See View Inventory;\n:Display inventory departments in matrix format;\n\nswitch(Drill down to appropriate category)\ncase(Donation processing mode)\n:Item entry screen is presented automatically;\ncase(Inventory management mode)\n:List of existing inventory items is displayed;\nendswitch\n\n:Click Add Item button;\n:Appropriate item entry screen is presented;\n:Fill in item information;\n:Confirm addition;\n\n:Inventory is updated;\n:System gives option of printing item tag;\n:Print item tag for unique/stock item;\n:Attach tag to item;\n\nstop"}
{"content":"1. Modify Inventory Item 1.1. User accesses the main inventory screen 1.2. The screen displays all inventory departments in matrix format with option to select and/or edit items to move them to a new department/category 1.3. User drills down to the desired existing inventory item (see View Inventory) 1.4. The item detail screen is presented 1.5. User modifies item information 1.6. The system validates item information 1.7. Item information is updated in the inventory 1.8. System gives the option of re-printing then item tag 1.9. User optionally re-prints the item tag and attaches it to the item","plantuml":"start\n\n:Access main inventory screen;\n:Display;\n\nfork\n:Inventory departments;\nfork again\n:Option to select and/or edit items;\nend fork\n\n:See View Inventory;\n:Drill down to desired existing inventory item;\n\n:Item detail screen is presented;\n:Modify item information;\n:System validates item information;\n\n:Item information is updated in inventory;\n:System gives option of re-printing then item tag;\n\nif(Re-print?) then(yes)\n:re-print item tag;\n:Attach it to item;\nelse(no)\nendif\n\nstop"}
{"content":"2. Adjust Item Quantity 2.1. User accesses the main inventory screen 2.2. The screen displays all inventory departments in matrix format 2.3. User drills down to the desired existing inventory item (see View Inventory) 2.4. The item detail screen is presented 2.5. User changes the item quantity 2.6. The system displays a confirmation screen where a reason for the adjustment must be specified by the user 2.7. The system validates the item change 2.8. Item information is updated in the inventory","plantuml":"start\n\n:Access main inventory screen;\n:Display inventory departments;\n\n:See View Inventory;\n:Drill down to desired existing inventory item;\n\n:Item detail screen is presented;\n:Change item quantity;\n:Display confirmation screen;\n:Specify adjustment reason;\n\n:System validates item change;\n:Item information is updated in inventory;\n\nstop"}
{"content":"3. Split Inventory Item 3.1. User accesses the main inventory screen 3.2. The screen displays all inventory departments in matrix format 3.3. User drills down to the desired existing inventory item (see View Inventory) 3.4. The item detail screen is presented 3.5. User clicks the Split Item button 3.6. The system displays the Item Split screen 3.7. User builds the list of items that the original item will be split into 3.7.1. User can clone the original item to add new item(s) to the list that have similar attributes as the original item 3.7.2. User can add new items to the list by selecting Unique and Stock categories in the same way as adding a new item to the inventory (see Add Item to Inventory) 3.8. Once the list is complete, user confirms the split 3.9. The system validates the split 3.10. Item information is updated in the inventory 3.10.1. The original (split) item is updated in the inventory 3.10.2. Any new items that were added to the split list are added to the inventory maintaining parental history","plantuml":"start\n\n:Access main inventory screen;\n:Display inventory departments;\n\n:See View Inventory;\n:Drill down to desired existing inventory item;\n:Item detail screen is presented;\n\n:Click Split Item button;\n:Display Item Split screen;\n\n:Split original item;\n:Build list of items;\n:Add item;\n\nrepeat\nswitch(Way to add item)\ncase(Similar attributes)\n:Clone original item;\ncase(New item)\n:Select Unique and Stock categories;\n:Same as Add Item to Inventory;\nendswitch\nrepeat while(More items?)\n\n:List is complete;\n:Confirm split;\n\n:System validates split;\n:Item information is updated in inventory;\nfork\n:Original(split) item is updated;\nfork again\n:New items are added to inventory maintaining parental history;\n\nstop"}
{"content":"4. View Inventory Item History 4.1. User accesses the main inventory screen 4.2. The screen displays all inventory departments in matrix format 4.3. User drills down to the desired existing inventory item (see View Inventory) 4.4. The item detail screen is presented 4.5. User clicks the Item History button 4.6. The system displays the Item History screen containing current and historical information about the inventory item","plantuml":"start\n\n:Access main inventory screen;\n:Display inventory departments;\n\n:See View Inventory;\n:Drill down to desired existing inventory item;\n:Item detail screen is presented;\n\n:Click Item History button;\n:Display Item History screen;\nfork\n:Current inventory item information;\nfork again\n:Historical inventory item information;\nend fork\n\nstop"}
{"content":"1. User accesses the inventory entry screen (see Add Item to Inventory, Manage Inventory Items) 2. System shows price recommendations based on current item data and default price suggestion configuration options 3. User modifies item data 4. System makes new price suggestions based on new item data","plantuml":"start\n\n:See;\nfork\n:Add Item to Inventory;\nfork again\n:Manage Inventory Items;\nend fork\n\n:Access inventory entry screen;\n:Refer to;\n\nfork\n:Current item data;\nfork again\n:Default price suggestion configuration options;\nend fork\n\n:Show price recommendations;\n:Refer to new item data;\n:Make new price suggestions;\n\nstop"}
{"content":"1. User accesses the acquisitions screen 2. The screen displays a list of all acquisitions, latest ones at the top of the list 3. User may optionally filter the acquisitions displayed on the screen by changing filtering options 4. User clicks on an acquisition record 5. System display the details for that acquisition, including expected items","plantuml":"start\n\n:Access acquisitions screen;\n:Display list of all acquisitions;\n:Latest ones at top;\n\nif(Filter acquisitions?) then(yes)\n:Change filtering options;\nelse(no)\nendif\n\n:Click on acquisition record;\n:Display acquisition details;\n:Expected items are displayed;\n\nstop"}
{"content":"1. Donor or Primary Contact arrives at receiving dock with a valid donation number 2. Receiving Associate locates donation request in the system (see View Acquisitions) 3. System displays donation request information 4. Receiving Associate enters information about each donated item into the donation request (see Add Item to Inventory) 4.1. A new item can be added to the list by cloning an existing item 4.2. A new item can be added by clicking the Add Item button 4.3. An item can be removed by setting the received quantity to zero 5. Receiving Associate prints a donation receipt 6. Receiving Associate optionally writes information to the receipt by hand such as condition 7. Donation receipt is given to the Donor or Primary Contact 8. Receiving Associate prints item tags for unique and stock items (see Add Item to Inventory) 9. Receiving Associate attaches printed tags to corresponding items 10. Receiving Associate closes donation request","plantuml":"start\n\n:Donor/Primary Contact has valid donation number;\n:Arrive at receiving dock;\n\n:See View Acquisitions;\n:Locate donation request;\n\n:Display donation request information;\n:See Add Item to Inventory;\n:Enter information;\n\nif(Add new item?) then(yes)\nswitch(Way to add item)\ncase(Clone)\n:Clone an existing item;\ncase(Click)\n:Click Add Item button;\nendswitch\nelse(no)\nendif\n\nif(Remove item?) then(yes)\n:Set received quantity to 0;\nelse(no)\nendif\n\n:Print donation receipt;\n\nif(Write information?) then(yes)\n:Write information to receipt by hand;\nelse(no)\nendif\n\n:Give donation receipt to Donor/Primary Contact;\n:See Add Item to Inventory;\n:Print item tags for unique and stock items;\n:Aattach printed tags to corresponding items;\n:Close donation request;\n\nstop"}
{"content":"1. Buyer arrives at the cashier or checkout desk with the items to be purchased 2. Sales associate scans the item tags 3. Sales associate processes the sale of the items in QuickBooks POS 4. The system updates the inventory to reflect the sale","plantuml":"start\n\n:Buyer arrives at cashier/checkout desk;\n:Show items to be purchased;\n\n:Sales associate scans tags;\n:Associate processes QuickBooks POS sale;\n\n:System updates inventory;\n:Reflect sale;\n\nstop"}
{"content":"The system should be able to generate reports based on the following entities, including reports that correlate them: Inventory items Inventory departments Inventory categories Acquisitions Donors","plantuml":"start\n\n:Entity/reports to be referred to;\n\nfork\n:Inventory items;\nfork again\n:Inventory departments;\nfork again\n:Inventory categories;\nfork again\n:Acquisitions Donors;\nend fork\n\nstop"}
{"content":"1. User opens KeePass and select New->Database 2. User writes his private Master Password and/or selects Key File 3. User selects OK 4. Master Password confirmation: the user retypes Master Password 5. The main database window opens 3.1.2.2.1 Alternative Data Flow 1 3. User selects Help 4. The help file opens 3.1.2.2.2 Alternative Data Flow 2 3. User selects Cancel 4. Exit from KeePass 3.1.2.2.3 Alternative Data Flow 3 2a. The user does not determines a Master Password 2b. A message is appeared which prompts him to enter a password or key file","plantuml":"start\n\n:Open KeePass;\n:Select New->Database;\n\n:Write private Master Password and/or select Key File;\n\nif(Determine Master Password?) then(yes)\nswitch(Selection)\ncase(Help)\n:Help files open;\ncase(Cancel)\n:Exit from KeePass;\ncase(OK)\n:Retype Master Password for confirmation;\n:Main database window opens;\nendswitch\n\nelse(no)\n:Message prompts to enter password/key file;\nendif\n\nstop"}
{"content":"1. User opens KeePass and select Open->Database 2. User navigates through his folders 3. User selects a database 4. User types Master Password 5. The main database window opens 3.2.2.2.1 Alternative Data Flow 1 3a. User selects a type of folder non suitable for database 3b. A message “file not found” appears 3c. User selects another folder 3.2.2.2.2 Alternative Data Flow 2 4a. Master Password is wrong 4b. A message “invalid/wrong key” appears 4c. User types another master key 3.2.2.2.3 Alternative Data Flow 3 3. User chooses cancel 4. Exit from KeePass","plantuml":"start\n\n:Open KeePass;\n:Select Open->Database;\n\n:Navigate through folders;\n\n:Select database;\nif(Folder is suitable?) then(no)\n:“File not found” appears;\n:Select another folder;\nelse(yes)\nendif\n\n:Choose cancel;\n:Exit from KeePass;\n\n:Type Master Password;\n\nif(Password is right?) then(no)\n:“Invalid/wrong key” appears;\n:Type another master key;\nelse(yes)\nendif\n\n:Main database window opens;\n\nstop"}
{"content":"1. User opens KeePass and changes his data 2. User selects save database 3. Database is saved 4. User exits KeePass 3.3.2.2.1 Alternative Data Flow 1 2a. User selects save as 2b. User gives a new database name 2c. New database is saved and opens with the same master password 3.3.2.2.2 Alternative Data Flow 2 4. User continues working after he saves the database 3.3.2.2.3 Alternative Data Flow 3 2a. User wants to exit KeePass 2b. A message is appeared asking if he wants to save the database 2c. User selects yes and exits, or no and exits or cancel and return to database 3.3.2.2.4 Alternative Data Flow 4 2a.Users minimizes the database 2b. A message is appeared asking if he wants to save the database before locking","plantuml":"start\n\n:Open KeePass;\n:Change data;\n\nswitch(Selection) \ncase(Save database)\n:Database is saved;\ncase(Save as)\n:Give new database name;\n:New database is saved;\n:Open with same master password;\ncase(Exit)\n switch(Massage asks if save?)\n case(Yes)\n  :Select yes;\n  :Exit;\n case(No)\n  :Select no;\n  :Exit;\n case(Cancel)\n  :Cancel;\n  :Return to database;\n endswitch\ncase(Minimize)\n:Message asks if save before locking;\nendswitch\n\nif(Continue working?) then(no)\n:Exit KeePass;\nelse(yes)\nendif\n\nstop"}
{"content":"3.4.2.1 Basic Data Flow 1. User opens KeePass 2. User selects print from file menu 3. The list of options opens with checked the fields: password groups, title, user name, password, URL, notes 4. User selects OK 5. Data are print 6. User returns on the main window 3.4.2.2 Alternative Data Flows 3.4.2.2.1 Alternative Data Flow 1 3a. User selects some more fields and/or unselects some others. 3.4.2.2.2 Alternative Data Flow 2 3a. User unselects all fields 3b. An empty report is printed 3.4.2.2.3 Alternative Data Flow 3 4. User selects Cancel 5. User returns on the main window","plantuml":"start\n\n:Open KeePass;\n:Select print from file menu;\n\n:List of options opens;\n:Checked fields;\nfork\n:Password groups;\nfork again\n:Title;\nfork again\n:User name;\nfork again\n:Password;\nfork again\n:URL;\nfork again\n:Notes;\nend fork\n\nswitch(Selection on fields)\ncase(More)\n:Select some more;\ncase(Less)\n:Unselect some others;\ncase(No)\n:Unselect all fields;\n:Empty report is printed;\nendswitch\n\nif(Selection) then(OK)\n:Data are print;\nelse(Cancel)\nendif\n\n:Return on main window;\n\nstop"}
{"content":"1. User opens KeePass 2. User types a password, user name, URL, word of notes, title or group that exist in the database 3. The list of data related to search word are appeared in the main window 3.5.2.2 Alternative Data Flows 3.5.2.2.1 Alternative Data Flow 1 2. User types two or more words in the search field 3. Nothing appears in the main window 3.5.2.2.2 Alternative Data Flow 2 2. User does not type anything 3. Nothing appears in the main window 3.5.2.2.3 Alternative Data Flow 3 2a. User types part or even just one character of password, user name, URL, word of notes, title or group 3.5.2.2.4 Alternative Data Flow 4 2. User types data not related with the database 3. Nothing appears in the main window","plantuml":"start\n\n:Open KeePass;\n\n:Information can be input;\nfork\n:Password;\nfork again\n:User name;\nfork again\n:URL;\nfork again\n:Word of notes;\nfork again\n:Title;\nfork again\n:Group;\nend fork\n\nswitch(Input)\ncase(Existing)\n:List of data related are appeared;\ncase(Two or more words)\n:Nothing appears;\ncase(No input)\n:Nothing appears;\ncase(Part or one character)\n if(Found?) then(yes)\n :List of data related are appeared;\n else(no)\n :Nothing appears;\n endif\ncase(Not related input)\n:Nothing appears;\nendswitch\n\nstop"}
{"content":"1. User opens KeePass and selects to add new group/subgroup 2. User types a name and has the option to select an image 3. User selects OK 4. The group/subgroup is created 5. The access returns to the database main window 3.6.2.2 Alternative Data Flows 3.6.2.2.1 Alternative Data Flow 1 2. User leaves the group/subgroup name field empty 3. A message is appeared “Add a name for the group/subgroup” 3.6.2.2.2 Alternative Data Flow 2 3. User selects Cancel 4. The access returns to main window","plantuml":"start\n\n:Open KeePass;\n:Select to add new group/subgroup;\n\nif(Leave name field empty?) then(no)\n:Type name;\n:Have option to select image;\n\nswitch(Selection)\ncase(OK)\n:Group/Subgroup is created;\n:Return to database main window;\ncase(Cancel)\n:Return to main window;\nendswitch\n\nelse(yes)\n:“Add a name for the group/subgroup” appears;\nendif\n\nstop"}
{"content":"1. User opens KeePass and selects modify group/subgroup 2. User types the new name and has the option to select an image 3. User selects OK 4. The group/subgroup changes name 5. The access returns to the database main window 3.7.2.2 Alternative Data Flows 3.7.2.2.1 Alternative Data Flow 1 2. User leaves the group/subgroup name field empty 3. A message is appeared “Add a name for the group/subgroup” 3.7.2.2.2 Alternative Data Flow 2 3. User selects Cancel 4. The group/subgroup’s name remains the same 5. The access returns to main window","plantuml":"start\n\n:Open KeePass;\n:Select modify group/subgroup;\n\nif(Leave name field empty?) then(no)\n:Type new name;\n:Have option to select image;\n\nswitch(Selection)\ncase(OK)\n:Group/Subgroup changes name;\n:Return to database main window;\ncase(Cancel)\n:Name remains the same;\n:Return to main window;\nendswitch\n\nelse(yes)\n:“Add a name for the group/subgroup” appears;\nendif\n\nstop"}
{"content":"1. User opens KeePass and selects a group/subgroup 2. User selects to delete the group/subgroup 3. A message is appeared to confirm the delete 4. User selects yes 5. The group/subgroup is deleted 6. The main window opens 3.8.2.2 Alternative Data Flows 3.8.2.2.1 Alternative Data Flow 1 4. User selects no 5. The group/subgroup is not deleted","plantuml":"start\n\n:Open KeePass;\n:Select group/subgroup;\n\n:Select to delete group/subgroup;\n:Message is appeared to confirm;\n\nswitch(Selection)\ncase(yes)\n:Group/Subgroup is deleted;\n:Main window opens;\ncase(no)\n:Group/Subgroup is not deleted;\nendswitch\n\nstop"}
{"content":"1. User opens KeePass and selects to find something in a selected group/subgroup 2. User types the word to search for 3. User selects the fields which will be searched 4. User selects OK 5. Results appears at the database main window 3.9.2.2 Alternative Data Flows 3.9.2.2.1 Alternative Data Flow 1 2a. User leaves the find field empty 5. All data from the group/subgroup appear 3.9.2.2.2 Alternative Data Flow 2 3. User leaves all search in boxes unchecked 5. Nothing appears in the main window 3.9.2.2.3 Alternative Data Flow 3 4. User selects cancel 5. The main window appears 3.9.2.2.4 Alternative Data Flow 4 2. User leaves the find field empty 3. User leaves all search in boxes unchecked 5. Nothing appears in the main window","plantuml":"start\n\n:Open KeePass;\n:Select to find something;\n\nif(Leave find field empty?) then(yes)\nif(Leave search unchecked?) then(no)\n:All data appear;\nelse(yes)\n:Nothing appears;\nendif\n\nelse(no)\n:Type word to search for;\n\nif(Leave search unchecked?) then(no)\n:Select fields;\nswitch(Selection)\ncase(OK)\n:Results appears;\ncase(Cancel)\n:Main window appears;\nendswitch\n\nelse(yes)\n:Nothing appears;\nendif\n\nendif\n\nstop"}
{"content":"1. User opens KeePass and selects to add an entry 2. User fills in the form, as many fields as he wants, from 1 to 9 3. User selects OK 5. The new entry is added in the selected group 3.10.2.2 Alternative Data Flows 3.10.2.2.1 Alternative Data Flow 1 2a. User fills in the password field 2b. The repeat password field is not identical with the password field 2c. A message appears “the repeated password must be identical with the password 3.10.2.2.2 Alternative Data Flow 2 2a. User leaves all fields empty 3.10.2.2.3 Alternative Data Flow 3 3. User selects help 4. The help file or URL field features or Autotype is opened 3.10.2.2.4 Alternative Data Flow 4 3. User selects cancel 4. The main window opens","plantuml":"start\n\n:Open KeePass;\n:Select to add an entry;\n\nif(Leave all fields empty?) then(no)\n:Fill 1-9 fields as needed;\n\nif(Fills in password field?) then(yes)\n:Repeat password field is not identical;\n:“the repeated password must be identical with the password” appears;\nelse(no)\nendif\n\nswitch(Selection)\ncase(OK)\n:New entry is added;\ncase(Help)\n:Help file/URL field features/Autotype is opened;\ncase(Cancel)\n:Main window opens;\nendswitch\n\nelse(no)\nendif\n\nstop"}
{"content":"1. User opens KeePass and selects to view/edit an existing entry 2. User changes the fields he wants in the form 3. User selects OK 5. The modified entry is saved in the selected group 3.11.2.2 Alternative Data Flows 3.11.2.2.1 Alternative Data Flow 1 2a. User changes the password field 2b. The repeat password field is not identical with the password field 2c. A message appears “the repeated password must be identical with the password 3.11.2.2.2 Alternative Data Flow 2 3. User selects help 4. The help file or URL field features or Autotype is opened 3.11.2.2.3 Alternative Data Flow 3 3. User selects cancel 4. The main window opens and the selected entry is not modified","plantuml":"start\n\n:Open KeePass;\n:Select to view/edit an existing entry;\n:Change fields as needed;\n\nif(Change password field?) then(yes)\n:Repeat password field is not identical;\n:“the repeated password must be identical with the password” appears;\nelse(no)\nendif\n\nswitch(Selection)\ncase(OK)\n:Modified entry is saved;\ncase(Help)\n:Help file/URL field features/Autotype is opened;\ncase(Cancel)\n:Main window opens;\n:Selected entry is not modified;\nendswitch\n\nstop"}
{"content":". Each CDN Web server publishes resource and service information. 2. If it is a new resource, its service information is registered in the SR with a new resource ID. Resource ID counter is incremented. 3. Else, resource information in SR is updated in a regular basis. 4. In the face of traffic surges, information on available local resources along with their IDs is supplied to the Mediator. 5. Local and delegated external resource information is encapsulated in the SR instance in the established peering arrangement.","plantuml":"start\n\n:Each CDN Web server publishes information;\nfork\n:Resource;\nfork again\n:Service;\nend fork\n\nif(New resource?) then(yes)\n:Service information is registered;\n:Resource ID counter is incremented;\nelse(no)\n:Information in SR is updated regularly;\nendif\n\nif(Traffic surges?) then(yes)\n:Supply to Mediator;\nfork\n:Available local resources information;\nfork again\n:IDs;\nend fork\nelse(no)\nendif\n\n:In established peering arrangement;\n:Local and delegated external resource information is encapsulated;\n\nstop"}
{"content":"1. End users request for content from CDN WSs. 2. Flash crowds occurred due to a sudden burst in traffic. 3. Hotspot is generated and provider is unable to handle excess load on its WSs. 4. WS sends initialization request to the mediator to trigger peering.","plantuml":"start\n\n:Request for CDN WSs content;\n:Sudden burst in traffic;\n:Flash crowds occurred;\n\n:Hotspot is generated;\n:Unable to handle excess load;\n\n:WS sends initialization request to mediator;\n:Trigger peering;\n\nstop"}
{"content":"1. An initialization request to activate peering is received by the mediator. 2. The mediator instance obtains resource and access information from the SR and policy information from PR to establish negotiation. 3. The mediator generates service requirements. 4. If the service requirements are acceptable according to the provider’s policy, mediator passes it to the local PA. 5. Else, reject user requests.","plantuml":"start\n\n:Receive initialization request to activate peering;\n\n:Obtain information;\nfork\n:SR resource;\nfork again\n:SR access information;\nfork again\n:PR policy information;\nend fork\n\n:Establish negotiation;\n\n:Generate service requirements;\n\nif(Service requirements are acceptable) then(yes)\n:Pass it to local;\nelse(no)\n:Reject user requests;\nendif\n\nstop"}
{"content":"1. Local PA receives service requirements from the mediator. 2. If any peering policies exist, they are returned to establish long-term peering arrangement. 3. Else, short-term negotiation is performed. 4. Local PA in conjunction with the mediator interacts with external PAs through inter-PA communication protocol. 5. External resources are discovered and negotiation is performed with selected CDN peers. 6. If sufficient resources are acquired, a peering arrangement is established 7. Else, mediator re-evaluates service requirements and sends to the local PA to perform re-negotiation.","plantuml":"start\n\n:Receive service requirements from mediator;\nif(Peering policies?) then(yes)\n:Return them;\n:Establish long-term peering arrangement;\nelse(no)\n:Perform short-term negotiation;\nendif\n\n:Local PA and mediator interacts with external PAs;\n:External resources are discovered;\n:Negotiation is performed with selected CDN peers;\n\nif(Acquire sufficient resources?) then(yes)\n:Peering arrangement is established;\nelse(no)\n:Mediator re-evaluates service requirements;\n:Send to local PA;\n:Perform re-negotiation;\nendif\n\nstop"}
{"content":"1. Once a peering arrangement is established, the initiating primary CDN through its local PA advertise configuration information to technically support the negotiated relationships between enlisted CDNs. 2. PAs exchange content availability and load information to identify an optimal peer to handle user requests. 3. Request is redirected to an optimal peer’s Web server. 4. PAs exchange accounting information to perform billing based on negotiated relationships. 5. The policy repository instance in the established peering arrangement assists in the deployment, administration and enforcement of the functional policies.","plantuml":"start\n\n:Peering arrangement is established;\n:Initiating primary CDN advertise configuration information;\n:Support relationships between enlisted CDNs;\n\n:PAs exchange;\nfork\n:Content availability;\nfork again\n:Load information;\nend fork\n\n:Identify optimal peer to handle requests;\n:Request is redirected to optimal peer's Web server;\n:PAs exchange accounting information;\n:Perform billing;\n\n:Established policy repository instance assists;\nfork\n:Deployment;\nfork again\n:Administration;\nfork again\n:Enforcement;\nend fork\n\nstop"}
{"content":"The user launches the tool by double-clicking the icon associated with the tool or typing the application’s name. 2. The tool momentarily displays a splash screen identifying the tool, identifying developing and sponsoring organizations as appropriate, and listing copyright information. 3. The tool displays the main window of the tool. 4. The user starts the diagnostic processing by selecting a menu item named “Start Diagnostics” from a drop down menu named “Status”. 5. Include (Authenticate User). If the user has the appropriate privilege (i.e., the user is the administrator user) the tool requests a confirmatory response from the user to start the diagnostic processing. 6. If the user confirms the desire to start diagnostic processing, the tool starts the processing and displays an animated indication that diagnostic processing is active. 7. If the user responds negatively to the confirmation, the tool does not start the diagnostic processing but the user remains authenticated. 8. If the user does not have the appropriate privilege, the tool does not start the diagnostic processing. 9. The user secures the tool by selecting a menu item named “Logout” from the drop down menu named “File”. 10. The tool returns the current user’s privileges to those of the general user. 11. If a period of 15 minutes elapses whereby the user does not secure the tool, the users privileges will automatically revert to those of a general user.","plantuml":"start\n\n:Launch tool;\n\nif(Double-click relative icon?) then(no)\n:Type application's name;\nelse(yes)\nendif\n\n:Display splash screen momentarily;\nfork\n:Tool;\nfork again\n:Developing organizations;\nfork again\n:Sponsoring organizations;\nfork again\n:Copyright information;\nend fork\n\n:Display tool main window;\n:Open drop down menu “Status”;\n:Select menu item named “Start Diagnostics”;\n:Start diagnostic processing;\n\nif(User has appropriate privilege?) then(yes)\n:Request user confirmatory response;\nif(Confirm?) then(yes)\n:Start diagnostic processing;\n:Display animated indication;\nelse(no)\n:Do not start diagnostic processing;\n:User remains authenticated;\nendif\n\nelse(no)\n:Do not start diagnostic processing;\nendif\n\n:Open drop down menu named “File”;\n:Select menu item named “Logout”;\n:Secure tool;\n\n:Return user's privileges to general;\n\nif(User does not secure >= 15mins?) then(yes)\n:Privileges revert to general;\nelse(no)\nendif\n\nstop"}
{"content":"1. The user can stop diagnostic processing at any time after the diagnostic processing has started by selecting the “Stop Diagnostics” menu item from the main menu entitled “Status”. 2. If the user is not authenticated as the administrator user, include (Authenticate User) to validate privileges for stopping diagnostic processing. 3. If the user has the appropriate privilege, the tool requests confirmation to stop diagnostic processing. 4. If the user responds positively to the confirmation, the tool stops diagnostic processing and indicates the stopped condition. Otherwise the software performs no function but the user remains authenticated. 5. If the user selects the “Exit” menu item from the main menu entitled “File” and the diagnostic processing is not active, the tool exits. 6. If the user selects “Exit” and the diagnostic processing is active, include (Authenticate User), if the user is not already validated, to verify the user’s privilege to stop diagnostic processing. 7. If the user is permitted to stop diagnostic processing, the tool stops the processing and exits. Otherwise, the software performs no function.","plantuml":"start\n\n:Start diagnostic processing; \nif(Stop?) then(yes)\n:Open main menu “Status”;\n:Select “Stop Diagnostics” menu item;\n\nif(Authenticated as administrator user?) then(no)\n:Include to validate privileges;\nelse(yes)\n:Request confirmation;\n:Stop diagnostic processing;\n\nif(Responds positively?) then(yes)\n:Stop diagnostic processing;\n:Indicates stopped condition;\nelse(no)\n:Perform no function;\n:User remains authenticated;\nendif\nendif\nelse(no)\nendif\n\nif(Select “Exit” from “File”?) then(yes)\n if(Diagnostic processing is active?) then(no)\n  :Tool exits;\n else(yes)\n  if(User is validated?) then(no)\n  :Verify privilege to stop processing;\n  else(yes)\n  endif\n endif\nelse(no)\nendif\n\nif(Permitted to stop processing?) then(yes)\n:Stop diagnostic processing;\n:Exit;\nelse(no)\n:Perform no function;\nendif\n\nstop"}
{"content":"1. The tool displays the main (initial) window, listing buildings under diagnosis. 2. The user selects a building of interest. 3. The tool displays the subsystems window, tiled on top the main (initial) window. 4. The user selects a subsystem of interest. 5. The tool displays the condition window, tiled on top the subsystems window. 6. The user selects a diagnostic of interest. 7. The tool displays the diagnostic information window for that diagnostic.","plantuml":"start\n\n:Display main (initial) window;\n:List buildings under diagnosis;\n\n:Select interested building;\n:Display subsystems window;\n\n:Select interested subsystem;\n:Display condition window;\n\n:Select interested diagnostic;\n:Display diagnostic information window;\n\nstop"}
{"content":"1. At any window except the initial window, the user may click the “Back” button to dismiss the current window and re-establish the previous window as the current window. The user may then make a new selection. 2. The user may click a button labeled “Print” on the diagnostic information window to print an image of the window. 3. The tool displays a window listing possible items to print including the diagnostic information window. 4. The user selects the diagnostic information window and clicks the “OK” button to print the window.","plantuml":"start\n\nif(Dismiss current window?) then(yes)\nif(Initial window?) then(yes)\n:Not allowed;\nelse(no)\n:Re-establish previous window as current window;\n:Make new selection;\nendif\nelse(no)\nendif\n\nif(Print window image?) then(yes)\n:Click “Print”;\n:Display window listing possible items to print;\n:Select diagnostic information window;\n:Click “OK” ;\n:Print window;\nelse(no)\nendif\n\nstop"}
{"content":"1. The user clicks the “History” button. 2. The tool displays the diagnostic history window depicting the historical results of the selected condition of interest over the default viewing period in the form of a color map. The window provides a scroll bar for scrolling through historical results if data are available prior to the default viewing period. The default viewing period extends backward one week prior to the current date. Sliding the scroll bar does not change the viewing period displayed. The default time resolution for the window is one hour. 3. The user slides the scroll bar backward or forward to view previous results up to the current time. 4. The tool displays the results within a viewing period of one week, adding results to the beginning or ending of the period while dropping results of the opposite end. The tool does not change the viewing period. 5. The user may close the diagnostic history window by clicking the “Close” button. 6. The tool dismisses the diagnostic history window and the diagnostic information window and makes the condition window the current window.","plantuml":"start\n\n:Click “History” button;\n:Display history window by color map;\n:Show historical results of interested selected condition;\n\nif(Data are available prior to default period?) then(yes)\n:Provide scroll bar for historical results;\n:Default period extends backward 1 week prior to current date;\n:Displayed period do not change;\n:Default time resolution is 1h;\n:Slide scroll bar backward or forward;\n:View previous results up to current time;\nelse(no)\nendif\n\n:Tool function;\nfork\n:Display results within 1 week viewing period;\nfork again\n:Add results to period beginning/ending;\nfork again\n:Drop opposite end results;\nfork again\n:Viewing period do not change;\nend fork\n\nif(Close history window?) then(yes)\n:Click “Close” button;\n:Dismiss;\nfork\n:History window;\nfork again\n:Diagnostic information window;\nend fork \n\n:Make condition window current window;\nelse(no)\nendif\n\nstop"}
{"content":"1. The user selects a period of time within the displayed viewing period over which to expand or contract in time. 2. The tool expands or contracts the selected period. If expanding, the selected period becomes the new viewing period. If contracting, the new viewing period becomes twice as long as the selected period and encloses it.","plantuml":"start\n\n:Selects period within displayed period; \n\nswitch(Operation)\ncase(Expand)\n:Selected period becomes new viewing period;\ncase(Contract)\n:New viewing period becomes twice;\n:Encloses selected period;\nendswitch\n\nstop"}
{"content":"1. The user double-clicks a cell in the history window. 2. The tool dismisses the current diagnostic information window if displayed. After a noticeable delay of approximately one second, the tool displays the diagnostic information window associated with the cell selected.","plantuml":"start\n\n:Double-clicks cell in history window;\n\nif(Display current window?) then(yes)\n:Dismiss it;\nelse(no)\nendif\n\n:Noticeable delay of approximately 1s;\n:Display associated diagnostic information window;\n\nstop"}
{"content":"1. The user specifies a start time and end time for an historical interval of interest using calendar controls. 2. The tool displays historical results beginning with the first result on or after the specified start time up to the end time. The view is confined to the previously selected viewing period.","plantuml":"start\n\n:Use calendar controls;\n\n:Specify for interested historical interval;\nfork\n:Start time;\nfork again\n:End time;\nend fork\n\n:Display historical results;\n:From first result/specified start time to end time;\n:View is confined to selected period;\n\nstop"}
{"content":"1. At the diagnostic information window, the user may click the “Close” button to dismiss the window and make the condition window the current window if the diagnostic history window is not displayed. 2. If the user attempts to close the diagnostic information window and the diagnostic history window is still displayed, the diagnostic information window is dismissed but the diagnostic history window remains. 3. If the condition window is closed, then both the diagnostic information and diagnostic history windows are closed if open. 4. If the user does not specify an end time for the history interval in 3.1.3.2.4.1 Browsing Arbitrary History Intervals (1), it defaults to the current time.","plantuml":"start\n\n:At information window;\nif(Display diagnostic history window?) then(no)\n:Click “Close” button;\n:Dismiss information window;\n:Make condition window current window;\nelse(yes)\nendif\n\nif(Close information window?) then(yes)\n if(History window is displayed?) then(yes)\n  :Information window is dismissed;\n  :History window remains;\n else(no)\n endif\nelse(no)\nendif\n\nif(Condition window is closed?) then(yes)\n:Close if open;\nfork\n:Information window;\nfork again\n:History window;\nend fork\nelse(no)\nendif\n\n:In Browsing Arbitrary History Intervals;\nif(Specify history interval end time?) then(no)\n:Default to current time;\nelse(yes)\nendif\n\nstop"}
{"content":"1. When presented with the main window, the user may select the “Configure Diagnostics” menu item from the menu entitled “File”. 2. If the user has not already been authenticated as the administrator user, include (Authenticate User). 3. If the user has the appropriate privilege, the tool displays the configuration window. 4. The user may click the “Recall” button to read previously saved changes from a disk file or database. 5. The tool populates the window with the data from the disk file. 6. The user makes the desired changes to the configuration and can click the button labeled “Save” to save the changes. Otherwise, the user can click the button labeled “Close”. 7. If the user clicks the button labeled “Save”, the tool will request confirmation to save the changes. 8. If the user confirms, the tool will request a name for the disk file in which to save the modified data to permanent storage. 9. The user will enter a name for the file or cancel the operation. 10. If the user enters a name for the file, the tool will save the changes. If the user cancels the operation, the tool will perform no function. 11. If the tool completes the save operation, the tool will ask the user if the changes are to be relayed to the diagnostic processing for immediate use. 12. If the user confirms the changes are to be relayed to the diagnostic processing, the tool relays the changes if the processing is currently active. Otherwise, the tool does not relay the changes. 13. If the user clicks the button labeled “Close”, the tool will request confirmation for the close and the potential loss of any changes. 14. If the user confirms, the tool will dismiss the configuration window, ignoring any changes and returns the user to the main window. If the user rejects the initial desire to close, the tool will perform no function.","plantuml":"start\n\n:Presented with main window;\n:Open “File” menu;\n:Select “Configure Diagnostics” menu item;\n\nif(Administrator user?) then(no)\n:Include (Authenticate User);\nelse(yes)\nendif\n\nif(Have appropriate privilege?) then(yes)\n:Display configuration window;\nelse(no)\nendif\n\n:Click “Recall” button;\n:Read previously saved changes from disk file/database;\n:Populate window with disk file data;\n\nif(Change configuration?) then(yes)\n:Click “Save”;\n:Request confirmation;\nif(Confirm?) then(yes)\n:Request permanent storage disk file name;\nswitch(Operation)\ncase(Enter name)\n:Save changes;\n\n:Complete save operation;\n\n:Ask if relay changes to diagnostic processing for immediate use;\n\nif(Confirm relay?) then(yes)\n if(Processing is active?) then(yes)\n  :Relay changes;\n else(no)\n  :Do not relay changes;\n endif\nelse(no)\nendif\n\ncase(Cancel)\n:Perform no function;\nendswitch\nelse(no)\nendif\n\n\nelse(no)\n:Click “Close”;\n:Request confirmation;\n\nfork\n:For close;\nfork again\n:For potential loss of changes;\nend fork\n\nif(Confirm?) then(yes)\nfork\n:Dismiss configuration window;\nfork again\n:Ignore any changes;\nfork again\n:Return main window;\nend fork\n\nelse(no)\n:Perform no function;\nendif\n\nendif\n\nstop"}
{"content":"1. The tool displays a window for entry of authenticating information, i.e., user name and password, to validate and establish the privileges of the user. 2. The user enters their user name and password. 3. The tool attempts to authenticate the user and indicates whether authentication has succeeded or not. 4. If authentication is unsuccessful, the user is returned to the authentication window to reenter the information. 5. The tool permits three attempts at authentication before dismissing the authentication window and returning the user to the previous window. 6. The user may cancel the authentication process at any time and return to the previous window.","plantuml":"start\n\n:Display window;\n:Cancel and return is allowed at any time;\n\nwhile(Attempt count <= 3?) is(yes)\n\n:Enter authenticating information;\n\nfork\n:User name;\nfork again\n:Password;\nend fork\n\n:Validate and establish user privilege;\n:Authenticate user;\n\nif(Successful?) then(yes)\n:Indicate authentication has succeeded;\nstop\nelse(no)\n:Indicate authentication has not succeeded;\n\nif(Another attempt?) then(no)\nstop\nelse(yes)\n:Attempt count + 1;\nendif\nendif\n\nendwhile(no)\n\n:Dismissing authentication window;\n:Return to previous window;\n\nstop"}
{"content":"Block Selection Input: Left-click on a block. Processing: Change game state to \"Block displacement\". Output: None.","plantuml":"start\n\n:Left-click on block；\n:Change game state to \"Block displacement\";\n\nstop"}
{"content":"Block Deselection Input: Left-click up on a selected block. Processing: Change game state to \"Block selection\". Output: None.","plantuml":"start\n\n:Left-click up on selected block；\n:Change game state to \"Block selection\";\n\nstop"}
{"content":"Block Movement Input: Mouse movement during \"Block displacement\" state. Processing: Selected block follows mouse without overlapping others or exiting the game zone. Output: None.","plantuml":"start\n\n:During \"Block displacement\" state;\n:Mouse movement result;\nfork\n:Selected block follows mouse;\nfork again\n:Do not overlap others;\nfork again\n:Do not exit game zone;\nend fork\n\nstop"}
{"content":"Undo Action Input: Menu selection. Processing: Revert block positions to their state before the last movement. Output: Update game board display.","plantuml":"start\n\n:Menu selection;\n:Revert positions to last movement state;\n:Update game board display;\n\nstop"}
{"content":"Redo Action Input: Menu selection. Processing: Restore block positions to their state after the last undo. Output: Update game board display.","plantuml":"start\n\n:Menu selection;\n:Restore positions to last undo state;\n:Update game board display;\n\nstop"}
{"content":"End of Game Detection Input: Large square moved to the bottom of the board. Processing: Freeze player statistics. Output: Display \"Finish Window with Statistics\" or \"Simple Finish Window\" based on performance.","plantuml":"start\n\n:Large square move to board bottom;\n:Freeze player statistics;\n:Analyse performance;\n:Display \"Finish Window with Statistics\"/\"Simple Finish Window\";\n\nstop"}
{"content":"Finish Window with Statistics Input: Player clicks \"OK\" after entering name. Processing: Record player statistics in the file. Output: Close window and display statistics.","plantuml":"start\n\n:Enter name;\n:Click \"OK\";\n:Record player statistics in file;\n\nfork\n:Close window;\nfork again\n:Display statistics;\nend fork\n\nstop"}
{"content":"Simple Finish Window Input: Player clicks \"OK\". Processing: None. Output: Close window and display statistics.","plantuml":"start\n\n:Click \"OK\";\n\nfork\n:Close window;\nfork again\n:Display statistics;\nend fork\n\nstop"}
{"content":"Open Game Input: Menu selection. Processing: Load game data from a file. Output: Redraw board and set player statistics.","plantuml":"start\n\n:Menu selection;\n:Load game data from file;\n\nfork\n:Redraw board;\nfork again\n:Set player statistics;\nend fork\n\nstop"}
{"content":"Save Game Input: Menu selection. Processing: Save current game data to a file. Output: None.","plantuml":"start\n\n:Menu selection;\n:Save current game data to file;\n\nstop"}
{"content":"Exit Game Input: Menu selection. Processing: Prompt to save if unsaved, then close the game. Output: Close main window.","plantuml":"start\n\n:Menu selection;\n\nif(Saved?) then(no)\n:Prompt to save;\nelse(yes)\nendif\n\n:Close game;\n:Close main window;\n\nstop"}
{"content":"Migration Tool Execution: Use the command arc_warc_migrate <ARC_FILES> <CONFIG> [options] to migrate content from ARC files to WARC files based on the provided configuration. Ensure the configuration file specifies how fields are translated into WARC records, and handle missing fields by generating errors requiring operator intervention.","plantuml":"start\n\n:Use command arc_warc_migrate <ARC_FILES> <CONFIG> [options];\n:Refer to provided configuration;\n\nfork\n:Specify how fields are translated into WARC records;\nfork again\n:Generate errors requiring operator intervention;\n:Handle missing fields;\nend fork\n\n:Migrate content from ARC files to WARC files;\n\nstop"}
{"content":"Validation Tool Execution: Use the command arc_warc_verify <ARCFILE> <WARCFILE> <USER_DEFINED_ARG_READER> [options] to validate the migration. Compare checksums of records in ARC and WARC files, and optionally sample a random percentage of records for rapid verification.","plantuml":"start\n\n:Use command arc_warc_verify <ARCFILE> <WARCFILE> <USER_DEFINED_ARG_READER> [options];\n:Validate migration rapidly;\n\nfork\n:Compare ARC and WARC records checksums;\nfork again\n:Optionally sample random records percentage;\nend fork\n\nstop"}
{"content":"Repackaging Tool Execution: Use the command warc_repackage -i <WARC_FILE> <WARC_PATTERN> [options] to extract and repackage WARC records based on filters like URL, MIME-Types, size, or timestamp. Specify output WARC file names using the provided pattern and include metadata records describing the extraction context.","plantuml":"start\n\n:Use command warc_repackage -i <WARC_FILE> <WARC_PATTERN> [options];\n\n:Filters;\nfork\n:URL;\nfork again\n:MIME-Types;\nfork again\n:Size;\nfork again\n:Timestamp;\nend fork\n\n:Extract and repackage WARC records;\nfork\n:Use provided pattern;\n:Specify output WARC file names;\nfork again\n:Include metadata records describing extraction context;\nend fork\n\nstop"}
{"content":"Reporting Tool Execution: Use the command warc_summary <WARC_FILES> [options] to generate reports on WARC file content, such as summaries, MIME-type breakdowns, or hostname reports. Export reports in formats like XML or CSV and apply filters to restrict reports by time ranges or domains.","plantuml":"start\n\n:Use command warc_summary <WARC_FILES> [options];\n\n:Refer to WARC file content;\nfork\n:Summaries;\nfork again\n:MIME-type breakdowns;\nfork again\n:Hostname reports;\nend fork\n\n:Generate reports;\nfork\n:Export reports in formats like XML/CSV;\nfork again\n:Apply filters;\n:Restrict reports by time ranges/domains;\nend fork\n\nstop"}
{"content":"Quality Assurance Comparison: Use the command warc_compare <CRAWL_1_WARC_FILES> ... <CRAWL_N_WARC_FILES> [options] to compare crawls in WARC files. Generate delta reports showing percentage changes and lists of changed pages, with options to filter by URL patterns or metadata.","plantuml":"start\n\n:Use command warc_compare <CRAWL_1_WARC_FILES> ... <CRAWL_N_WARC_FILES> [options];\n\n:Compare crawls in WARC files;\n:Generate delta reports;\n\nfork\n:Percentage changes;\nfork again\n:Lists of changed pages;\nfork again\n:Options to filter by URL patterns/metadata;\nend fork\n\nstop"}
{"content":"Enhanced WARC Browser Integration: Integrate the warc_summary and warc_browser tools to display aggregated summaries and manifests of WARC files in the browser UI. Enable full-text search capabilities by updating and integrating the Search Tools project with the WARC Browser.","plantuml":"start\n\n:Integrate tools;\n\nfork\n:Warc_summary;\nfork again\n:Warc_browser;\nend fork\n\n:Display in browser UI;\nfork\n:Aggregated summaries;\nfork again\n:Manifests of WARC files;\nend fork\n\n:Update and integrate Search Tools project with WARC Browser;\n:Enable full-text search capabilities;\n\nstop"}
