{"content":"Once the system starts up, it checks the vehicle's status value first.\n\nIf the status is greater than 9 but less than 28, or greater than 30 but 49 or less, the system sets the instantaneous driving mileage gradient to 0 and ends.\n\nFor a status of 28, 29, or 30, the system transitions to a new state and sets the instantaneous driving mileage to 10. After this state change, it performs additional checks:\n\n*   If the current stays between -Current Threshold A and Current Threshold A, the system sets the instantaneous driving mileage gradient to 0 and ends.\n*   If the vehicle speed exceeds the speed threshold (kph), the system enters a new state and resets the cumulative discharge distance to 0. Should the energy recovery mileage then exceed 1, it transitions to another state, resets the energy recovery mileage to 0, and ends.\n*   When the cumulative discharge distance is less than the energy recovery mileage, the system moves to a new state and sets the instantaneous driving mileage gradient to 0.\n*   If the vehicle speed is below the speed threshold (kph), the system enters a new state and uses call() to get the cumulative discharge distance. If this distance exceeds 0.1, it transitions to another state, calculates the gradient as (cumulative discharge distance × driving error correction coefficient ÷ 2), and ends.\n*   When the vehicle speed exceeds the speed threshold (kph), the system checks if the instantaneous discharge mileage exceeds the instantaneous driving mileage. If true, it transitions to a new state, sets the gradient to (instantaneous discharge mileage × error correction coefficient), and ends. If false, it enters another state, sets the gradient to (instantaneous driving mileage × error correction coefficient), and ends.","plantuml":"start\nswitch(initial judgement)\ncase (vehicle status > 9 and < 28) or (vehicle status > 30 and <= 49)\n  :set instantaneous driving mileage gradient to 0;\n  stop\ncase (vehicle status == 28 or 29 or 30)\n  :switch to new state;\n  :set instantaneous driving mileage to 10;\n  if (current > -Current Threshold A and < Current Threshold A) then\n    :set instantaneous driving mileage gradient to 0;\n    stop\n  else if (vehicle speed > speed threshold (kph)) then(yes)\n    :switch to new state;\n    :reset cumulative discharge distance to 0;\n    if (energy recovery mileage >1) then\n      :switch to new state;\n      :reset energy recovery mileage to 0;\n      stop\n    else\n      stop\n    end if\n  else if (cumulative discharge distance < energy recovery mileage) then\n    :switch to new state;\n    :set instantaneous driving mileage gradient to 0;\n    stop\n  else if (vehicle speed < speed threshold (kph)) then\n    :enter new state;\n    :query cumulative discharge distance;\n    if (cumulative discharge distance >0.1?) then(yes)\n      :switch to new state;\n      :set instantaneous driving mileage gradient = cumulative discharge distance * driving error correction coefficient /2;\n      stop\n    else \n      stop\n    end if\n  else(vehicle speed > speed threshold (kph))\n    if (instantaneous discharge mileage > instantaneous driving mileage?) then(yes)\n      :switch to new state;\n      :set instantaneous driving mileage gradient = instantaneous discharge mileage * error correction coefficient;\n      stop\n    else(no)\n      :switch to another state;\n      :set instantaneous driving mileage gradient = instantaneous driving mileage * error correction coefficient;\n      stop"}
{"content":"After the system starts up, the process begins by checking the gear position. If the gear is in D or N, the D_S gear mileage parameter is set to 1, and the sequence ends. If the gear is in S, the D_S gear mileage parameter is calculated as S gear nominal mileage divided by D gear nominal mileage, then the process concludes. Additionally, if the vehicle status is 30, switch to driving mode. Next, if the gear is in D or E, set the D_S gear mileage parameter to S gear nominal mileage divided by D gear nominal mileage, and end. Finally, if the gear is in N or R, observe using the D_S gear mileage parameter and terminate the process.","plantuml":"start\nif (gear is D or N) then\n  :set D_S gear mileage parameter to 1;\n  stop\nelse if (gear is S) then\n  :set D_S gear mileage parameter = S gear nominal mileage / D gear nominal mileage;\n  stop\nelse if (vehicle status is 30) then\n  :switch to driving mode;\n  switch(gear check)\n  case(gear is D or E)\n    :set D_S gear mileage parameter = S gear nominal mileage / D gear nominal mileage;\n    stop\n  case(gear is N or R)\n    :observe using D_S gear mileage parameter;\n    stop\n  endswitch\nendif  \nend"}
{"content":"After the system starts up, the following decision paths apply:\n\n1) When the remote flag is 1, the system enters state 28.\n   If the power battery discharge protection flag is 1 and SOC is 0, it switches to state 46.\n   Should the remote flag become 0, the system shuts down and ends.\n\n2) If the ignition switch is at position 2 and the front MCU initialization state is 0, the system switches to state 12.\n   When the discharge protection flag is 1 and front MCU initialization state is 1, it switches to state 46.\n   If the ignition switch changes to 0, the system shuts down and ends.\n\n3) When the ignition switch is at 2 and front MCU initialization state is 1, the system switches to state 20.\n   If the discharge protection flag is 1 and BMS self-check counter reaches 3, it switches to state 40.\n   Should the ignition switch become 0, the system shuts down, resets the BMS counter, and ends.\n\n4) If the ignition switch is at 2 and BMS self-check counter is 1, the system switches to state 23.\n   When the discharge protection flag is 1 and front MCU initialization state is 1, it switches to state 40.\n   If the ignition switch becomes 0, the system shuts down, resets the BMS counter, and ends.\n\nAdditionally:\n   If the ignition switch is at 2, the system switches to state 30.\n   When the power battery discharge protection flag is 1 and DCDC state is 1, it switches to state 35.\n   Should the ignition switch become 0, the system shuts down, resets the BMS counter, and ends.","plantuml":"start\nif (remote flag is 1) then\n  :enter state 28;\n  if (power battery discharge protection flag is 1 and SOC is 0) then\n    :switch to state 46;\n    if (remote flag becomes 0) then\n    :shutdown;\n    stop\n    end if\n  endif\n\nelse if (ignition switch is 2 and front MCU initialization state is 0) then\n    :switch to state 12;\n  if (discharge protection flag is 1 and front MCU initialization state is 1) then\n    :switch to state 46;\n    if (ignition switch becomes 0) then\n    :shutdown;\n    stop\n    end if\n  endif\nelse if (ignition switch is 2 and front MCU initialization state is 1) then\n    :switch to state 20;\n  if (discharge protection flag is 1 and BMS self-check counter is 3) then\n    :switch to state 40;\n    if (ignition switch becomes 0) then\n    :shutdown;\n    :reset BMS counter;\n    stop\n    end if\n  endif\n\nelse if (ignition switch is 2 and BMS self-check counter is 1) then\n    :switch to state 23;\n  if (discharge protection flag is 1 and front MCU initialization state is 1) then\n    :switch to state 40;\n   if (ignition switch becomes 0) then\n    :shutdown;\n    :reset BMS counter;\n    stop\n    end if\n  endif\nelse if (ignition switch is 2) then\n  :switch to state 30;\n  if (power battery discharge protection flag is 1 and DCDC state is 1) then\n  :switch to state 35;\n  if (ignition switch becomes 0) then\n  :shutdown;\n  :reset BMS counter;\n  stop\n  end if\nendif\nendif\nend"}
{"content":"After the system starts up:\n- If slow charging is active (state 1) and the charging/discharging system is powered up, switch to state 95.\n- If the vehicle charging/discharging mode is 2 and the system is powered up, switch to state 105. Then, while in state 105:\n  1) If the high-voltage shutdown value is 3 or 4, switch to state 115. If slow charging becomes inactive during this, shut down and end the process.\n  2) If a high-voltage shutdown request (value 3) occurs while the ignition is on (position 2), return to state 105. If the ignition turns off (position 0), switch to state 115. If slow charging becomes inactive, shut down and end.\n  3) If a pre-charge failure happens, switch to state 115. If slow charging becomes inactive, shut down and end.\n  4) If an AC discharge system fault occurs, switch to state 115. If slow charging becomes inactive, shut down and end.\n  5) If slow charging becomes inactive, switch to state 115, then shut down and end.","plantuml":"start\nif (slow charging state is 1 and charging/discharging power-up is ready) then\n  :switch to state 95;\n if (vehicle charging/discharging mode is 2 and power-up is ready) then\n  :switch to state 105;\n  switch(condition judgement) \n  case (high-voltage shutdown charging/discharging value is 3 or 4)\n    :switch to state 115;\n     if (slow charging?) then(no)\n     :shutdown;\n     stop\n     end if\n  case (high-voltage shutdown request is 3 and ignition switch is 2)\n    :switch to state 105;\n    if(ignition switch becomes 0) then\n    :switch to state 115;\n     if (slow charging?) then(no)\n          :shutdown;\n     stop\n     end if\n    end if\n  case (pre-charge failure occurs)\n    :switch to state 115;\n    if (slow charging?) then(no)\n         :shut down;\n     stop\n     end if\n  case (AC discharge system fault occurs)\n    :switch to state 115;\n    if (slow charging?) then(no)\n         :shutdown;\n     stop\n     end if\n  case (slow charging is inactive)\n   :switch to state 115;\n    if (slow charging?) then(no)\n         :shutdown;\n     stop\n     end if\n  endswitch\n  end if\n  end if\n  end"}
{"content":"After the system starts up:\n- If slow charging is active and the front MCU high-voltage detection flag is 0, transition to state 93.\n- If charging/discharging power-up is active while the front MCU high-voltage detection flag reads 1, move to state 95.\n- When power-up readiness is confirmed and the vehicle's charging/discharging mode is set to 2, proceed to state 105.\n\nThen handle these cases:\n1. In remote mode: Go to state 105. If slow charging becomes inactive, shift to state 28. Should remote mode deactivate, initiate shutdown and terminate.\n2. Upon receiving a pet mode request: Enter state 105. If slow charging is inactive, transition to state 28. After processing the pet mode request, perform shutdown and end operations.\n3. When battery SOC hits 20%: Transition to state 105. If slow charging is inactive, switch to state 28. If SOC reaches 80% while DCDC state is 3, execute shutdown and conclude.","plantuml":"start\nif (slow charging is 1 and front MCU high-voltage detection flag is 0) then(yes)\n  :switch to state 93;\n if (charging/discharging power-up is active and front MCU high-voltage detection flag is 1) then(yes)\n  :switch to state 95;\n  if (power-up is ready and vehicle charging/discharging mode is 2) then(yes)\n  :switch to state 105;\n\nswitch(condition judgement)\n  case(in remote mode)\n    :switch to state 105;\n    if (slow charging is inactive) then\n      :switch to state 28;\n      if (remote mode is closed) then\n          :shutdown;\n      stop\n      endif\n    endif\n\n  case (pet mode request is received)\n    :switch to state 105;\n     if (slow charging is inactive) then\n      :switch to state 28;\n      if (pet mode open request is closed) then\n          :shutdown;\n      stop\n      endif\n    endif\n\n  case (battery SOC is 20) \n    :switch to state 105;\n    if (SOC reaches 80 and DCDC state is 3) then\n    :shutdown;\n    stop\n    endif\nendswitch\n\n  endif\nendif\nendif\nend"}
{"content":"After the system starts up: If slow charging is active, go into power-up mode. Then:\n1.  If remote mode is enabled, enter state 110. Then, if slow charging becomes inactive, go to state 28. Finally, if remote mode is disabled, shut down and end.\n2.  If a pet mode request comes in, switch to state 110. Then, if slow charging is inactive, move to state 28. Once the pet mode request is handled, shut down and end.\n3.  If the battery SOC is 20, enter state 110. Then, if slow charging is inactive, switch to state 28. If the SOC later reaches 80 and the DCDC state is 3, shut down and end.","plantuml":"start\nif (slow charging is active) then(yes)\n  :enter power-up mode;\n  switch(condition judgement)\n  case (remote mode is enabled)\n    :switch to state 110;\n    if (slow charging is inactive) then\n      :switch to state 28;\n      if (remote mode is disabled) then\n      :shutdown;\n      stop\n      endif\n    endif\n\n  case (pet mode request is received)\n    :switch to state 110;\n    if (slow charging is inactive) then\n      :switch to state 28;\n      if (pet mode request handling is finished) then\n      :shutdown;\n      stop\n      endif\n    endif\n\n  case (battery SOC is 20)\n    :switch to state 110;\n    if (slow charging is inactive) then\n      :switch to state 28;\n      if (battery SOC reaches 80 and DCDC state is 3) then\n      :shutdown;\n      stop\n      endif\n    endif\n    \n  endswitch\nelse(no)\n  stop\nendif\nend"}
{"content":"After the system starts up, if slow charging is active, we enter power-up mode. Then:\n\n1) When the high-voltage shutdown request (charging/discharging) flag is 2, switch to state 115. After switching:\n   a. If the flag drops to 0 with CP duty cycle at 85%, switch to state 126. If the BMS self-check counter shows 1, switch to state 130. If slow charging becomes inactive, shut down and end.\n   b. If the flag drops to 0 with CP duty cycle at 85%, switch to state 126. If battery pre-heating is required, switch to state 130. If slow charging becomes inactive, shut down and end.\n   c. If the flag drops to 0 while the BMS self-check counter is 1, switch to state 126. If CP duty cycle hits 85% with CP amplitude at 3000, switch to state 130. If slow charging becomes inactive, shut down and end.\n\n2) When the central control charging/discharging command is 2 and the vehicle isn't in charging/discharging mode, switch to state 110. Then:\n   - If the high-voltage shutdown request flag becomes 2, switch to state 115.\n   - If the flag drops to 0 with CP duty cycle at 88%, switch to state 126.\n   - If the central control command is 1 while charging state is 2, switch to state 130.\n   - If slow charging becomes inactive, shut down and end.","plantuml":"start\nif (slow charging is active) then(yes)\n  :enter power-up mode;\n  if (high-voltage shutdown request charging/discharging flag is 2) then(yes)\n    :switch to state 115;\n    if (flag becomes 0 and CP duty cycle is 85%) then(yes)\n      :switch to state 126;\n      if (BMS self-check counter is 1) then(yes)\n        :switch to state 130;\n        if (slow charging is inactive) then(yes)\n          :shutdown;\n          stop\n        endif\n      else if (battery pre-heating is required) then\n        :switch to state 130;\n        if (slow charging is inactive) then(yes)\n         :shutdown;\n         stop\n        endif\n      endif\n  \n    else if(flag becomes 0 and BMS self-check counter is 1)then\n    :switch to state 126;\n      if (CP duty cycle is 85% and CP amplitude is 3000) then(yes)\n        :switch to state 130;\n        if (slow charging is inactive) then(yes)\n          :shutdown;\n          stop\n        endif\n      endif\n    endif\n\n  else if(central control command is 2 and vehicle is not in charging/discharging mode)then\n    :switch to state 110;\n    if (flag becomes 2) then(yes)\n      :switch to state 115;\n      if(flag becomes 0 and CP duty cycle is 88%)then(yes)\n        :switch to state 126;\n        if(central control command is 2 and charging state is 2)then(yes)\n          :switch to state 130;\n          if (slow charging is inactive) then(yes)\n            :shutdown;\n            stop\n          endif\n        endif  \n      endif\n    endif\n    \n  endif\nendif\nend"}
{"content":"After the system starts up, if slow charging is active, we enter power-up mode. Then:\n\n1) When the high-voltage shutdown request (charging/discharging) flag is 2, switch to state 115. After switching:\n   a. If the flag drops to 0 with CP duty cycle at 85%, switch to state 126. If the BMS self-check counter shows 1, switch to state 130. If slow charging becomes inactive, shut down and end.\n   b. If the flag drops to 0 with CP duty cycle at 85%, switch to state 126. If battery pre-heating is required, switch to state 130. If slow charging becomes inactive, shut down and end.\n   c. If the flag drops to 0 while the BMS self-check counter is 1, switch to state 126. If CP duty cycle hits 85% with CP amplitude at 3000, switch to state 130. If slow charging becomes inactive, shut down and end.\n\n2) When the central control charging/discharging command is 2 and the vehicle isn't in charging/discharging mode, switch to state 110. Then:\n   - If the high-voltage shutdown request flag becomes 2, switch to state 115.\n   - If the flag drops to 0 with CP duty cycle at 88%, switch to state 126.\n   - If the central control command is 1 while charging state is 2, switch to state 130.\n   - If slow charging becomes inactive, shut down and end.","plantuml":"start\nif (slow charging is active) then\n  :enter power-up mode;\n  if (high-voltage shutdown request charging/discharging is 2 and BMS self-check counter is 0) then\n    :switch to state 127;\n    if (slow charging is inactive and front MCU collateral shutdown request flag is 1) then\n      :switch to state 128;\n      :shutdown;\n      stop\n    else if (slow charging is inactive) then\n      :issue 2.2s timeout warning;\n      :switch to state 128;\n      :enter shutdown state;\n      stop\n    else if (slow charging is inactive and BMS self-check counter is 1) then\n      :switch to state 128;\n      :shutdown;\n      stop\n    endif\n  endif\nendif\nend"}
{"content":"After the system starts up, if slow charging is active, it enters power-up mode. Then, if the high-voltage shutdown request (for charging or discharging) is set to 2, it switches to state 127. Once in state 127, the following actions apply based on conditions:\n\n1. If the ignition switch is at position 2 and the front MCU state remains unchanged, the system stays in state 127.\n   a. Should slow charging become inactive and a timeout of 2.2 seconds occur, it switches to state 12. If the ignition switch is off at this point, the system shuts down and ends.\n   b. Similarly, if slow charging is inactive and the BMS self-check counter reads 1, it switches to state 12. Again, if the ignition switch is off, shutdown occurs and the process ends.\n\n2. When the ignition switch is at position 2 and the onboard charger command is 1, it remains in state 127. However, if the command changes to 4, it switches to state 12. In cases where the ignition switch is off and slow charging is inactive, the system shuts down and ends.\n\n3. If remote mode is active and the front MCU state is unchanged, it stays in state 127. Should slow charging turn inactive, it transitions to state 12. But if remote mode is disabled, the system shuts down and ends.\n\n4. Upon receiving a pet mode request, it stays in state 127. If slow charging is inactive, it switches to state 12. After the pet mode request ends, the system shuts down and ends.\n\n5. When the battery SOC is at 20 and the front MCU state is unchanged, it remains in state 127. If slow charging becomes inactive, it switches to state 12. Should the SOC reach 100 and the DCDC state be at 2, the system shuts down and ends.","plantuml":"start\nif (slow charging is active) then\n  :enter power-up mode;\n  if (high-voltage shutdown request charging/discharging is 2) then\n    :switch to state 127;\n    switch(condition judgement)\n      case (ignition switch is 2 and front MCU state unchanged)\n        :stay in state 127;\n        if(slow charging is inactive and timeout 2.2s occurs)then(yes)\n          :switch to state 12;\n          if(ignition switch is off)then(yes)\n            :shutdown;\n            stop\n          endif\n        else if(slow charging is inactive and BMS self-check counter is 1)\n          :switch to state 12;\n          if(ignition switch is off)then(yes)\n            :shutdown;\n            stop\n          endif\n        endif\n      case (ignition switch is 2 and onboard charger command is 1)\n        :stay in state 127;\n        if(command becomes 4)then(yes)\n          :switch to state 12;\n          if(ignition switch is off and slow charging is inactive)then(yes)\n            :shutdown;\n            stop\n          endif\n        endif\n      case (remote mode is active and front MCU state unchanged)\n        :stay in state 127;\n        if (slow charging is inactive)then(yes)\n          :switch to state 12;\n          if (remote mode is disabled)then(yes)\n            :shutdown;\n            stop\n          endif\n        endif\n      case (pet mode request is received)\n        :stay in state 127;\n        if (slow charging is inactive)then(yes)\n          :switch to state 12;\n          if (pet request mode ends)then(yes)\n            :shutdown;\n            stop\n          endif\n        endif\n      case (battery SOC is 20 and front MCU state unchanged)\n        :stay in state 127;\n        if (slow charging is inactive)then(yes)\n          :switch to state 12;\n          if (SOC reaches 100 and DCDC state is 2)then(yes)\n            :shutdown;\n            stop\n          endif\n        endif\n    endswitch\n    endif\nendif\nend"}
{"content":"After the system starts up and slow charging is active, it enters power-up mode. Then, if the high-voltage shutdown request (for charging or discharging) is 2, the system moves to state 126 regardless of whether the BMS self-check counter is 0 or 1.\n\nWhile in state 126:\n- If fast charging becomes active and the front MCU initialization state is 0, it transitions to state 127.\n- Similarly, if the front MCU low-voltage shutdown flag is 0, it also transitions to state 127.\n- Additionally, the following checks occur:\n  1. If a 2.2-second timeout triggers, it switches to state 142. Should fast charging be inactive at this point, the system shuts down and ends.\n  2. If the BMS counter reads 0, it switches to state 142. Again, if fast charging is inactive, the system shuts down and ends.\n\nAfter entering state 127:\n- The system stays in state 127 while fast charging remains active and the front MCU initialization state is 0. Within this state:\n  a. If the front MCU low-voltage shutdown request flag is set to 1, it moves to state 142. If fast charging is then inactive, the system shuts down and ends.\n  b. If a 2.2-second timeout occurs, it moves to state 142. Should fast charging be inactive, the system shuts down and ends.","plantuml":"start\nif (slow charging is active) then(yes)\n  :enter power-up mode;\n  if (high-voltage shutdown request is 2 and BMS self-check counter is 1) then\n    :enter state 126;\n  else if (high-voltage shutdown request is 2 and BMS counter is 0) then\n    :enter state 126;\n  else\n    stop\n  endif\nelse\n  stop\nendif\nif (fast charging is active and front MCU initialization state is 0) then\n    :switch to state 127;\nelse if (front MCU low-voltage shutdown flag is 0) then(yes)\n    :switch state 127;\nelse\n  stop\nendif\nswitch (condition judgement)\n  case(timeout 2.2s occurs)\n    :switch to state 142;\n    if(fast charging is inactive)then(yes)\n      :shutdown;\n      stop\n    endif\n    stop\n  case(BMS counter is 0)\n    :switch to state 142;\n    if(fast charging is inactive)then(yes)\n      :shutdown;\n      stop\n    endif\n     stop\n  case(fast charging is active and front MCU initialization state is 0)\n    :stay in state 127;\n    if(front MCU low-voltage shutdown request flag is 1)then(yes)\n      :switch to state 142;\n      if(fast charging is inactive)then(yes)\n        :shutdown;\n        stop\n      endif\n    else if(timeout 2.2s occurs)then\n      :switch to state 142;\n      if(fast charging is inactive)then(yes)\n        :shutdown;\n        stop\n      endif\n    endif\nendswitch\nend"}
{"content":"After the system starts up, the following logic applies:\n\n1. If slow charging is active, the system enters the \"power-up\" state. Then:\n   a. When the AC charging system fault is 1, the system switches to state 127. If recharge demand is 1 and front MCU initialization state is 0, it enters state 82. Should slow charging become inactive at any point, the system shuts down and ends.\n   b. If a high-voltage shutdown request (for charging/discharging) is 2, the system switches to state 126. When recharge demand is 1 and the front MCU low-voltage shutdown flag is 0, it enters state 127. If the front MCU low-voltage flag becomes 1 or a 2.2-second timeout occurs, it switches to state 82. Should slow charging become inactive, the system shuts down and ends.\n   c. When a high-voltage shutdown request is 2 and the BMS counter is 2, the system switches to state 126. If recharge demand is 1 and front MCU initialization state is 0, it enters state 127. Should the BMS counter reach 0 or a 2.2-second timeout occur, it switches to state 82. If slow charging becomes inactive, the system shuts down and ends.\n\n2. When slow charging is active and charging/discharging power-up readiness is 3, the system enters state 105. If the AC discharge system fault is 1, it enters state 127. When recharge demand is 1 and the AC discharge system has no faults, it switches to state 82. Should slow charging become inactive, the system shuts down and ends.","plantuml":"start\nif (slow charging is active) then\n  :enter power-up mode;\n  if (AC charging system fault=1) then\n    :switch to state 127;\n    if(recharge demand=1 and front MCU initialization state=0)then(yes)\n      :switch to state 82;\n      if(slow charging is inactive)then(yes)\n        :shutdown;\n        stop\n      endif\n    endif\n  else if (high-voltage shutdown request charging/discharging is 2) then\n    :switch to state 126;\n    if(recharge demand=1 and front MCU low-voltage shutdown flag=0)then(yes)\n      :switch to state 127;\n      if(front MCU low-voltage flag=1 or timeout 2.2s occurs)then(yes)\n        :switch to state 82;\n        if(slow charging is inactive)then(yes)\n         :shutdown;\n         stop\n        endif\n      endif\n     endif\n  else if(high-voltage shutdown request charging/discharging is 2 and BMS counter=2)then\n    :switch to state 126;\n    if(recharge demand=1 and front MCU initialization state=0)then(yes)\n      :switch to state 127;\n      if(BMS counter=0 or timeout 2.2s occurs)then(yes)\n        :switch to state 82;\n        if(slow charging is inactive)then(yes)\n         :shutdown;\n         stop\n        endif\n      endif\n    endif\n  endif\nelse if(slow charging is active and charging/discharging power-up readiness=3)then\n  :switch to state 105;\n  if(AC discharge system fault=1)then(yes)\n    :switch to state 127;\n    if(recharge demand =1 and AC discharge system no fault)then(yes)\n      :switch to state 82;\n      if(slow charging is inactive)then(yes)\n        :shutdown;\n        stop\n      endif\n    endif\n  endif\nendif\nend"}
{"content":"After the system starts up:\n- If charging is active (charging=1) and the front MCU high-voltage detection flag is 0, transition to state 153.\n- If the BMS-fast charger handshake flag is 0 and the front MCU high-voltage flag is 0, enter state 155.\n\nWhile in state 155:\n1. If pre-charge failure occurs, move to state 175. If fast charging remains inactive after this, shut down and end the process.\n2. If a high-voltage shutdown request (for charging/discharging) is detected (value=2), wait 0.8 seconds before entering state 175. If fast charging is inactive afterward, shut down and end.\n3. If the ignition switch status is 2, remain in state 155. If a high-voltage shutdown request (value=2) exists during this, pause for 0.8 seconds. If the ignition switch reads 0, proceed to state 175. Should fast charging be inactive following these actions, shut down and end.\n4. If fast charging is inactive, immediately switch to state 175, shut down, and terminate the process.","plantuml":"start\nif (charging=1 and front MCU high-voltage detection flag=0) then(yes)\n  :switch to state 153;\n  if (BMS-fast charger handshake flag=0 and front MCU high-voltage flag=0) then(yes)\n    :enter state 155;\n    switch(condition judgement)\n    case (pre-charge failure occurs)\n      :switch to state 175;\n      if(fast charging is inactive)then(yes)\n        :shutdown;\n        stop\n      endif\n    case (high-voltage shutdown request charging/discharging =2)\n      :wait 0.8s;\n      :switch to state 175;\n      if(fast charging is inactive)then(yes)\n        :shutdown;\n        stop\n      endif\n    case (ignition switch=2)\n      :stay in state 155;\n      if (high-voltage shutdown request charging/discharging =2) then\n        :wait 0.8s;\n        if (ignition switch=0) then\n          :switch to state 175;\n          if(fast charging is inactive)then(yes)\n            :shutdown;\n            stop\n          endif\n        endif\n      endif\n    case (fast charging is inactive)\n      :switch to state 175;\n      :shutdown;\n      stop\n    endswitch\n  endif\nendif\nend"}
{"content":"After the system starts up: if fast charging is active and the BMS manual charging/discharging flag is 0, the system enters state 155. While in state 155:\n\n1. For DCDC state monitoring:\n   - If DCDC state remains 1, stay in state 155.\n   - If the BMS-fast charger handshake flag becomes 1, transition to state 156.\n   - If DCDC state is not 1 or 3 seconds pass, move to state 157.\n   - If fast charging becomes inactive at any point, shut down and end the process.\n\n2. For EAS state monitoring:\n   - If EAS state stays at 1, remain in state 155.\n   - If the handshake flag turns to 1, switch to state 156.\n   - If EAS state isn’t 1 or 3 seconds elapse, shift to state 157.\n   - Should fast charging deactivate, shut down and terminate.\n\n3. For power battery current monitoring:\n   - If current holds at 6.1, maintain state 155.\n   - If the handshake flag changes to 1, advance to state 156.\n   - If current drops below 6.1 or 3 seconds pass, proceed to state 157.\n   - If fast charging stops, shut down and end.\n\n4. For WTCH state monitoring (condition 1):\n   - If WTCH state is 1, continue in state 155.\n   - If the handshake flag sets to 1, change to state 156.\n   - If WTCH state isn’t 1, transition to state 157.\n   - Upon fast charging inactivity, shut down and exit.\n\n5. For WTCH state monitoring (condition 2):\n   - If WTCH state is 3, persist in state 155.\n   - If the handshake flag becomes 1, enter state 156.\n   - If WTCH state isn’t 1, switch to state 157.\n   - If fast charging deactivates, shut down and conclude.","plantuml":"start\nif (fast charging is active and BMS manual charging/discharging flag=0) then\n  :enter state 155;\n  switch(condtion judgement)\n  case(DCDC state=1)\n    :stay in state 155;\n    if(BMS-fast charger handshake flag=1)then(yes)\n      :switch to state 156;\n      if(DCDC state≠1 or 3s elapsed)then(yes)\n        :switch to state 157;\n        if(fast charging is inactive)then(yes)\n          :shutdown;\n          stop\n        endif\n      endif\n    endif\n  case(EAS state=1)\n    :stay in state 155;\n    if(BMS-fast charger handshake flag=1)then(yes)\n      :switch to state 156;\n      if(EAS state≠1 or 3s elapsed)then(yes)\n        :switch to state 157;\n        if(fast charging is inactive)then(yes)\n          :shutdown;\n          stop\n        endif\n      endif\n    endif\n  case(power battery current=6.1)\n    :stay in state 155;\n    if(BMS-fast charger handshake flag=1)then(yes)\n      :switch to state 156;\n      if(current<6.1 or 3s elapsed)then(yes)\n        :switch to state 157;\n        if(fast charging is inactive)then(yes)\n          :shutdown;\n          stop\n        endif\n      endif\n    endif\n  case(WTCH state=1)\n    :stay in state 155;\n    if(BMS-fast charger handshake flag=1)then(yes)\n      :switch to state 156;\n      if(WTCH state≠1)then(yes)\n        :switch to state 157;\n        if(fast charging is inactive)then(yes)\n          :shutdown;\n          stop\n        endif\n      endif\n    endif\n  case(WTCH state=3)\n    :stay in state 155;\n    if(BMS-fast charger handshake flag=1)then(yes)\n      :switch to state 156;\n      if(WTCH state≠1)then(yes)\n        :switch to state 157;\n        if(fast charging is inactive)then(yes)\n          :shutdown;\n          stop\n        endif\n      endif\n    endif\n  endswitch\nendif\nend"}
{"content":"After the system starts up, if fast charging is active, it enters the \"power-up\" state. Then, in this state: if the high-voltage shutdown request is 2 and the DCDC state is 1, the system enters state 175. If the DCDC state is 0 and power battery relay control is issued, it switches to state 185. If the request is not 2, it enters state 155. If fast charging is not active, the system shuts down and ends.\n\nAdditionally, if the high-voltage shutdown request is 2 and power battery relay control is issued, the system switches to state 185. Then: a) when the ignition switch is 2 and the request is 0, it switches to state 155; if the ignition switch is 0 and fast charging is inactive, it shuts down and ends. b) if slow charging is active and the request is 0, it switches to state 155; if both slow and fast charging are inactive, it shuts down and ends. c) if remote mode is enabled and the request is 0, it switches to state 155; if remote mode is disabled and fast charging is inactive, it shuts down and ends.","plantuml":"start\nif (fast charging is active) then\n  :enter power-up state;\n  if (high-voltage shutdown request=2 and DCDC state=1) then(yes)\n    :enter state 175;\n    if (DCDC state=0 and power battery relay control is issued) then(yes)\n      :switch to state 185;\n      if(high-voltage shutdown request≠2)then(yes)\n        :switch to state 155;\n        if (fast charging is inactive) then\n          :shutdown;\n          stop\n        endif\n      endif\n    endif\n  else if(high-voltage shutdown request=2 and power battery relay control is issued)then\n    :switch to 185;\n    switch(condition judgement)\n      case(ignition switch=2 and high-voltage shutdown request=0)\n        :switch to state 155;\n        if (ignition switch=0 and fast charging is inactive) then\n          :shutdown;\n          stop\n        endif\n      case(slow charging is active and high-voltage shutdown request=0)\n        :switch to state 155;\n        if (slow charging is inactive and fast charging is inactive) then\n          :shutdown;\n          stop\n        endif\n      case(remote mode is enabled and high-voltage shutdown request=0)\n        :switch to state 155;\n        if (remote mode is disabled and fast charging is inactive) then\n          :shutdown;\n          stop\n        endif\n    endswitch\n  endif\nendif\nend"}
{"content":"After the system starts up, if fast charging is active, it enters the \"power-up\" state. If a high-voltage shutdown request equals 2 and the DCDC state is 1, the system then enters state 175. Following this:\n\n1.  If the DCDC state becomes 0, switch to state 185. Then:\n    a.  If fast charging becomes inactive, switch to state 180. Shut down and end.\n    b.  If the power battery relay control equals 0, switch to state 180. Shut down and end.\n    c.  If a pre-charge failure occurs, switch to state 180. If fast charging is also inactive at this point, shut down and end.\n\n2.  If the DCDC state is 0 and the insulation resistance is low, switch to state 185. After 30 seconds, switch to state 180. If fast charging is inactive when reaching state 180, shut down and end.\n\n3.  If GW_trigger equals 2 and the remote wakeup signal equals 1, switch to state 185. If fast charging is inactive at this point, switch to state 180. If GW_trigger becomes 0 after being in state 185, shut down and end.\n\n4.  If remote mode is enabled, switch to state 185. If fast charging is inactive at this point, switch to state 180. If remote mode becomes disabled after being in state 185, shut down and end.","plantuml":"start\nif (fast charging is active) then\n  :enter power-up state;\n  if (high-voltage shutdown request=2 and DCDC state=1) then(yes)\n    :enter state 175;\n    switch(condition judgement)\n    case (DCDC state=0)\n      :switch to state 185;\n      if (fast charging is inactive) then(yes)\n        :switch to state 180;\n        :shutdown;\n        stop\n      else if(power battery relay control=0)then\n        :switch to state 180;\n        if (fast charging is inactive) then(yes)\n          :shutdown;\n          stop\n        endif\n      else if(pre-charge failure occurs)then\n        :switch to state 180;\n        if (fast charging is inactive) then(yes)\n          :shutdown;\n          stop\n        endif\n      endif\n    case(DCDC state=0 and insulation resistance is low)\n      :switch to state 185;\n      while(after 30s?)\n      endwhile\n      :switch to state 180;\n      if (fast charging is inactive) then(yes)\n        :shutdown;\n        stop\n      endif\n    case(GW_trigger=2 and remote wakeup signal=1)\n      :switch to state 185;\n      if (fast charging is inactive) then(yes)\n        :switch to state 180;\n        if(GW_trigger=0)then(yes)\n          :shutdown;\n          stop\n        endif\n      endif\n    case(remote mode is enabled)\n      :switch to state 185;\n      if (fast charging is inactive) then(yes)\n        :switch to state 180;\n        if(remote mode is disabled)then(yes)\n          :shutdown;\n          stop\n        endif\n      endif\n    endswitch\n  endif\nendif\nend"}
{"content":"After the system starts up, if fast charging is active, it enters the power-up state. Then, if the high-voltage shutdown request is 2, it switches to state 186. In state 186, the behavior depends on several conditions: First, if the ignition switch is 2 and the BMS counter is 2, it stays in state 186. After that, if fast charging becomes inactive, it waits for a 2.2-second timeout before switching to state 12. Alternatively, if the BMS counter changes to 1, it switches directly to state 12. Then, if the ignition switch becomes 0, it shuts down, resets the BMS counter, and exits. Second, if the ignition switch is 2 and the onboard charger command is 0, it remains in state 186; if the command becomes 4, it switches to state 12. Additionally, if the ignition switch is 0 and fast charging is disabled, it shuts down and exits. Third, if remote mode is active and front MCU initialization is 0, it stays in state 186; if fast charging is disabled, it switches to state 12. If remote mode is disabled, it shuts down and exits. Fourth, if a pet mode request is received and front MCU initialization is 0, it remains in state 186; if fast charging is inactive, it switches to state 12. After pet mode ends, it shuts down and exits. Fifth, if the battery SOC is 20 and front MCU initialization is 0, it stays in state 186; if fast charging is disabled, it switches to state 12. If the SOC reaches 80 and the DCDC state is 3, it shuts down and exits.","plantuml":"start\nif (fast charging is active) then\n  :enter power-up state;\n  if (high-voltage shutdown request=2) then(yes)\n    :enter state 186;\n    switch(condition judgement)\n    case (ignition switch=2 and BMS counter=2)\n      :stay in state 186;\n      if (fast charging is inactive) then(yes)\n        while(after 2.2s timeout?)\n        endwhile\n        :switch to state 12;\n      else if(fast charging is inactive and BMS counter=1)then(yes)\n        :switch to state 12;\n      endif\n      if(ignition switch=0)then(yes)\n        :shutdown;\n        stop\n      endif\n    case(ignition switch=2 and onboard charger command=0)\n      :stay in state 186;\n      if (onboard charger command=4) then(yes)\n        :switch to state 12;\n        if(ignition switch=0 and fast charging is disabled)then(yes)\n          :shutdown;\n          stop\n        endif\n      endif\n    case(remote mode is enabled and front MCU initialization=0)\n      :stay in state 186;\n      if (fast charging is inactive) then(yes)\n        :switch to state 12;\n        if(remote mode is disabled)then(yes)\n          :shutdown;\n          stop\n        endif\n      endif\n    case(pet mode request is received and front MCU initialization=0)\n      :stay in state 186;\n      if (fast charging is inactive) then(yes)\n        :switch to state 12;\n        if(pet mode ends)then(yes)\n          :shutdown;\n          stop\n        endif\n      endif\n    case(battery SOC=20 and front MCU initialization=0)\n      :stay in state 186;\n      if (fast charging is inactive) then(yes)\n        :switch to state 12;\n        if(battery SOC=80 and DCDC state=3)then(yes)\n          :shutdown;\n          stop\n        endif\n      endif\n    endswitch\n  endif\nendif\nend"}
{"content":"After the system starts up, if slow charging is active and the front MCU initialization is 0, it enters state 82. From there:\n- When the BMS counter reaches 1 with a battery pre-heating demand of 3, the system transitions to state 126. If slow charging becomes inactive afterward, it shuts down and exits.\n- If a pre-charge failure occurs, the system moves to state 126. Should slow charging be inactive at that point, it shuts down and exits.\n- If slow charging deactivates, the system switches to state 126 before shutting down and exiting.\n- For AC charging/discharging system faults, the system waits through a 10-second timeout before shifting to state 126. If slow charging is inactive following this transition, it shuts down and exits.","plantuml":"start\nif (slow charging is active and front MCU initialization=0) then\n  :enter state 82;\n  if (BMS counter=1 and battery pre-heating demand=3) then\n    :switch to state 126;\n    if (slow charging is inactive) then\n      :shutdown;\n      stop\n    endif\n  else if (pre-charge failure occurs) then\n    :switch to state 126;\n    if (slow charging inactive) then\n      :shutdown;\n      stop\n    endif\n  else if (slow charging is inactive) then\n    :switch to state 126;\n    :shutdown;\n    stop\n  else if (AC charging/discharging system fault) then\n    while(after 10s)\n    endwhile\n    :switch to state 126;\n    if (slow charging inactive) then\n      :shutdown;\n      stop\n    endif\n  endif\nendif\nend"}
{"content":"After the system starts up, if slow charging is active and the front MCU high-voltage detection flag is 0, it switches to state 93. Then:\n1. If the front MCU high-voltage flag is 1 and charging/discharging power-up is 1, the system switches to state 95.\n   a. If a pre-charge failure occurs, it switches to state 115. Additionally, if slow charging is inactive, the system shuts down and exits.\n   b. If an AC charging/discharging system fault occurs, it switches to state 115. Also, if slow charging is inactive, it shuts down and exits.\n   c. If slow charging is inactive, it switches to state 115 and then shuts down and exits.\n2. If the DCDC state is 1 and there is no battery pre-heating demand, it switches to state 95. If power-up readiness exists along with pre-heating demand, it switches to state 115. In either case, if slow charging is inactive, it shuts down and exits.\n3. If the front MCU high-voltage flag is 1 and power-up readiness is present, it switches to state 93. Then:\n   a. If the vehicle charging/discharging mode is 1 and the power battery charging demand is 2, it switches to state 95 and then to state 115. If slow charging is inactive, it shuts down and exits.\n   b. If the charging/discharging power-up guidance is 2 or 3, it switches to state 115. And if slow charging is inactive, it shuts down and exits.\n   c. If the vehicle charging/discharging mode is 1, it switches to state 115, shutting down and exiting if slow charging is inactive.\n   d. If the power battery charging demand is 2, it switches to state 115, and if slow charging is inactive, it shuts down and exits.\n   e. If the battery pre-heating demand is 3, it switches to state 115, with shutdown and exit if slow charging is inactive.","plantuml":"start\nif (slow charging is active and front MCU high-voltage detection flag=0) then(yes)\n  :switch to state 93;\n  if (front MCU high-voltage flag=1 and charging/discharging power-up=1) then(yes)\n    :switch to state 95;\n    if (pre-charge failure) then(yes)\n      :switch to state 115;\n      if (slow charging is inactive) then(yes)\n        :shutdown;\n        stop\n      endif\n    else if (AC charging/discharging system fault) then\n      :switch to state 115;\n      if (slow charging is inactive) then\n        :shutdown;\n        stop\n      endif\n    else if (slow charging is inactive) then\n      :switch to state 115;\n      :shutdown;\n      stop\n    endif\n  else if(DCDC state=1 and no battery pre-heating demand)then\n    :switch to state 95;\n    if(power-up readiness and pre-heating demand exist)then(yes)\n      :switch to state 115;\n      if (slow charging is inactive) then\n        :shutdown;\n        stop\n      endif\n    endif\n  else if(front MCU high-voltage flag=1 and power-up readiness)then\n    :switch to state 93;\n    switch(condition judgement)\n      case(vehicle charging/discharging mode=1 and power battery charging demand=2)\n        :switch to state 95;\n        :switch to state 115;\n        if (slow charging is inactive) then\n          :shutdown;\n          stop\n        endif\n      case(charging/discharging power-up guidance=2 or 3)\n        :switch to state 115;\n        if (slow charging is inactive) then\n          :shutdown;\n          stop\n        endif\n      case(vehicle charging/discharging mode=1)\n        :switch to state 115;\n        if (slow charging is inactive) then\n          :shutdown;\n          stop\n        endif\n      case(power battery charging demand=2)\n        :switch to state 115;\n        if (slow charging is inactive) then\n          :shutdown;\n          stop\n        endif\n      case(battery pre-heating demand=3)\n        :switch to state 115;\n        if (slow charging is inactive) then\n          :shutdown;\n          stop\n        endif\n    endswitch    \n  endif\nendif\nend"}
{"content":"After the system starts up, if the ignition switch is set to 2, transition to state 30. Then, under that condition:\n- If the ignition switch becomes 0, move to state 49 and exit.\n- If the fast charge Vcc2 is 6, observe the charging gun indicator. Should the charging system command be 4, switch to state 29.\n- If the ignition switch is 0 and Vcc2 is 12, proceed to state 49 and exit.\n- If slow charging is active and the charging system command is 1, transition to state 110. If the command is 4 instead, go to state 29. Also, if the ignition switch is 0 and slow charging is not active, shift to state 49 and exit.\n\nIf remote mode is enabled, switch to state 28. If it's disabled, transition to state 49 and exit.\n\nFor slow charging: if it's active, move to state 110. If it's disabled, switch to state 129 and end.\n\nRegarding fast charging: if active, transition to state 170. If disabled, go to state 189 and end.\n\nFinally, if GW_trigger is 2, switch to state 10. If the battery SOC is 20 and the DCDC state is 1, transition to state 28. If the SOC is 80 and the DCDC state is 3, move to state 49. If the DCDC state is 0 and GW_trigger is 0, exit.","plantuml":"start\nif (ignition switch=2) then(yes)\n  :switch to state 30;\n  if (ignition switch=0) then(yes)\n    :switch to state 49;\n    stop\n  else if (fast charge Vcc2=6) then\n    :observe charging gun indicator;\n    if (charging system command=4)then(yes)\n      :switch to state 29;\n      if(ignition switch=0 and Vcc2=12)then(yes)\n        :switch to state 49;\n        stop;\n      endif\n    endif\n  else if(slow charging is active and charging system command=1)then\n    :switch to state 110;\n    if(charging system command=4)then(yes)\n      :switch to state 29;\n      if(ignition switch=0 and slow charging is inactive)then(yes)\n        :switch to state 49;\n        stop;\n      endif\n    endif\n  endif\nelse if (remote mode enabled) then\n  :switch to state 28;\n  if(remote mode is disabled)(yes)\n    :switch to state 49;\n    stop\n  endif\nelse if (slow charging is active) then\n  :switch to state 110;\n  if(slow charging is inactive)(yes)\n    :switch to state 129;\n    stop\n  endif\nelse if (fast charging is active) then\n  :switch to state 170;\n  if(fast charging is inactive)(yes)\n    :switch to state 189;\n    stop\n  endif\nelse if(GW_trigger=2)then\n  :switch to state 10;\n  if(battery SOC=20 and DCDC state=1)then(yes)\n    :switch to state 28;\n    if(SOC=80 and DCDC state=3)then(yes)\n      :switch to state 49;\n      if(DCDC state=0 and GW_trigger=0)then(yes)\n        stop\n      endif\n    endif\n  endif\nendif\nend"}
{"content":"After the system starts up, the following steps occur:\n\nFirst, for remote mode handling: if remote mode is enabled, switch to the remote power-up state; if disabled, switch to state 49. Then, if GW_trigger equals 2 and battery SOC is 20, switch to state 28; if GW_trigger equals 0 and DCDC state is 3, shut down and exit.\n\nNext, for slow charging handling: if slow charging is active, switch to the slow charging power-up state; if inactive, switch to state 129. Then, if GW_trigger equals 2 and SOC is 20, switch to state 28; if GW_trigger equals 0 and DCDC state is 3, shut down and exit.\n\nThen, for fast charging handling: if fast charging is active, switch to the fast charging power-up state; if inactive, switch to state 189. Then, if GW_trigger equals 2 and SOC is 20, switch to state 28; if GW_trigger equals 0 and DCDC state is 3, shut down and exit.\n\nAfter that, in the fourth step: if GW_trigger equals 2, switch to state 10; if SOC is 20, switch to state 28; if GW_trigger equals 0 and SOC is 80, switch to state 49.\n\nFollowing this, additional checks are performed:\n- If the ignition switch is set to 2, switch to state 30; if it is 0, shut down and end.\n- If remote mode is enabled, switch to state 28; if disabled, shut down and end.\n- If slow charging is active, switch to state 110; if inactive, shut down and end.\n- If fast charging is active, switch to state 170; if inactive, shut down and end.","plantuml":"start\nif (remote mode enabled) then\n  :switch to remote power-up state;\n  if(remote mode is disabled)then(yes)\n    :switch to state 49;\n    if(GW_trigger=2 and battery SOC=20)then(yes)\n      :switch to state 28;\n      if(GW_trigger=0 and DCDC state=3)then(yes)\n        :shutdown;\n        stop\n      endif\n    endif\n  endif\nelse if (slow charging active) then\n  :switch to slow charging power-up state;\n  if(slow charging is inactive)then(yes)\n    :switch to state 129;\n    if(GW_trigger=2 and SOC=20)then(yes)\n      :switch to state 28;\n      if(GW_trigger=0 and DCDC state=3)then(yes)\n        :shutdown;\n        stop\n      endif\n    endif\n  endif\nelse if (fast charging active) then\n  :switch to fast charging power-up state;\n  if(fast charging is inactive)then(yes)\n    :switch to state 189;\n    if(GW_trigger=2 and SOC=20)then(yes)\n      :switch to state 28;\n      if(GW_trigger=0 and DCDC state=3)then(yes)\n        :shutdown;\n        stop\n      endif\n    endif\n  endif\nelse if (GW_trigger=2) then(yes)\n  :switch to state 10;\n  if(battery SOC=20)then(yes)\n    :switch to state 28;\n    if (GW_trigger=0 and SOC=80) then(yes)\n      :switch to state 49;\n      switch(condition judgement)\n        case(ignition switch=2)\n          :switch to state 30;\n          if(ignition switch=0)then(yes)\n            :shutdown;\n            stop\n          endif\n        case(remote mode is enabled)\n          :switch to state 28;\n          if(remote mode is disabled)then(yes)\n            :shutdown;\n            stop\n          endif\n        case(slow charging is active)\n          :switch to state 110;\n          if(slow charging is inactive)then(yes)\n            :shutdown;\n            stop\n          endif\n        case(fast charging is active)\n          :switch to state 170;\n          if(fast charging is inactive)then(yes)\n            :shutdown;\n            stop\n          endif\n      endswitch\n    endif\n  endif\nendif\nend"}
