{"content":"As a broker team member, I want to make some updates to the SQL codes for clarity.","plantuml":"start\n:Make updates to SQL codes;\nstop"}
{"content":"As a Data user, I want to have the 12-19-2017 deletions processed.","plantuml":"start\n:Process 12-19-2017 deletions;\nstop"}
{"content":"As an Owner, I want to design a schedule from the UI SME, so that I know the potential timeline of the UI improvements wanted.","plantuml":"start\n:Design a schedule from UI SME;\n:Get timeline of the UI improvements;\nstop"}
{"content":"As an owner, I only want zero-padded fields, so that I can justify padding.","plantuml":"start\n:Use zero-padded fields;\n:Justify padding;\nstop"}
{"content":"As a Developer, I want D Files generation requests to be managed and cached, so that duplicate requests do not cause performance issues.","plantuml":"start\n:Manage D Files generation requests;\n:Cache D Files generation requests;\n:Avoid performance issues caused by duplicate requests;\nstop"}
{"content":"As an agency user, I want the FABS validation rules to accept zero and blank for non-loan records.","plantuml":"start\n:Accept zero and blank for non-loan records;\nstop"}
{"content":"As a website user, I want to see updated financial assistance data daily.","plantuml":"start\n:Update financial assistance data daily;\nstop"}
{"content":"As a UI designer, I want to schedule user testing, so that I can give the testers advanced notice to ensure buy-in.","plantuml":"start\n:Schedule user testing;\n:Give advanced notice to ensure buy-in;\nstop"}
{"content":"As a UI designer, I want to move on to round 2 of DABS or FABS landing page edits, so that I can get approvals from leadership.","plantuml":"start\n:Move on to round 2 landing page edits;\nsplit\n:DABS landing page edits;\nsplit again\n:FABS landing page edits;\nend split\n:Get approvals from leadership;\nstop"}
{"content":"As a UI designer, I want to move on to round 2 of Homepage edits, so that I can get approvals from leadership.","plantuml":"start\n:Move on to round 2 of Homepage edits;\n:Get approvals from leadership;\nstop"}
{"content":"As a Customer, I want to Create a Customer Portal User Account, so that I can log on to the Customer Portal and perform transactions that first require user authentication.","plantuml":"start\n:Create a Customer Portal User Account;\n:Log on to Customer Portal;\n:Perform transactions that first require user authentication;\nstop"}
{"content":"As a Staff member, I want to Perform a Completeness Review, so that I can validate when an application is complete and eligible for further technical review.","plantuml":"start\n:Perform a Completeness Review;\n:Validate when application is complete and eligible;\nstop"}
{"content":"As an Applicant, I want to Request PreApplication Assistance, so that I can receive a response to a request for a meeting or information that is a result of the preapplication assistance.","plantuml":"start\n:Request PreApplication Assistance;\nsplit\n:Receive a response to a request for a meeting;\nsplit again\n:Receive result of preapplication assistance;\nsplit end\nstop"}
{"content":"As a Staff member, I want to Manage Hearing Calendars, so that I can track hearing-related activities and due dates.","plantuml":"start\n:Manage Hearing Calendars;\n:Track hearing-related activities and due dates;\nstop"}
{"content":"As an Inspection Supervisor, I want to Manage Inspector Workload, so that I can meet service level and quality requirements.","plantuml":"start\n:Manage Inspector Workload;\n:Meet service level and quality requirements;\nstop"}
{"content":"As an Applicant, I want to Complete Building Development Project, so that I can receive any posted bond and/or obtain occupancy.","plantuml":"start\n:Complete Building Development Project;\nfork\n:Receive posted bond;\nfork again\n:Obtain occupancy;\nfork end\nstop"}
{"content":"As an Inspection Staff Supervisor, I want to Assign Inspections, so that I can make sure the appropriate Inspector receives the work.","plantuml":"start\n:Assign Inspections;\n:Receive work;\nstop"}
{"content":"As a Development Staff member, I want to Issue a Development-related Permit, so that I can grant the request to the Applicant to begin work","plantuml":"start\n:Issue a Development-related Permit;\n:Grant request to begin work;\nstop"}
{"content":"As an Enforcement Staff member, I want to Issue a Notice of Violation, so that I can provide formal communication to the responsible party.","plantuml":"start\n:Issue a Notice of Violation;\n:Provide formal communication;\nstop"}
{"content":"As a Staff member, I want to Develop a Staff Report, so that I can publish and distribute the report according to business rules.","plantuml":"start\n:Develop a Staff Report;\n:Publish report according to business rules;\n:Distribute report according to business rules;\nstop"}
{"content":"As a user, I want to be able to enter my zip code and get a list of nearby recycling facilities, so that I can determine which ones I should consider.","plantuml":"start\n:Enter zip code;\n:Get list of nearby recycling facilities;\n:Determine considered facility;\nstop"}
{"content":"As a recyclingfacility representative, I want to have access to user stats and schedules, so that I can adjust my hours and/or upgrade equipment and capacity in order to be able to accomodate larger amounts of recyclable materials.","plantuml":"start\n:Access user stats and schedules;\nsplit\n:Adjust time;\nsplit again\n:Upgrade equipment and capacity;\nsplit end\n:Accomodate larger amounts of recyclable materials;\nstop"}
{"content":"As a user, I want to be able to give my email ID, so that I can receive notifications for new events as they are posted.","plantuml":"start\n:Enter email ID;\n:Receive notifications for new events;\nstop"}
{"content":"As a company, I want to have a website that is easy to use, so that I can upload or delete stuff step by step.","plantuml":"start\n:Use website;\nsplit\n:upload content;\nsplit again\n:delete content;\nsplit end\nstop"}
{"content":"As a user, I want to view all locations of recycling centers on a map, so that I can check which routes to take to drop off waste.","plantuml":"start\n:View all locations of recycling centers on a map;\n:Check which routes to drop off wastes;\nstop"}
{"content":"As a user, I want to have a flexible pick up time, so that I can more conveniently use the website.","plantuml":"start\n:Select flexible pick-up time;\n:Use website conveniently;\nstop"}
{"content":"As a user, I want to upload my week's schedule, so that I can get recommendations for recycling centers that best fit my availability.","plantuml":"start\n:Upload week's schedule;\n:Get recommendations for recycling centers;\nstop"}
{"content":"As a developer, I want to use bootstrap in the process of developing, so that I can easily design my website.","plantuml":"start\n:Use Bootstrap in developing process;\n:Design website;\nstop"}
{"content":"As an employee, I want to get quick notifications, so that I can process cases the first time.","plantuml":"start\n:Receive quick notifications;\n:Process cases the first time;\nstop"}
{"content":"As a developer, I want to access an API from the website, so that I can integrate it and implement certain features in my own iOS application.","plantuml":"start\n:Access an API from the website;\n:Integrate API and implement certain features in own application;\nstop"}
{"content":"As an API User, I want to be able to use data to get results from multiple datasets, So that I can build user experiences based on more than one dataset more easily.","plantuml":"start\n:Use data to get results from multiple datasets;\n:Build user experiences based on dataset;\nstop"}
{"content":"As an API User, I want to be able to get a CSV output of any cube-based query, So that I can use work with tools that read CSV.","plantuml":"start\n:Get a CSV output of any cube-based query;\n:Use work with tools that read CSV;\nstop"}
{"content":"As an OpenSpending Community Member, I want to have a blog that highlights any and all projects in the open fiscal space, So that I can relate to openspending.org as the central hub of fiscal openness.","plantuml":"start\n:Get blog highlights any and all projects in the open fiscal space;\n:Relate to openspending.org as the central hub\nstop"}
{"content":"As a Data Publishing User, I want to be able to import data in Excel, So that I do not have to convert data formats in order to use the data packager.","plantuml":"start\n:Import Excel data;\n:Avoid using data packager;\nstop"}
{"content":"As an API user, I want to be able to change some of the styling of the embedded Viewer in my own platform, So that I can brand it to my own organisation's color scheme.","plantuml":"start\n:Change the styling of the embedded Viewer;\n:Brand styling to color scheme;\nstop"}
{"content":"As a Data Publishing User, I want to be able to edit the data source of data I have already imported, So that I can fix bugs or make enhancements in the API built for my data.","plantuml":"start\n:Edit imported data source;\nsplit\n:Fix bugs;\nsplit again\n:Make enhancements;\nsplit end\nstop"}
{"content":"As an API User, I want to be able to normalise measures by geographical area, So that I work with datasets in reference to their contextual constraints.","plantuml":"start\n:Normalize measures by geography;\n:Work with datasets in reference to contextual constraints;\nstop"}
{"content":"As a Data Consuming User, I want to be able to have stepped zoom on map visualisations, So that I can have better control over the navigation experience inside a map view.","plantuml":"start\n:Stepped zoom on map visualisations;\n:Get control over navigation experience;\nstop"}
{"content":"As an API User, I want to be able to get a relative percentage of a measure to the total of the dataset it comes from, So that I can build alternative displays of the data.","plantuml":"start\n:Get the relative measure percentage;\n:Build alternative displays of data;\nstop"}
{"content":"As a Data Consuming User, I want to visualize by default in treemap, bubble tree, map and pivot table the most recent year when my dataset contain multiple years, So that I'm not confused with the amounts.","plantuml":"start\n:Visualize the most recent year of dataset;\nif (Dataset contains multiple years?) then(yes)\n:Visualize by treemap, bubble tree, map and pivot table;\nstop\nelse(no)\nstop"}
{"content":"As a ResearcherGovernment Publisher, I want to add general country names to my dataset that only contains country codes, so that my dataset is more readable.","plantuml":"start\n:Edit Dataset;\nif (Dataset only contains country codes?) then(yes)\n:Add general country names;\nstop\nelse(no)\nstop"}
{"content":"As a DeveloperDataWrangler, I want to store my Data Package in GitHub and have it automatically stored into CKAN, so that I get a data API and my dataset is listed in a relevant catalog.","plantuml":"start\n:Store Data Package in GitHub;\n:Automatically stored into CKAN;\n:Get data API;\n:List dataset in. relevant catalog;\nstop"}
{"content":"As a Developer, I want Feather integration, so that I can integrate data-packaged data with pipelines that use Feather.","plantuml":"start\n:Implement Feather integration;\n:Integrate data-packaged data with pipelines;\nstop"}
{"content":"As a Developer, I want to get a Data Package into Julia in seconds, so that I can start using the data in doing analysis and visualizations.","plantuml":"start\n:Get Data Package into Julia;\n:Use data in analysis and visualizations;\nstop"}
{"content":"As a Publisher, I want to add useful metadata or add in new data columns to make the dataset more useful.","plantuml":"start\n:Make Dataset more useful;\nsplit\n   :add useful metadata;\nsplit again\n   :add in new data columns;\nend split\nstop"}
{"content":"As a publisher, I want to embed an interactive preview of my data on my site, so that users can be encouraged that this is the correct data for them.","plantuml":"start\n:Embed interactive data preview;\n:Provide data correctness;\nstop"}
{"content":"As a Researcher, I want to understand the ways in which my data is invalid, so that I can know how to fix it.","plantuml":"start\n:Understand data invalidity;\n:Fix data;\nstop"}
{"content":"As a Researcher, I want to be able to translate my EML dataset to a Data Package, so that I can benefit from the wide array of tools available for Data Packages.","plantuml":"start\n:Translate EML dataset to Data Package;\n:Get tools available for Data Packages;\nstop"}
{"content":"As a Civic Tech Activist, I want to make it easy to assess the quality of data stored by the government, so that I can make sure that government is living up to its transparency commitments.","plantuml":"start\n:Assess government data quality;\n:Live up to transparency commitments;\nstop"}
{"content":"As a RepositoryManagerResearcher, I want an app that acts as a match-making service for packaging data, so that owners are paired with data packagers.","plantuml":"start\n:Match-making service for packaging data ;\n:Pair owners with data packages;\nstop"}
{"content":"As a site member, I want to send an email to any member via a form, so that we can connect.","plantuml":"start\n:Send an email to any member via a form;\n:Connect members;\nstop"}
{"content":"As a corporatesponsor, I want to display my logo on a corporate sponsors page, so that others see the company's support of Scrum.","plantuml":"start\n:Display logo on sponsors page;\n:Get company support of Scrum;\nstop"}
{"content":"As a site visitor, I want to see a list of the most popular items on the site, so that I am most likely to read the most important or best content.","plantuml":"start\n:see list of popular items on the site;\n:Read the most important or best content;\nstop"}
{"content":"As a site visitor, I want to subscribe to an RSS feed of articles, so that I can read them without visiting the site.","plantuml":"start\n:Subscribe to an RSS feed of articles;\n:Read articles without visiting site;\nstop"}
{"content":"As a site visitor, I want to be able to get back to the home page quickly and easily, so that I don't get lost navigating.","plantuml":"start\n:Get back to the home page;\n:Avoid lost navigating;\nstop"}
{"content":"As a site administrator, I want to edit any site member profile, so that I can correct problems for members.","plantuml":"start\n:Edit site member profile;\n:Correct problems;\nstop"}
{"content":"As a Practitioner, I want to include additional details about me in my profile page, so that I can showcase my experience.","plantuml":"start\n:Include additional details in profile page;\n:Showcase experience;\nstop"}
{"content":"As a site visitor, I want to access old news that is no longer on the home page, so that I can access things I remember from the past or that others mention to me.","plantuml":"start\n:Access old news not on the home page;\n:Access things from passed or metioned before;\nstop"}
{"content":"As a company, I want to join the Scrum Alliance by paying a corporate membership fee, so that I can show the company's support of Scrum.","plantuml":"start\n:pay corporate membership fee;\n:join the Scrum Alliance;\n:Get company support of Scrum;\nstop"}
{"content":"As a site visitor, I want to view a course I can click on the trainer's name and be taken to the trainer's profile, so that I can read more about a trainer before registering for a course.","plantuml":"start\n:View a course on the trainer's name;\n:Been taken to trainer's profile;\n:Read more about trainer before registering for course;\nstop"}
{"content":"As a stakeholder, I want to see the results of user research, so that I can determine if the CMS is right for me.","plantuml":"start\n:See the results of user research;\n:Determine whether CMS is right;\nstop"}
{"content":"As a user researcher, I want to begin identifying interview participants, so that I can understand what educators and science influencers need from a future nsf.gov website.","plantuml":"start\n:Begin Identifying interview candidates;\n:Understand what educators and science influencers need;\nstop"}
{"content":"As a user researcher, I want to have a list of priority workflow candidates that we might test, so that I can make sure we're capturing the priority areas.","plantuml":"start\n:Get a list of priority workflow candidates;\n:Determine capturing priority areas;\nstop"}
{"content":"As a designer, I want to know what early indications of hypotheses might be, so that I can start planning for the first prototype.","plantuml":"start\n:Get early indications of hypothesess;\n:Start planning for first prototype;\nstop"}
{"content":"As a workshop attendee, I want to see a summary on major findings from the event.","plantuml":"start\n:Get summary on major findings from the event;\nstop"}
{"content":"As a team member, I want to determine a design direction for the beta social page, so that we can implement a beta site quickly without established brand guidelines.","plantuml":"start\n:Determine a design direction for the beta social page;\n:Implement beta site without established brand guidelines;\nstop"}
{"content":"As a team member, I want to have a high-level sense of the project timeline, so that I can plan my work.","plantuml":"start\n:Get project timeline overview;\n:Plan work;\nstop"}
{"content":"As an NSF employee, I want to join Github, so that I can participate in the issues as assigned.","plantuml":"start\n:Join GitHub;\n:Participate in the issues as assigned;\nstop"}
{"content":"As a team member, I want to understand how work moves between UX/content > visual design > front end dev for a sprint cycle.","plantuml":"start\n:Enter a sprint cycle;\n:UX/content;\n:visual design;\n:front end dev\nstop"}
{"content":"As a VisualDesigner, I want to demonstrate the value of visual design to the NSF project team, so that visual design is an integral part of a redesign.","plantuml":"start\n:Demonstrate the value of visual design;\n:Integrate visual design part of redesign;\nstop"}
{"content":"As a camp administrator, I want to be able to set a reminders related to specific tasks that has to be done.","plantuml":"start\n:Set a reminders related to specific tasks that not done;\nstop"}
{"content":"As a camp administrator, I want to be able to delete parents from the database, so that I can keep my pages free of unneeded clutter.","plantuml":"start\n:Delete parents from the database;\n:Keep pages free of unneeded clutter;\nstop"}
{"content":"As a camp administrator, I want to be able to keep my information in one place, so that the admins next year can improve on the previous years.","plantuml":"start\n:Keep information in one place;\n:Improve on previous years;\nstop"}
{"content":"As a camp administrator, I want to be able to see all my camp groups and the events scheduled for each camp group, so that I can notify counselor of what their group will be doing for the day.","plantuml":"start\n:Get all camp groups and the events scheduled for each group\n:Notify all scheduled events;\nstop"}
{"content":"As a camp administrator, I want to be able to keep camper records from previous years, so that the amount of work I need to do is lowered.","plantuml":"start\n:Keep camper records from previous years;\n:Lower amount of work;\nstop"}
{"content":"As a camp administrator, I want to be able to schedule tasks/activities for a specific camp group, so that I can track each groups daily/weekly and monthly activities.","plantuml":"start\n:Get schedule tasks/activities for a specific camp group;\n:Track each groups daily/weekly and monthly activities;\nstop"}
{"content":"As a camp administrator, I want to be able to delete tasks/activities I scheduled, so that I can keep the schedule clean of unneeded activities.","plantuml":"start\n:Delete scheduled tasks/activities;\n:Keep schedule clean of unneeded activities;\nstop"}
{"content":"As a camp administrator, I want to be able to notify parents all at once, so that they can be notified of any upcoming events.","plantuml":"start\n:Notify parents all at once;\n:Notify all upcoming events;\nstop"}
{"content":"As a camp worker, I want to be able to see which campers I am in charge of and where, so that I can make sure I am doing my job properly.","plantuml":"start\n:Get campers be in charge of and where;\n:Check property of job;\nstop"}
{"content":"As a camp administrator, I want to be able to add campers, so that I can keep track of each individual camper.","plantuml":"start\n:Add campers;\n:Keep track of each individual camper;\nstop"}
{"content":"As a developer, I want to have a list of definitions for commonly used terms, so that everyone working on the project can understand each other more easily.","plantuml":"start\n:Get list of definitions for commonly used terms;\n:Achieve easy understanding;\nstop"}
{"content":"As a participant, I want to be able start a two-minute countdown timer that all participants can see, so that I can limit the time spent discussing the estimates when I think we’ve talked long enough.","plantuml":"start\n:Start two-minute countdown timer;\nif(talk long enough?)then(yes)\n:Limit time spent discussing estimates;\nstop\nthen(no)\nstop"}
{"content":"As a Researcher, I want results to be stored in a non-identifiable way, so that I can study the data to see things like whether estimates converged around the first opinion given by \"estimator A\" for example.","plantuml":"start\n:Store results in a non-identifiable way;\n:study the data to see things;\n:determine whether estimates converged around the first opinion;\nstop"}
{"content":"As a developer, I want to have created database indexes, so that the queries run as fast as possible.","plantuml":"start\n:Get created database indexes;\n:Speed up queries running;\nstop"}
{"content":"As a user, I want to have the application respond quickly to my actions, so that I don't get bored.","plantuml":"start\n:Get quick application respond to my actions;\n:Avoid getting bored;\nstop"}
{"content":"As a moderator, I want to add an item to the list of items to be estimated, so that so that we can be flexible and accommodate situations where we think of a new story while playing.","plantuml":"start\n:Add an item to the list of items to be estimated;\n:Be flexible and acommodate situations;\nstop"}
{"content":"As a moderator, I want to see dates and times in my local timezone, so that I don't have to do timezone conversion myself.","plantuml":"start\n:Get dates and times in local timezone;\n:Avoid doing timezone conversion;\nstop"}
{"content":"As an estimator, I want to see all items we will try to estimate this session, so that I have a feel for the sizes of the various items.","plantuml":"start\n:Get session estimation items list;\n:Get feel for sized of various items;\nstop"}
{"content":"As a developer, I want to have written a site which is compliant with XHTML and CSS standards, so that as many people as possible can access the site and view it as intended.","plantuml":"start\n:Write site of XHTML/CSS standards compliance;\n:Access site and view as intended;\nstop"}
{"content":"As a participant, I want to be able to change my estimate up until the last person selects a card and all are shown, so that I can change my mind based on information I hear.","plantuml":"start\nrepeat \n:Change estimate;\nrepeat while(selects a card and all are shown?)\n:change mind based on information;\nstop"}
{"content":"As a Data Analyst, I want to update previously downloaded data package, so that that I can work with the most recent data.","plantuml":"start\n:update previously downloaded data package;\n:Work with most recent data;\nstop"}
{"content":"As a Consumer, I want to know full details of how the data package schema has changed, so that that I can adjust my scripts to handle it.","plantuml":"start\n:Get full Details of data package schema changes;\n:Adjust scripts to handle;\nstop"}
{"content":"As a Consumer, I want to view a Datapackage at a particular version online, so that that I can present/discuss the particular data timeslice of interest with other people.","plantuml":"start\n:view a Datapackage at a particular version online;\n:Present/Discuss particular data timeslice of interest;\nstop"}
{"content":"As a Web Developer, I want to be able to install multiple versions of the same datapackage separately, so that that all my projects could be developed independently and deployed locally.","plantuml":"start\n:Support multi-version datapackages;\n:Develop all projects independently;\n:Deploy projects locally;\nstop"}
{"content":"As a Publisher, I want to undelete the deleted data packages, so that that the deleted data packages is now visible again.","plantuml":"start\n:Install multiple versions of the same datapackage;\n:Show deleted data packages;\nstop"}
{"content":"As a Consumer, I want to download the data package in one file, so that that I don't have to download descriptor and each resource by hand.","plantuml":"start\n:Download the data package in one file;\n:Avoid downloading descriptor and each resource by hand;\nstop"}
{"content":"As a Publisher, I want to sign up for an account, so that that I can publish my data package to the registry and to have a publisher account to publish my data package under.","plantuml":"start\n:Sign up for an account;\n:Get publisher account;\n:Publish data package to registry;\nstop"}
{"content":"As an Owner, I want to edit my profile, so that that it is updated with new information.","plantuml":"start\n:Edit profile;\n:Upload new information;\nstop"}
{"content":"As a Publisher, I want to see real examples of published packages so that I can understand how useful and simple the datapackage format and the registry is.","plantuml":"start\n:Showcase published examples;\n:Get useful and simple datapackage format and registry;\nstop"}
{"content":"As a Publisher, I want to publish a data package where its resource data is stored on my servers but the registry caches a copy of that data, so that that if my data is lost or gets broken I still have a copy people can use.","plantuml":"start\nif(resource data stored on servers)then(yes)\nif(registry caches data copy?)then(yes)\n:publish data package;\nif(data lost or broken)then(yes)\n:get copy to use;\nstop\nendif\nendif\nendif\nstop"}
{"content":"As a collection curator, I want to create groups of users to manage permissions in the repository in an easy way.","plantuml":"start\n:Create groups of users \n:Manage permissions in the repository;\nstop"}
{"content":"As a repoadmin, I want to have the license be recorded in metadata and displayed alongside the item.","plantuml":"start\n:Record license in metadata;\n:Display license alongside the item;\nstop"}
{"content":"As a non-Duke researcher, I want to describe my team and mine's objects in the repository after they've been deposited if we've been assigned permission to edit metadata.","plantuml":"start\n:Deposit objects in repository;\nif(assign permission to edit metadta?)then(yes)\n:describe the objects;\nstop\nelse\nstop"}
{"content":"As a collection curator, I want to see a dashboard widget showing a summary of recent submissions to my collection.","plantuml":"start\n:Get summary of recent submissions to collection;\nstop"}
{"content":"As a DigitalRecords Archivist, I want to have a method to add and remove multiple people to deposit groups in specific collections, to set a date that the deposit window closes, and to have these permissions conferred on these depositors should pick up on the collection's default permission.","plantuml":"start\n:add and remove multiple people to deposit groups in specific collections;\n:set deposit window closes date;\n:confer permissions to depositors;\nstop"}
{"content":"As a depositor, I want to easily find information about which data can be assigned a DOI, how to get one, and what metadata are required.","plantuml":"start\n:Find data information assigned DOI;\n:Find information how to get data;\n:Find required metadata;\nstop"}
{"content":"As a collection curator, I want to set a date after which data will expire and be deleted or hidden then deleted.","plantuml":"start\n:Set expire date;\nif(data expired?)then(yes)\nsplit\n   :delete data;\nsplit again\n   :hide then delete data;\nend split\nstop\nelse(no)\nstop"}
{"content":"As a collection curator, I want to canonically identify authors and creators of my items by unique identifier, so that it's easier to view all of the works by that person together.","plantuml":"start\n:identify authors and creators by unique identifier;\n:View all of works;\nstop"}
{"content":"As a superuser, I want to enter and exit the superuser scope.","plantuml":"start\n:Enter superuser mode;\n:Exit superuser mode;\nstop"}
{"content":"As a repository manager, I want to specify the remote replication policy for each collection.","plantuml":"start\n:specify the remote replication policy for each collection;\nstop"}
{"content":"As a user, I want to specify as part of dataset configuration whether it is explorable.","plantuml":"start\n:Specify datasets explorable configuration;\nstop"}
{"content":"As an app developer, I want to write unit tests for an app that depends on the interface of a dataset type.","plantuml":"start\n:write unit tests for app depends on dataset type interface;\nstop"}
{"content":"As a user, I want to ensure that dataset creation fails if the dataset cannot be enabled for explore.","plantuml":"start\nif(dataset enabled for explore?)then(no)\n:fail dataset creation;\nstop\nelse(yes)\nstop"}
{"content":"As a user, I want to disable explore for a dataset that was configured for explore initially.","plantuml":"start\n:disable explore for initially explorable dataset;\nstop"}
{"content":"As a dataset developer, I want to deploy a new version of a dataset type without affecting the dataset instances of that type.","plantuml":"start\n:deploy new version of dataset type;\nstop"}
{"content":"As an app developer, I want to ensure that when I deploy a new version of an app that includes an older version of a dataset type deployed by another app and I expect that the dataset instances created by this app use the dataset type code included in this app.","plantuml":"start\n:Deploy new version of app;\nif(it includes older version of dataset type?)then(yes)\n:dataset instances use type code;\nstop\nelse(no)\nstop"}
{"content":"As a user, I want to trigger a migration process for a dataset if updating its properties requires that.","plantuml":"start\nif(update dataset properties requires migration?)then(yes)\n:trigger migration process for dataset;\nstop\nelse(no)\nstop"}
{"content":"As an app developer, I want to tolerate existing datasets if their properties are different but compatible when creating a dataset as part of app deployment.","plantuml":"start\n:create datasets in app deployment;\nif(properties are different but compatible?)then(yes)\n:tolerate existing datasets;\nstop\nelse(no)\nstop"}
{"content":"As a pipeline developer, I want to upgrade a dataset instance to a newer version of the code after the pipeline was created.","plantuml":"start\n:create pipeline;\n:upgrade dataset instance to newer version of the code;\nstop"}
{"content":"As a hydrator user, I want to explore the datasets created by my pipeline.","plantuml":"start\n:explore the datasets created by pipeline;\nstop"}
{"content":"As a user,  I want to have the ability to change the sharing and ownership of multiple files.","plantuml":"start\n:change the sharing and ownership of multiple files;\nstop"}
{"content":"As a user, I want to view how an experimental protocol has evolved over time.","plantuml":"start\n:Get experimental protocal evolve;\nstop"}
{"content":"As a researcher, I want to upload files prior to having them attached to a log book page using a mapped network drive.","plantuml":"start\n:upload files prior;\n:attach files to log book page using mapped network drive;\nstop"}
{"content":"As a user, I want to enter metadata / describe an experiment protocol before a file is even created.","plantuml":"start\nsplit\n   :enter metadata;\nsplit again\n   :describe an experiment protocol;\nend split\n: cerate file ;\nstop"}
{"content":"As a user, I want to either keep a logbook entry private or share it with individuals rather than groups.","plantuml":"start\nsplit\n   :keep logbook entry private;\nsplit again\n   :share logbook entry with individuals;\nend split\nstop"}
{"content":"As a systems administrator, I want  to install Neurohub dependencies into an Ubuntu 10.04 LTS machine using the normal Ubuntu package management tools.","plantuml":"start\n:Use Ubuntu package management;\n: Install Neurohub dependencies into an Ubuntu 10.04 LTS machine;\nstop"}
{"content":"As a user, I want to assign bespoke information to a file dependent on its type.","plantuml":"start\n:check file type;\n:assign bespoke information to a file;\nstop"}
{"content":"As a researcher, I want to indicate within my electronic log book which experimental data is good/bad, hide the bad data, but still keep it in the system just in case it is useful in the future.","plantuml":"start\n:indicate experimental data within electronic log book;\nif(data is good/bad?)then(bad)\n:hide bad data;\n:keep bad data in the system;\nstop\nelse(good)\nstop"}
{"content":"As a researcher, I want to have the details of the workflow plan as well as the execution history and results recorded in Neurohub while executing a workflow","plantuml":"start\n:execute workflow;\nsplit\n:Get the details of the workflow plan;\nsplit again\n:Get the execution history;\nsplit again\n:Get results recorded in Neurohub;\nend split\nstop"}
{"content":"As a user, I want to associate together files involved in a experiment.","plantuml":"start\n:associate together files involved in a experiment;\nstop"}
{"content":"As an OlderPerson, I want to have ALFRED to detect falls and send an emergency to a specific contact.","plantuml":"start\n:have ALFRED to detect falls;\n:send an emergency to a specific contact\nstop"}
{"content":"As a developer, I want to be able to design my App on my own - though there will be a few rules I have to stand to.","plantuml":"start\n:design own App;\n:stand to a few rules;\nstop"}
{"content":"As an OlderPerson, I want to use ALFRED to learn about art expositions or a museum.","plantuml":"start\n:use ALFRED to learn about art expositions or a museum;\nstop"}
{"content":"As an OlderPerson, I want to have an introduction conversation with ALFRED, so that I can learn everything about him and he about me.","plantuml":"start\n:have an introduction conversation with ALFRED;\n:Get information about ALFRED;\nstop"}
{"content":"As an OlderPerson, I want to receive a reminder from ALFRED on all the things I need to bring with me when I leave the house.","plantuml":"start\n:leave the house;\n:receive a reminder from ALFRED on all the things;\nstop"}
{"content":"As an OlderPerson, I want to see my vital parameters myself on the phone.","plantuml":"start\n:see vital parameters on the phone;\nstop"}
{"content":"As an OlderPerson, I want to receive a wake up call from ALFRED in the morning checking on me if I am ok.","plantuml":"start\n:receive a wake up call from ALFRED in the morning;\n:check OlderPerson condition\nstop"}
{"content":"As an OlderPerson, I want to use ALFRED to help me navigate despite my mild cognitive impairments.","plantuml":"start\n:Suffer from mild cognitive impairments;\n:use ALFRED to navigate;\nstop"}
{"content":"As an OlderPerson, I want to do guided exercises with ALFRED and ALFRED should also use sensors to capture health data while I am doing exercises.","plantuml":"start\n:do exercise;\n:get guided exercises with ALFRED;\n:use sensors to capture health data;\nstop"}
{"content":"As an OlderPerson, I want to have an ALFRED device that can be easily adapted for user that have hearing trouble.","plantuml":"start\n:get an ALFRED device;\n:adapt for user had hearing trouble;\nstop"}
{"content":"As a authenticateduser, I want to submit a session at BADCAMP, so that I can get my session evaluated.","plantuml":"start\n: submit a session at BADCAMP;\n:get session evaluated;\nstop"}
{"content":"As a sponsor, I want to sponsor a summit that matches my brand, so that I can get exposure to potential customers and otherwise tout my Drupal credentials.","plantuml":"start\n:sponsor a summit that matches my brand;\n:get exposure to potential customers;\n:tout Drupal credentials;\nstop"}
{"content":"As a authenticateduser, I want to identify myself as and pay for a $350 company sponsorship, so that I can easily become a sponsor at this level without having to interface with badcamp personnel to get a sponsorship.","plantuml":"start\n:identify user;\n:pay for a $350 company sponsorship;\n:become sponsor at this level;\n:Avoid having to interface with badcamp personnel to get a sponsorship;\nstop"}
{"content":"As a anonymoususer, I want to find session information, so that I can go to a session.","plantuml":"start\n:find session information;\n:go to session;\nstop"}
{"content":"As a sponsor, I want to Link to my sponsorship profile from my job listings, so that recruits can learn more about my organization.","plantuml":"start\n:Link to sponsorship profile from job listings;\nstop"}
{"content":"As a trainee, I want to must accept the cancellation terms with a checkbox, so that they can be accountable.","plantuml":"start\n:accept the cancellation terms with a checkbox;\n:make terms accountable;\nstop"}
{"content":"As a administrator, I want to bulk approve sessions as accepted, so that I can save time.","plantuml":"start\n:bulk approve sessions as accepted;\n:save time;\nstop"}
{"content":"As a anonymoususer, I want to register to speak at BADCamp, so that I submit a session.","plantuml":"start\n:register to speak at BADCamp;\n:submit session;\nstop"}
{"content":"As a anonymoususer, I want to have a link on the home page to a list of training options, so that I can take training.","plantuml":"start\n:Get a link on the home page to a list of training options;\n:take training;\nstop"}
{"content":"As a trainee, I want to limit to one registration per day per authenticated user, so that we don't have duplicate spaces.","plantuml":"start\n:limit to one registration per day per authenticated user;\n:avoid having duplicate spaces;\nstop"}
{"content":"As an IT manager, I want to know about IT resource requirements early in the project lifecycle, so that I can enable resource acquisition planning.","plantuml":"start\n:Get IT resource requirements early in the project lifecycle;\n:Enable resource acquisition planning;\nstop"}
{"content":"As a researcher, I want to import metadata that I captured with a metadata tool, so that I do not have to capture it again in a DMP.","plantuml":"start\n:capture with metadata tool;\n:import metadata;\n:avoid capturing again in DMP;\nstop"}
{"content":"As a Postgraduate Convenor, I want to receive regular summary reports of research data, so that I understand trends in data use among staff and postgraduate students.","plantuml":"start\n:receive regular summary reports of research data;\n:get trends in data use among staff and postgraduate students;\nstop"}
{"content":"As a PI, I want to plan what kind of data I want to store, so that I can ensure it will be possible to store it.","plantuml":"start\n:plan what kind of data to store;\n:check store possibility;\nstop"}
{"content":"As a Director of Research Integrity, I want to access reports containing details of research projects in which data are classified as sensitive or highly sensitive, so that I can confirm security protocols are applied to these data.","plantuml":"start\n:access reports containing details of research projects\n:classify data as sensitive or highly sensitive;\n:confirm applied security protocols;\nstop"}
{"content":"As a data manager, I want to have references to documentation of the data and its creation process, so that the data can be re-used and managed.","plantuml":"start\n:Get references to documentation of the data and its creation process;\n:re-use and manage data;\nstop"}
{"content":"As a institutional data steward, I want to be able to extract the data sets that are submitted to external repositories, so that I can add them to an institutional data catalogue.","plantuml":"start\n: extract the data sets that are submitted to external repositories;\n: add data sets to institutional data catalogue;\nstop"}
{"content":"As a data manager, I want to know which kind of data types will be produced or collected, so that I can determine what basic support services and functionalities are required.","plantuml":"start\n:get data types will be produced or collected;\n: Determine required basic support services and functionalities;\nstop"}
{"content":"As a data manager, I want to know which formats are used, so that I know what technology or background information might be necessary to use the data.","plantuml":"start\n:Get formats are used;\n:Get necessary technology or background information;\nstop"}
{"content":"As a faculty data steward, I want to see the sections on roles, so that I can ensure sufficient expertise on data management to support the project.","plantuml":"start\n:see the sections on roles;\n:Check sufficient expertise on data management;\nstop"}
{"content":"As User, I want to be able to log in.","plantuml":"start\n:log in;\nstop"}
{"content":"As an Archivist, I want to associate an Instance with a Container.","plantuml":"start\n:associate an Instance with a Container;\nstop"}
{"content":"As a systems administrator, I want to be able to control the location of the demo database and I want it to be backed up.","plantuml":"start\n:control the location of the demo database;\n:set database backups;\nstop"}
{"content":"As an Archivist, I want to upload an EAD for import from within the frontend application.","plantuml":"start\n:upload an EAD for frontend application import;\nstop"}
{"content":"As an Application Administrator , I want to be able to configure the help center URL and topic mappings.","plantuml":"start\n:configure the help center URL and topic mappings;\nstop"}
{"content":"As an Archivist, I want to associate a Subject record with a Resource description.","plantuml":"start\n:associate Subject record with Resource description;\nstop"}
{"content":"As a User , I want to authenticate using LDAP.","plantuml":"start\n:authenticate using LDAP;\nstop"}
{"content":"As an Authenticated User, I want to get access to links to contextual help.","plantuml":"start\n:get access to links to contextual help;\nstop"}
{"content":"As a user, I want backend changes for bulk updating one enum value to another.","plantuml":"start\n:changes for bulk updating enum value;\nstop"}
{"content":"As an Archivist, I want to manage Digital Objects.","plantuml":"start\n:manage Digital Objects;\nstop"}
{"content":"As a depositor, I want to deposit and maintain datasets through Pure, so that I have a single onestop shop for managing my research outputs.","plantuml":"start\n:deposit and maintain datasets through Pure;\n:get single onestop shop for managing research outputs;\nstop"}
{"content":"As a depositor, I want to link datasets with the project DMP, so that compliance with DMP can be demonstrated and whole project workflow is linked together.","plantuml":"start\n:link datasets with the project DMP;\n:demonstrate compliance with DMP;\n:link whole project workflow;\nstop"}
{"content":"As a data reuser, I want to search the archive through the web, so that I can easily find data relevant to my needs.","plantuml":"start\n:search the archive through the web;\n:find data relevant to needs;\nstop"}
{"content":"As a depositor, I want to specify a disposal policy for my data, so that I do not accidentally breach laws or collaboration agreements.","plantuml":"start\n:specify disposal policy for data;\n:prevent from accidentally breaching laws or collaboration agreements;\nstop"}
{"content":"As a depositor, I want to link datasets to publications in Opus, so that both my data and publications are more easily discovered.","plantuml":"start\n:link datasets to publications in Opus;\n:discover both data and publications;\nstop"}
{"content":"As a Bath Data Archive administrator, I want to approve scheduled disposal of data, so that data which is still required is not destroyed.","plantuml":"start\n:approve scheduled disposal of data;\n:avoid destroying required data;\nstop"}
{"content":"As a depositor, I want to attach subject specific discoverability metadata to records, so that researchers in my discipline can find my data more easily.","plantuml":"start\n:attach subject specific discoverability metadata to records;\n:find data in easy way;\nstop"}
{"content":"As a depositor, I want to track downloads of my data, so that I can demonstrate the impact of my work.","plantuml":"start\n:track downloads of data;\n:demonstrate impact of work;\nstop"}
{"content":"As a depositor, I want to manage multiple versions of the same dataset, so that changes to the dataset are transparent and do not compromise research integrity.","plantuml":"start\n:manage multiple versions of the same dataset;\n:transparent changes to dataset;\n:avoid compromising research integrity;\nstop"}
{"content":"As a depositor, I want to deposit arbitrarily large files, so that I am not limited in what files I can and cannot deposit.","plantuml":"start\n:deposit arbitrarily large files;\n:Remove restrictions on what files can and cannot be stored;\nstop"}
{"content":"As a DAMS manager, I want to know when the copyright status for an object or object component is modified, either manually or automatically.","plantuml":"start\n:Get modified time of copyright status for object or object component;\nfork\n:manual modify;\nfork again\n:automatical modify;\nfork end\nstop"}
{"content":"As a repository manager, I want to indicate any subject that is pertinent to the component.","plantuml":"start\n:indicate subject pertinent to the component;\nstop"}
{"content":"As a repository manager, I want to indicate names related to the collection either as creator, source, or subject.","plantuml":"start\n:indicate names related to the collection;\nfork\n:check creator;\nfork again\n:check source;\nfork again\n:check subject;\nfork end\nstop"}
{"content":"As a user, I want to be able to contact repositories.","plantuml":"start\n:contact repositories;\nstop"}
{"content":"As a repository manager, I want to know of any changes made to language(s) indicated for a collection, object, or object component.","plantuml":"start\n:Get changes made to language(s);\nfork\n:collection changes;\nfork again\n:object changes;\nfork again\n:object component changes;\nfork end\nstop"}
{"content":"As a DAMS manager, I want to know, via the preservation manager, of all files for which the checksum has changed since last registered.","plantuml":"start\n:Get all files that checksum has changed since last registered;\nstop"}
{"content":"As a repository manager, I want to know, where pertinent, the hardware and software used to generate a content file.","plantuml":"start\n:Get hardware and software used to generate a content file;\nstop"}
{"content":"As a repository manager, I want to describe each component as necessary, including title, date(s), language(s), and other facets.","plantuml":"start\n:describe each component;\nfork\n:describe title;\nfork again\n:describe date(s);\nfork again\n:describe languages(s);\nfork again\n:describe other facets;\nfork end\nstop"}
{"content":"As a user, I want to search by for collections and objects by name.","plantuml":"start\n:search by for collections and objects by name;\nstop"}
{"content":"As a user, I want to know if an object or object component is under copyright and, where possible, who the rights holder is.","plantuml":"start\n:Check object or object component;\nfork\n:check copyright;\nfork again\n:check possibility;\nfork again\n:check right holders;\nfork end\nstop"}
{"content":"As an archivist, I want to mark individual files as restricted, so that they don't get shared by mistake.","plantuml":"start\n: mark individual files as restricted;\n: avoid getting shared by mistake;\nstop"}
{"content":"As an archivist, I want to upload inventories, so that our donor representatives have an easier time requesting their material.","plantuml":"start\n:upload inventories;\n:get time requesting material;\nstop"}
{"content":"As an assistant archivist, I want to upload and tag staff generated working papers, so that staff and researchers are able to easily access them.","plantuml":"start\n:upload and tag staff generated working papers;\n:access papers;\nstop"}
{"content":"As a researcher, I want to browse through files in a collection.","plantuml":"start\n:browse through files in a collection;\nstop"}
{"content":"As an archivist, I want to search individual material types.","plantuml":"start\n:search individual material types;\nstop"}
{"content":"As an administrator, I want to allow users to log in using Active Directory credentials, so that I don't have to manage another set of usernames and passwords.","plantuml":"start\n:allow users to log in using Active Directory credentials;\n:avoid managing set of usernames and passwords;\nstop"}
{"content":"As an archivist, I want to browse through files in a collection.","plantuml":"start\n:browse through files in a collection;\nstop"}
{"content":"As an archivist, I want to restrict a group of files from view.","plantuml":"start\n:Restrict a group of files from view;\nstop"}
{"content":"As an archivist, I want to provide access to digital copies of unprocessed material, so that donors can access things they have given us.","plantuml":"start\n:provide access to digital copies of unprocessed material;\n:access given things;\nstop"}
{"content":"As a researcher, I want to generate structured citation data, so that so I can cite a file in a publication.","plantuml":"start\n:generate structured citation data;\n:cite files in publication;\nstop"}
{"content":"As an administrator, I want to be able to use systems such as Symplectic Elements and Activity Insight to properly track faculty scholarly output in the repositories, so that I can facilitate personnel decisions.","plantuml":"start\n:use systems to track faculty scholarly output in the repositories;\n:facilitate personnel decisions;\nstop"}
{"content":"As a faculty member, I want to recommend a digital collection be built in the repository, so that I can assist in my research.","plantuml":"start\n:recommend digital collection be built in the repository;\n:assist in research;\nstop"}
{"content":"As a library staff member, I want to be able to tell the researchers I'm helping with DMPs that Cornell has a repository system I can use for archiving and sharing results of their research, so that I can easily meet the needs of funder DMP requirements.","plantuml":"start\n:use repository for archiving and sharing results of research;\n:meet needs of funder DMP requirements;\nstop"}
{"content":"As a researcher, I want to discover items in the repository through the library's discovery system and Google, so that I can facilitate my easy use of the content.","plantuml":"start\n:discover items in the repository through the library's discovery system and Google;\n:facilitate easy use of content;\nstop"}
{"content":"As an academicresearcher, I want to the thesis paper of an influential judge or legal thinker to gain insight into how their initial scholarship got started.","plantuml":"start\n:get thesis paper of influential judge or legal thinker;\n:gain insight into how initial scholarship start;\nstop"}
{"content":"As a DB/IR administrator, I want to have the system recognize/categorize document type (e.g. historical report still published, expired historical report, single topic dataset, broad topic dataset, report with subtopic, computer file), so that report/dataset is processed and displayed properly.","plantuml":"start\n:recognize/categorize document type;\nfork\n:process historical report still published;\nfork again\n:process expired historical report;\nfork again\n:process single topic dataset;\nfork again\n:process broad topic dataset,;\nfork again\n:process report with subtopic;\nfork again\n:process computer file;\nfork end\nstop"}
{"content":"As a library staff member, I want to be able to add custom metadata fields for deposits I make on behalf of researchers to allow for better search capabilities.","plantuml":"start\n: add custom metadata fields for deposits;\n:allow for better search capabilities;\nstop"}
{"content":"As a Cornell faculty member, I want to associate a researcherID or ORCID with a submission, so that there is no ambiguity between my work and someone else with the same name.","plantuml":"start\n:associate a researcherID or ORCID with a submission;\n:avoid ambiguity between my work and others;\nstop"}
{"content":"As an administrator, I want to disseminate the aforementioned works in a digital space that is strongly branded, so that I can make sure my school is credited for the work.","plantuml":"start\n:disseminate the aforementioned works in a digital space;\nstop"}
{"content":"As a faculty member, I want to access a collection within the repository, so that I can obtain research materials.","plantuml":"start\n:access a collection within the repository;\n:obtain research materials;\nstop"}
{"content":"As a user, I want to get info about similar video items and segments.","plantuml":"start\n:get info about similar video items and segments;\nstop"}
{"content":"As a Zooniverse admin, I want to assess how interesting or appealing or complex a picture is based on automated analysis, citizen annotations, and comments on Talk.","plantuml":"start\n:assess picture;\nsplit\nautomated analysis;\nsplit again\n citizen annotations\nsplit again\ncomments on Talk.\nend split\nstop"}
{"content":"As a Zooniverse admin, I want to automatically detect Snapshot Serengeti images with no classifiable animals in them.","plantuml":"start\n:automatically detect Snapshot Serengeti images with no classifiable animals;\nstop"}
{"content":"As a Zooniverse admin, I want to know whether I should educate a volunteer with text, an image, or a video.","plantuml":"start\n:educate volunteer with text, an image, or a video;\nstop"}
{"content":"As a user, I want to identify persons in videos, and receive related information about them.","plantuml":"start\n:identify persons in videos, and receive related information;\nstop"}
{"content":"As a Zooniverse admin, I want to identify the number of whales heard in a single audio file.","plantuml":"start\n:identify the number of whales heard in a single audio file;\nstop"}
{"content":"As a user, I want to get info about perceptually similar video items and segments.","plantuml":"start\n:get info about perceptually similar video items and segments;\nstop"}
{"content":"As a user, I want to receive content recommendations based on most relevant news events in my area.","plantuml":"start\n:receive content recommendations based on most relevant news events ;\nstop"}
{"content":"As a user, I want to view thumbnail sequences of video segments.","plantuml":"start\n:view thumbnail sequences of video segments;\nstop"}
{"content":"As a Zooniverse admin, I want to assess the probability/weight of a volunteer’s classification based on their experience.","plantuml":"start\n:assess the probability/weight of volunteer’s classification based on experience;\nstop"}
